{
    "Abby Grind": [],
    "Al’s Habrich Ridge": [
        {
            "title": "My guide and tips for hiking in Switzerland.",
            "content": "**The (very brief) good and bad**\n\nJust about everywhere has something beautiful to enjoy. Not just the photogenic famous spots in the Alps, but the whole range, and the Jura mountains, and the flat-land.\n\nNowhere in the world is this accessible and suitable for hiking. The whole country is wonderfully set up to make it easy and carefree to get out and about. Paths are everywhere and public transport is your friend.\n\nThe flip side of this is that there is always some feeling of humanity. You can really reduce the signs of civilisation to almost nothing, and I love the mix of nature and people myself. But if you want to feel like the only person in a vast stretch of wilderness then go elsewhere.\n\nOh and it is Switzerland so you might need to sell a few organs on the black-market to afford it. Though it can be reasonable if you are careful.\n\n**Resources:**\n\n* [wanderland.ch](http://www.wanderland.ch/en/hiking-in-switzerland.html) - Just about anything you could need. Vast amounts of information and a map of the whole country with walking paths marked, and many official routes detailed. If you pay the 35CHF a year premium service you can design routes (with elevation and time estimates, also for bikes too) and download chunks of the map to your phone.\n\n* [map.geo.admin.ch](https://map.geo.admin.ch/?lang=en&topic=ech&bgLayer=ch.swisstopo.pixelkarte-farbe&layers=ch.swisstopo.zeitreihen,ch.bfs.gebaeude_wohnungs_register,ch.bafu.wrz-wildruhezonen_portal,ch.swisstopo.swisstlm3d-wanderwege&layers_visibility=false,false,false,true&layers_timestamp=18641231,,,) - High quality map of the whole country with every Wanderweg marked.\n\n* [myswitzerland.com](http://www.myswitzerland.com/en-ch/interests/hiking1.html) - lots of hiking ideas, and info on just about everything else Swiss too.\n\n* [activityworkshop.net](https://activityworkshop.net/hiking/index.html) - Selection of well detailed day and long-route hikes from across the country. \n\n* [gelbezeiten.ch](http://www.gelbezeiten.ch/) - provides publicly sourced photos of Wanderweg signs with estimated route times from a number of places. Free rather than paying 35CHF for the Wanderland access, but not so much information.\n\n* Most areas have an information office, or at least lots of leaflets with good public information and free maps (typically panoramic) showing the main routes for the area in winter and summer. Googling “Zermatt summer map” or whatever, [will usually bring up something pretty good to give you an idea of options](http://alpineadventures.net/wp-content/uploads/2013/09/trail_map_summer.jpg).\n\n* [Swiss alpine club](http://www.sac-cas.ch/en.html) - nice places to stay for high up multi-day hikes.\n\n* [Search.ch](https://meteo.search.ch/zermatt) - Weather forcast, snow info, and webcams. Or [MeteoSwiss](http://www.meteoswiss.admin.ch/home.html?tab=overview&date=20161205) is als a good weather source with a map that is useful for planning the next few days.\n\n* Most tourist regions have their own Webcams on their sites. Also useful are [webcam-4insiders](http://www.webcam-4insiders.com) which pools and stores a few days of images from many places, and [Roundshot](http://www.roundshot.com/xml_1/internet/en/application/d170/f172.cfm).\n \n* [SBB](http://www.sbb.ch/en/home.html) and the SBB app for info on transport and buying tickets.\n\n**What makes it so good?** \n\nOther than the views, the immensely varied scenery, and the 4 different cultures crashing together?\n\nThere are paths everywhere. You can quite literally start in any spot in the country and follow the network to anywhere else.\n\nTransport links are fantastic. You can easily catch a train/bus/boat/cable-car, get off and hike over a mountain pass, then jump onto another transport-line on the other side. \n\nThanks to this you can quickly check a few maps and transport links and have a plan for a day hike worked out within 5 minutes. Or just turn up somewhere at random and find something to do.\n\n**How it works**\n\nPaths are marked as [yellow “hiking paths”, red-and-white “Mountain trails”, or blue “alpine routes”.](http://www.wanderland.ch/en/hiking-trail-network-and-signalization.html)\n\nThis often doesn’t really make much sense, certainly not from the descriptions given on the website. Some of the hiking paths in the Jura are much tougher, and steeper, and higher than some of the mountain paths elsewhere. Sometimes mountain trails are wide flat paths that are literally walks in the park, and sometimes they are up steep and exposed high mountain sides. Checking the area on a map will give you the best idea.\n\nTrails are almost always very well marked, information boards with topological maps are scattered around, and [sign posts detailing the direction to take for just about every point of interest](http://i.imgur.com/D9F0m0J.jpg) are everywhere. Whether you are in a village, a lonely woodland hut, or a glacier at 3000m there will be signs. It is very hard to get lost, I have not actually been lost once - and only needed to pause to decide if I was on the right route a handful of times.\n\nEstimated times are normally given on the sign posts too. Opinion varies on whether these are reasonable, easy, or intended for sadistic special forces soldiers on a forced march. I hike quite a bit (I am fit, but not a hardcore athlete by any means) and tend to do it in ¾ or so of the time with breaks for food and admiring views.\n\nThe trails are generally really well thought out and do their best to keep you away from busy roads. Though this can sometimes get a bit absurd they lead you off a quiet back-road and just shove you along a parallel route 5m away.\n\nGenerally it is very safe and very easy. Keep an eye on the weather, don’t take shortcuts down vertical cliff faces, and don’t head off over a glacier in flip-flops and you should be fine. \n\nIf you do happen to do something silly like fall down a mountainside, then [call 1414 for the Rega mountain rescue service.](https://www.rega.ch/en/home.aspx)\n\nAccommodation is fairly easy to come by and easy to hike between  each day (if not exactly cheap). The YHA has a number of branches in cities and rural spots, though 30CHF would be cheap for a dorm room. Guesthouses and hotels are all over the place but getting a single room as cheap as 50CHF is not easy, expect to pay 70+ in many places. There are campsites all over the country too (not that even that is an especially cheap option at maybe 10CHF per person and 10CHF for the tent itself). High up there are the SAC huts too which for what they offer are quite reasonable.\n\nI have not tried wild camping myself. It seems to be a bit of a confusing and blurry area and  (as with everything in Switzerland) possibly varies with the Kanton. Based on accounts I have read it sounds like it is fairly easy to stealth camp in many quieter places, though try and ask the landowner's permission if possible. And of course should you leave no mess.\n\n**When to go.**\n\nLower routes are doable year round, but obviously the higher routes are going to blocked off for a good chunk of the year.\n\nHigh summer is obviously attractive, especially when the high passes open up. But this is the busy period, and there is a heat haze which often limits the views somewhat. As the summer goes on the meadows are cut and the flowers dwindle, and everything from mountaintop to meadow starts to look very dry.\n\nOff season in October-December and April-May (varies depending on height) means some touristic places partly shut-down for a few months and some cable cars either don’t run, or run a more limited timetable. Conditions can be wonderful or terrible for hiking.\n\nMay is a wonderful time so long as you don’t need to go much over 2000m. The peaks are still snowy, the valleys are green and filled with wild-flowers, and the air is still clear and free of the summer haze.\n\nWhat will and won’t be accessible due to snow outside of the summer is really hard to predict. The last two Decembers thanks a Föhn there has been is almost no snow until you get to above 2000m. At new New Year’s it might aswell have been mid-May for all the snow there wasn’t.\n\nThere is of course the option of snowshoeing in winter. There are also prepared paths in most resorts or anywhere that might get any tourism.\n\n**How busy or built up is it?**\n\nDepending on where you go either not at all, or fairly bad.\n\nWalk from Kleine Scheidegg to the Eigergletscher and you will constantly pass people and transport/ski infrastructure. But head out into other less known spots and you will have plenty of room and nature to yourself. \n\nObviously it can be a bit tricky to decide on a spot you know nothing about, helps if you are lucky like me and have the time to slowly try everywhere.\n\nSome routes are always busy (anywhere around Kleine Scheidegg, the Gemmi pass, or anywhere really famous with cable cars up), but the old rule of “every extra little bit of effort to get somewhere reduces the number of people who get that far” is in effect as ever. Mostly there are so many options that even when you start out with many other people they will quickly spread out into other paths.\n\nRoutes that are on ski-runs are obviously going to have bits of building site and infrastructure. Though how bad it is varies a bit.\n\nPasses can be ruined if there is a popular road. The constant roar of motorbikes isn’t much fun. Though there are plenty of passes with unpopular or no roads at all. \n\nHydroelectric and power-lines can ruin some otherwise quiet areas, but generally they are only slightly invasive and are out of the way quickly.\n\n\n**Food and water**\n\n* When high up I drink the water directly from mountain streams all the time and have not suffered any problems yet, just make sure there are no animals grazing up-stream.\n\n* Lower down fountains are common everywhere (cities, villages, farms). Unless otherwise stated the water is suitable to drinking.\n\n* Being that you are never that far from a town or village it is never much of an issue to acquire supplies. Just remember that Sunday means that shops other than those are stations and in petrol stations will almost certainly be closed. Shops (other than station/petrol station shops) tend to close at annoyingly early times like 6:30pm or earlier.\n\n* Biberli are a favourite Swiss snack of mine. Light, tasty, and tough.\n\n* During the height of summer; things like cheese and chocolate are not the best idea.\n\n* Restaurants/cafes/huts are everywhere. Sometimes these are farmhouses that have a few tables, in more touristy places there will be proper dedicated restaurants, and really high up you can get some basic food at the mountaineering huts.\n\n\n\n**So where is best? A few of my favourite routes:**\n\n* [Eggishorn and the Aletsch Panoramaweg](http://imgur.com/a/3AqlB). The giant Aletsch glacier is possibly the single best sight in the country. I highly recommend taking the cable car to Eggishorn to properly admire the whole thing from above, descending from there down to Märjelensee, then along the side of the glacier before taking a cooling dip in the lake at Bettmeralp. \n\n* [Val Verasca](http://www.wanderland.ch/en/routes/etappe-01659.html). My favourite region of Switzerland. Steep, forested mountsides leading up to shear rockfaces and with waterfalls coming down everywhere. This place is more Rivendell than Lauterbrunnen. The Rustico stone villages are far more beautiful to me than the more famous wooden alpine huts too. The valley walk is wonderful, heading up high and into the side valleys is also amazing too. One of my bucket list items here is the high ridge route [the Via Alta della Verzasca](http://www.verzasca.net/articles/176_Via.Alta.della.Verzasca). The side valleys of the adjcane Val Maggia are also wonderful.\n\n* [Flimser Wasserweg](http://www.wanderland.ch/en/routes/route-0764.html). Descend down a beautiful waterway through forests and meadows in an relatively unknown area. [Came across this route by chance and I was utterly blown away](http://i.imgur.com/A3kXWt0.jpg).\n\n* [Säntis-Ebenalp](http://imgur.com/a/cbppm). Take in the views from Säntis, then walk above Seealpsee whilst taking in the Alpstein. At the end you pass by the famous [Gasthaus-äscher](http://img.myswitzerland.com/mys/n64800/images/buehne/aescher.jpg) too.\n\n* [Lavaux Vineyards](http://www.myswitzerland.com/en-ch/lavaux-vineyard-terraces-the-swiss-wine-route.html). An easy walk (you are never as much as 200m above Lake Geneva), but with constantly stunning views and beautiful little villages. Do it Lutry to St-Saphorin for mountains in the background the whole way. It is a load of stone that faces south over a lake, so it will receive and store lots of sunlight in the summer months, expect to be warm.\n\n* [Zermatt Edelweissweg](http://www.zermatt.ch/en/Media/Planning-hikes-tours/Edelweissweg-Hoehbalmen). Climb up the beautiful Trift-gorge, then cross the Höhbalmen meadow before looping back down via the tiny village of Zmutt. After the gore there are almost constant views of the Matterhorn. Being on the side of the valley with no mountain transport it is also fairly quiet. You can drop down at Höhbalmen and cut out the last segment of the hike if you want to shorten it somewhat.\n\n* [Gasterntal](http://www.myswitzerland.com/en-ch/gasterntal.html). An almost unknown place, but one of the best spots by far in the Oberland. Cutting down from the Gemmi pass, or going to the last bit of road and walking up to the glacier. Not done the exact route in this link but anything you do there will be good. \n\n* [Gorge de Aeruse](http://www.myswitzerland.com/en-ch/through-the-areuse-gorge.html). Walk up from Boudry to Noiraigue, harder going but Noiraigue is a much nicer place to wait for a train.\n\n* [Napf](https://activityworkshop.net/hiking/switzerland/napf.html). Best done in the autumn when[ the valleys below are misty and the Alps clearly stick up over the rolling hills](http://imgur.com/a/vwKHn).\n\n* [Niederhorn-Habkern](http://www.niederhorn.ch/de/sommer/erleben/aktiv-geniessen/wandern.php#anchor_71931c6b_Accordion-3-Niederhorn-----Burgfeldstand-----Gemmenalphorn-----Habkern--3-h-45-min-). Fantastic views onto the classic Oberland (best seen from further away to appreciate the size), the flatland, and the curiously wild area to the north of this route. Lots of fairly relaxed Steinbock too.\n\n* [Princes way hike (Liechtenstein.)](http://www.tourismus.li/en/Princes-Way-Hike.html). Not technically Switzerland but it might as well be. About the only reason to go to Liechtenstein.\n\n**Other bits:**\n\n* Mind the snakes [(no really)](http://toxinfo.ch/venomous-and-nonvenomous-snake-bites-in-switzerlan), though it is fairly rare to see one.\n\n* Famous mountain passes with busy roads (Gotthard, Furka etc) are not going to be the most pleasant hikes as the constant VROOOOM of traffic and especially motorbike tours goes past all the time.\n\n* Bring sun cream. **Do not underestimate the sun at any time of year**. On my first weekend in the Oberland I thought that having just spent 6 months in Queensland I would be immune to the sun, returning to work on Monday my colleagues were delighted by the red-faced “Typisch Engländer!” in their midst.\n\n* Obvious point, but greet people with the local language.\n\n* In the German speaking parts greet people with “Grüezi” for one person or “Grüezi mitenand” for groups of people. Saying “Guten tag!” will make you look like a bit of a wanker.\n\n* “En guete” is the Swiss-German version of bon appétit, it is fairly common to say this to everyone you see eating on your walk.\n\n* You will encounter Swiss-Germans in every part of Switzerland. They utterly love the mountains. I have gone for hikes in the French and Italian speaking parts and only met German speakers. \n\n* The Swiss-Germans really do get excited by the mountains. I have gotten off buses and trains with a headache from the volume of loud chatter from groups heading out for a hike.\n\n* While we are on the topic of Swiss-German, [this](https://www.youtube.com/watch?v=kz61IcBnHOA).\n\n* I love the Swiss-Germans really.\n\n\n",
            "upvotes": 98,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "Hey! You're the guy responsible for the other Swiss info guides. Thanks a lot man. I wish I had this when I went to Switzerland. ",
                    "Upvotes": 6,
                    "Downvotes": 0
                },
                {
                    "Content": "This is amazing!! I'd also recommend wehike.ch if you are looking for a cool group hike.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Thank you!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Thank you for this. I'm considering a multi day hike and currently researching routes. \n\nI'm torn between finding a section of Via Alpina (Haute route) or maybe doing the Tour De Mont Blanc. \n\nDo you have any recommendations for a 7-10 day hike? ",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "This is amazing I might actually be going to switzerland in may. Great info!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "What do you do for a living?",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "This is amazing!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "5 years later, do you still monitor this? What a great resource! I am an American planning a summer trip to Switzerland and am looking to take my small kids on a hike to the perfect mountain hut. They can walk 2-3 miles straight uphill with no problems - hopefully the payoff is an incredible view and a really cool hut atmosphere. Any ideas?",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Super Impressed with Oak Mountain State Park (AL)",
            "content": "Had an afternoon to kill after meetings I. Birmingham and decided to go on a day hike at Oak Mountain State Park. I did not have high expectations, but wanted some elevation changes. Wow, this park blew me away and it had a little bit of everything:\n\nCliff side destination at King’s Chair\nAn old 1951 plane crash (a little underwhelming)\nShackleford Peak\nA ridge line trail (awesome!)\nWalk in thick forest \nSmall creek side trail\n\nAt the end of the hike, I wound up at about 7.5 miles, 1260 feet in elevation change and sore calves.\n\nHighly recommend!",
            "upvotes": 15,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "You should check out Ruffner Mountain if you haven’t already",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I also popped in to Oak Mountain while I was in Bham.  It's nice, I would call it more of a nature trail/walk rather than a hike.  Best part was the total absence of mosquitoes when I was there (late September).",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Mt Habrich, Squamish, BC, Canada - Looking over at Sky Pilot Mountain where I hiked the following week (Skyline Ridge Trail)",
            "content": "",
            "upvotes": 5,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I hiked up the Sea to Summit trail first thing in the morning and continued onto do Al Habrichs trail. Sweating bullets the whole way up lol. \n\nAs I was hiking and seeing these mountains in the distance, I decided I needed to go hike them as well (which I did, on another day).\n\nMy feet/legs were not happy with the 1350m climb and 450m decent, but at least the gondola carried me down and I didn't have to go down the other 900m.",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        }
    ],
    "Aldergrove Regional Park": [
        {
            "title": "A little boardwalk trail at golden hour in Lebanon Hills Regional Park, Minnesota (OC)",
            "content": "",
            "upvotes": 1511,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "Now I finally have good reason for wanting to visit Minnesota",
                    "Upvotes": 11,
                    "Downvotes": 0
                },
                {
                    "Content": "Cool seeing one of my local hikes here. Lebanon Hills has lots of great hikes. The hiking loops near the mountain bike trails are great if you want to get some hill work in.",
                    "Upvotes": 9,
                    "Downvotes": 0
                },
                {
                    "Content": "MN proud!!",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": "love it there!",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": "Oh wow. This is gorgeous",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Beautiful crooked path;)",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "I was 7 and woke much earlier than my sisters on Christmas morning. My dad bundled me up and took me to hike around Lebanon Hills. We shuffled our feet to write Merry Christmas in snow. I found a fox, long-frozen into the ice, looking as though the spring had not left his step. I can hear the purest silence, interrupted only by the crunch of snow beneath my boots. At 27, I traveled back to enjoy the changing leaves, resuming the peace I’d found here as a child. I will always be grateful for this slice of heaven that introduced me to the warm embrace of the forest. I seek it often now.",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Beautiful",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "It would be so relaxing to walk there.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Beautiful 🤩 Thanks for sharing❤️",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Love the colors!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you include the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Unreal",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I've been to that park a couple of times before, it's definitely worth it if you find yourself in Eagan.",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Some of the trails from last weekend's walk in Redwood Regional Park, CA",
            "content": "",
            "upvotes": 1226,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "Get off the road!!",
                    "Upvotes": 6,
                    "Downvotes": 0
                },
                {
                    "Content": "That's some Sleepy Hollow vibes right there. Beautiful!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Reminds me of Red Riding Hood or that level from Mario Brothers with the evil caterpillars.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Incredible",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "These look like fairy tale pictures - not real world!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Gorgeous shots",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Is that in the bay area off skyline blvd past 92",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Oakland? 😍",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Cool spot!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Grew up right off Redwood- what an awesome backyard to have",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I have to believe that this forest is mystical and fairies live amongst the trees!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "This is an amazing area of Oakland that so often gets overlooked.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I went to college in NorCal, I miss the redwoods so much!! Gorgeous shots",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "O shit that's incredibly close to where I live. a.) If you are still in the area check out Mount Diablo, b.) Did you find any Bannana Slugs?",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "And [a bonus photo of a Western Fence Lizard](https://i.imgur.com/73rt3IU.jpg) (*Sceloporus occidentalis*), which were everywhere on the hike last Saturday. We live not too far away and so come here until the early summer to escape the heat. It has a [pretty nice trail system](https://www.ebparks.org/images/Parks/Redwood/Redwood-map-2250w-20181207.gif) where you can chain together lots of little trails into something meatier, and also branch out into the e.g. adjacent Anthony Chabot Regional Park.\n\nUsually I'll pick a single photo to share here and link the rest in the comments, but IDK if anyone looks at the comments, so I'm trying out this 'collage' format instead.\n\nAlso for some reason the upload('s compression algorithm?) is really crushing the blacks, both on reddit and imgur. Had to brighten the photos up substantially or else everything is a dark mess. Even then, there's a lot less detail resolvable in the shadows of the brightened photo than in the original exports (might have been better to brighten the original RAWs but who has time for that... incidentally, Capture One seems to export JPEGs much darker than what I see in-editor after a recent upgrade to the latest version... I remember fixing this once before but don't remember my solution -- any tips?)",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Love that place! don’t tell too many people about it though ;)",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Missing the nazgul",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "The bottom right and middle one on the left are absolutely beautiful.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Watch out for the Monterey 5.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Went there last year, loved every minute of it! The atmosphere is so peaceful.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 0,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Peralta Regional Park, Gold Canyon, Arizona",
            "content": "",
            "upvotes": 496,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "California poppies in AZ? I'm calling the cops",
                    "Upvotes": 7,
                    "Downvotes": 0
                },
                {
                    "Content": "Hopefully this pic was taken from a trail.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Nice indeed.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Fantastic!",
                    "Upvotes": 2,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Alhambra Creek Trail, Briones Regional Park, California, USA",
            "content": "",
            "upvotes": 2,
            "downvotes": 0,
            "comments": []
        },
        {
            "title": "Martin Canyon Creek Trail/ Dublin Hills Regional Park",
            "content": "",
            "upvotes": 2,
            "downvotes": 0,
            "comments": []
        }
    ],
    "Alouette Mountain": [
        {
            "title": "The fast way down on Alouette Mountain, British Columbia, CA.",
            "content": "",
            "upvotes": 132,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "I thought your legs were skiis for way too long",
                    "Upvotes": 22,
                    "Downvotes": 0
                },
                {
                    "Content": "Ever since the first time I did this, I will no longer do it without an ice axe to slow me down and kind of steer.",
                    "Upvotes": 13,
                    "Downvotes": 0
                },
                {
                    "Content": "There’s a 14er in colorado where you can do the same thing and cut an hour or two off the hike lol, forgot the name",
                    "Upvotes": 4,
                    "Downvotes": 0
                },
                {
                    "Content": "Man I keep envisioning a branch of something just under the surface of the melting snow.  Nothing like a stick in the butt at sure\n\nLooks like fun though, my buddy use to carry a garbage bag with him to wrap his legs in to do the exact same.  He turned a hike down into like 30 mins from 2 hrs.  I was like wtf,  how did you do that.  He wouldn't tell me for years.",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": "I was SAR/EMT/SRT 1 and 2 in WA State USA years ago. I have been two calls where glisaders snapped their tib/fib hitting an ice block on the slide. One was open. Its is a series surgery, rehab and come back. Ill walk thanks.",
                    "Upvotes": 6,
                    "Downvotes": 0
                },
                {
                    "Content": "Off topic, but how are those Leki poles? I just bought a pair but haven't used them yet and am already questioning if they were worth the cost.",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "That doesn't look too safe",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": "Imaging a rock sticking out...",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "i thought you heard avalanche thats why you doing that.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Frozen colonic.",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Looking down on the lake from Alouette Mountain in Golden Ears Provincial Park, BC, Canada",
            "content": "",
            "upvotes": 56,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "I love this park. I plan to hike to the top of Golden Ears in a few weeks",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Alouette Mountain summit, Golden Ears Provincial Park, BC",
            "content": "",
            "upvotes": 28,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "Cool! Can you maybe share a link to the trail?\n\nI am traveling to BC in July and still looking for some nice trails.",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "You should do goldenears Mountain.  Usually we set up camp near the summit but I have done it to the top and back in 12 hours\n\nAlso the cheif im squamish is unreal as well.  Plus for 10 bucks you can take the gondola back down.  Plus there's food and beer at the top",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Alouette Mountain, Maple Ridge BC",
            "content": "",
            "upvotes": 15,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "When was this taken? and what route did you use to get up?",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Amazing Day Hikes - Alouette Mountain, Maple Ridge BC, Canada - Follow The Adventure",
            "content": "",
            "upvotes": 3,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "Thx for sharing that. I was there in early September, spent the night by the emergency shelter on panorama ridge. Beautiful place to camp. I haven’t tried it as a day hike... so much incline after alder flats, props to all those who do it in a day!",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        }
    ],
    "Alpen Mountain": [
        {
            "title": "Eiger North Face - Berner Alpen - Switzerland",
            "content": "",
            "upvotes": 21,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "This is the mountain that first got me into hiking. Fuck mountain climbing, but the idea of hiking near a mountain face like this filled me with awe.\n\nTook me multiple attempts but I finally got up to Kleine Scheidegg and walked around the area. I had no idea you could ski right there, so now I have a new reason to visit this area!",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        }
    ],
    "Anif Peak": [],
    "Bagpipe Peak": [],
    "BCMC Trail": [
        {
            "title": "Hiking the Grouse Grind in Vancouver, BC, Canada. Great way to start the day.",
            "content": "",
            "upvotes": 206,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Gorgeous! This is on my bucket list if Canada ever lets US back in.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Absolutely stunning!!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Did the grind 27yrs ago but remember it like yesterday. Up through the clouds to pure beauty and quiet above. Enjoy!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Oh my gawd that’s beautiful",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I love Grouse mountain! It’s gorgeous. Although I went in the winter ❄️",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        }
    ],
    "Bear Mountain (Harrison)": [
        {
            "title": "Bear Mountain Flats, Harrison Hot Springs, BC, Canada",
            "content": "",
            "upvotes": 93,
            "downvotes": 0,
            "comments": []
        }
    ],
    "Bear Mountain (Mission)": [],
    "Belcarra Bluffs": [],
    "Blackcomb Peak & The Spearhead": [
        {
            "title": "The Roaches & Luds Church, Peak District UK",
            "content": "",
            "upvotes": 95,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "Exquisite beautiful gorgeous majestic photos",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "That first photo looks like its in some sort of desert in America. Awesome pics!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I couldn’t find one roach! You’re good!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Loved walking around the roaches! Got some beautiful photos of them, too.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Good choice, I'm sure I can see a wallaby in that undergrowth",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I'm looking into doing an autumn hiking trip in the peak district, guess I should add this to the list.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Last two photos Iook like czechia",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Did the skyline walk in August, avoided the rain, it was beautiful, and brought back some great memories. Not a soul climbing that day, which came as a bit of a surprise.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "The last reference I've found on the net to any sighting is the very early 2000's, it's a shame,  the chance of seeing them always made a trip up there more entertaining",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "I've spent much of the summer enjoying Colorado's Rocky Mountains. But now I'm finding a newfound love for Autumn hiking. While the days are shorter & colder, there's less thunderstorms & crowds. The Summit of Torreys looking at Grays Peak.",
            "content": "",
            "upvotes": 87,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "Shhhh! \n\nStop sharing our secrets.\n\nLate September / October normally yield plenty of blue bird days, I love it.",
                    "Upvotes": 6,
                    "Downvotes": 0
                },
                {
                    "Content": "Where are all the trees?",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you include the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Just wait for winter!",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "On the way up “Progeny Peak”, Zion National Park, Utah. January 17th & 18th 2023.",
            "content": "",
            "upvotes": 20,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "Gorgeous pics, reminds me of growing up in Colorado.",
                    "Upvotes": 3,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Hiking & Snowshoeing Alone for 3 days in the Indian Peaks Wilderness - Pawnee, Crater, Mirror Lakes - Colorado - USA",
            "content": "",
            "upvotes": 8,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "A silent hiking film to tranquilly immerse you into the wilderness. I saw no one for three days and hope to share that silence and peace with you. \n\n-Day 1: Access is closed during the winter, so you must start at Arapaho Bay Camp.  I started the trail late, around 12:30 pm, and even then, the sun barely rose above the valley walls. I set up camp around 4 pm as the sun was setting. I went to sleep warm, not even wearing my down puffer, but by morning the cold was paralyzing. \n\n-Day 2: I slept through my alarms, too cold to move, and waited for the thawing of the sun. After a breakfast of oat meal and mixed nuts, I was back on trail by 11:30. There were many icy sections and I was grateful for the YakTrax. I arrived to the fork for Pawnee Pass and Crater Lake in good time. The Pawnee Pass trail was completely buried in snow, and I set first tracks guided by AllTrails topography. This was without a doubt the most stunning section of the entire hike. Eventually, after repeatedly postholing several feet and stepping through river ice, I put on my snowshoes. The last mile of trail to Pawnee lake was extremely challenging. There was an incredible density of fallen trees, river crossings, and steep inclines not suitable for snowshoes. The last half mile took nearly an hour to navigate. The sun was setting and I quickly set up camp and jumped in my sleeping bag. At 10500 ft (3200m) and having recently come from sea level, I was hyperventilating. My head ached. I feared I would need to descend, but first I would rest, slow the metabolic rate, and decrease oxygen demand. I lied there for 2-3 hours until the oxygen deficit had been paid and my breathing slowed. My body rewarmed. I proceeded to thaw snow, rehydrate, and feast on chili ramen with peanuts and mashed potatoes.\n\n-Day 3: I slept very comfortably and was quite warm despite temperatures of -15c/5F. My sleeping set up consisted of a 0F/-18c sleeping bag, a closed-cell-foam pad cut to torso length, and a full size ultralight inflatable pad at body length. I wore all my insulating layers. When the alarm went off, I quickly packed up camp and set off for Mirror and Crater Lakes. Snowshoeing back down the pass was rapid, and some sections were steep enough I essentially skied. I took off the snowshoes at the trail fork and proceeded to Mirror and Crater Lakes. This trail had already been walked and the hiking was easy. The view of the pyramidal Lone Eagle Peak was spectacular and unlike anything else in Colorado. The hike back was steady with a gentle downgrade.\n\n[AllTrails](https://www.alltrails.com/explore/map/map-november-27-2021-2-45-am-bacadc6?u=i)\n\n-Permits required during quota season: Sulphur Ranger District: 970-887-4100\n\n-Do not attempt during the winter without avalanche training.",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "hiked through a bunch of boulder fields to make this video, not sure the mileage but I regretted wearing my crocs (High Peaks in the ADKs & central VT)",
            "content": "",
            "upvotes": 0,
            "downvotes": 0,
            "comments": []
        }
    ],
    "Blanca Lake & Peak": [
        {
            "title": "High above Cracker Lake. 4 Hour scramble to reach the peak. Worth every step.📍Mt, Siyeh. Glacier National Park, Montana",
            "content": "",
            "upvotes": 4016,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "Siyeh pass trail, or somewhere else?",
                    "Upvotes": 42,
                    "Downvotes": 0
                },
                {
                    "Content": "Palms = sweating",
                    "Upvotes": 81,
                    "Downvotes": 0
                },
                {
                    "Content": "This is the best content posted here in months.",
                    "Upvotes": 26,
                    "Downvotes": 0
                },
                {
                    "Content": "Fuck that.",
                    "Upvotes": 16,
                    "Downvotes": 0
                },
                {
                    "Content": "Wow dude just wow.. And I’m sure the video doesn’t even do it justice!",
                    "Upvotes": 25,
                    "Downvotes": 0
                },
                {
                    "Content": "Absolutely beautiful.",
                    "Upvotes": 22,
                    "Downvotes": 0
                },
                {
                    "Content": "Question I’ve always had regarding hikes finishing with a scrambling section: is there a marked trail at that point? Or do you just look up the mountain and go? \n\nIf it’s the latter, how do you not get lost?",
                    "Upvotes": 16,
                    "Downvotes": 0
                },
                {
                    "Content": "You parachuted down, right?",
                    "Upvotes": 6,
                    "Downvotes": 0
                },
                {
                    "Content": "That's a great summit, which route did you take?",
                    "Upvotes": 7,
                    "Downvotes": 0
                },
                {
                    "Content": "Actually, I believe the correct term is “White People” Lake",
                    "Upvotes": 19,
                    "Downvotes": 0
                },
                {
                    "Content": "Congratulations",
                    "Upvotes": 7,
                    "Downvotes": 0
                },
                {
                    "Content": "Nearly peed my pants watching this wow!",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Beautiful and stunning. That red lichen looks really interesting. Any idea what it is ? Is it found only above a certain altitude ?",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Beautiful but also terrifying view",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": "On my list for next season. Congrats.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Wow... that’s incredible looking! So.. funny question.. the layers on those side cliffs, is each horizontal line representing where the water level was at one point?",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Beautiful view, but did anyone else notice all of that colorful lichen????",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Always nice to be reminded places like this exist",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "u/savethisvideo",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I’ve been hiking for years and had no clue there was a term for this! It’s the best.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Dude, only 4 hours? You must have really moved! \nThat's so hard to gh! What's the elevation?",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Totally doing that next year. I summited everything in that area except GTTS and Cataract this year",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "For all those looking for more about the hike here are some videos of the actual accent. Sorry but it’s from tik tok 😂\n\n[Siyeh Scramble ](https://vm.tiktok.com/ZMJxB546x/)",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Wooowww",
                    "Upvotes": 4,
                    "Downvotes": 0
                },
                {
                    "Content": "All I can think is base jump",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Damn, what a view.  I have to go back to Glacier!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Amazing view",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "That was my reaction too!   Wowwww!!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Holy crap",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Beautify.  Why don't  I see much  glacier? Is it due to global warming,  or just this part is not supposed to have?",
                    "Upvotes": 0,
                    "Downvotes": 0
                },
                {
                    "Content": "This is the first backcountry lake I ever camped at. Amazing to see it from up there!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Hoooly shit is that beautiful",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "That’s an amazing view! Crazy.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Wow!!!!!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "so beautiful view",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Awesome view!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "They also have HD scenery of this area on google earth",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "How recent was this?? Doesn’t seem like a lot of snow",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I'm a summit hiker and even I had a tiny bit of anxiety at that lol",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Amazing! Did you do that recently? Love GNP.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Did you stand on the diving board ?",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Holy cup cakes.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Wow 😍",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I’m out of breath and cold just looking at this! Great view!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Slips and falls",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Was this recently? Wondering what these trails look like after all the snow this past week!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Asolo boots?",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I could watch that over and over",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Wow! Gave me the chills",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Cracker? Crater?",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Wow incredible!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I’m scared of heights. This is so beautiful. It makes me want to overcome my fears to be able to bask in such natural beauty.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "At first I read Crater Lake, and thought\nWow, the water levels dropped drastically for some reason. \nDon’t mind me, my wife thinks I’m hilarious.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I got sweaty legs just watching that video",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Wow that's just beautiful!!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "This looks really high up after hiking from the hotel side, nice shot!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I feel like I’m gonna fall just from watching the video",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "That's one hell of a view! Very nice",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "So this is def a camp overnight kinda hike isn’t it? Haven’t been to GNP but mannnn I wanna go! Did you take any pictures of the scramble itself?",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Avalanche trail and lake in the distance?",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I misread this as Crater Lake and watched the GIF. I was very confused because this looks nothing like Crater Lake in Oregon. Then I re-read your title. Looks awesome there!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Looks like it’s been mined on a massive scale thousands of years ago",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "How's the scramble and the problems on it? All class 4? Would love to make the drive from CO",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Blanca Lake in Washington USA",
            "content": "",
            "upvotes": 2946,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "Look at the dude in the black tank top walking to the water for sense of scale",
                    "Upvotes": 46,
                    "Downvotes": 0
                },
                {
                    "Content": "Love the colors of glacier fed lakes! They always look so unreal when you see them.\n\nEdit - spelling",
                    "Upvotes": 45,
                    "Downvotes": 0
                },
                {
                    "Content": "Respect for using hiking poles.  I feel like more people should use them. Especially on rocky trails with a lot of elevation gain",
                    "Upvotes": 6,
                    "Downvotes": 0
                },
                {
                    "Content": "For anyone in the area, this lake is beautiful! But the true gem is lake Serene!",
                    "Upvotes": 7,
                    "Downvotes": 0
                },
                {
                    "Content": "Thank you for my next hike idea! \n\nAlso this must be an old picture because reading on AllTrials the road to the hike trail is still closed 😭",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Beautiful! Oh, the lake and mountains are cool too.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Iv been there twice. The glacier is much smaller than it used to be",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "I’m sure I should just google this but why is this lake this color?",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "What that recently? I’ve been wanting to do it but thought it was covered in snow!",
                    "Upvotes": 0,
                    "Downvotes": 0
                },
                {
                    "Content": "~Trippy~",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Was this recently? It’s been on my list for awhile but worried about snow still being on the trail",
                    "Upvotes": -1,
                    "Downvotes": 0
                },
                {
                    "Content": "I can't tell what is more impressive: the wild or that smile",
                    "Upvotes": -33,
                    "Downvotes": 0
                },
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 0,
                    "Downvotes": 0
                },
                {
                    "Content": "I’m not telling anyone what to do but if you want to see more beauty checkout her post history (chefs kiss)",
                    "Upvotes": -7,
                    "Downvotes": 0
                },
                {
                    "Content": "She BAD AS **** MANE!!!!",
                    "Upvotes": -8,
                    "Downvotes": 0
                },
                {
                    "Content": "Is the ice field behind the lake gone nowadays? Haven't been out there in a long time but remember it being up the gulley behind the lake.",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Lone Peak, 11,253 feet (3,430 meters) above sea level, in the Wasatch Range near Salt Lake City, Utah, USA.",
            "content": "",
            "upvotes": 2355,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "I did not like watching this.",
                    "Upvotes": 751,
                    "Downvotes": 0
                },
                {
                    "Content": "Just came back from long trip at various National Parks & couldn’t believe the number of folks on the edge of cliffs, taking selfies, etc. I just can’t do it and it hurts to watch other folks do it. Take care of yourselves! Good balance!",
                    "Upvotes": 312,
                    "Downvotes": 0
                },
                {
                    "Content": "My hiking and your hiking are very different lol",
                    "Upvotes": 238,
                    "Downvotes": 0
                },
                {
                    "Content": "Whoever found his phone at the bottom and posted this video should get a hold of Otterbox.  This will make for one hell of an ad campaign.",
                    "Upvotes": 534,
                    "Downvotes": 0
                },
                {
                    "Content": "Nah",
                    "Upvotes": 99,
                    "Downvotes": 0
                },
                {
                    "Content": "The jumping doesn’t bother me much. It’s the trust you have in those rocks for me.",
                    "Upvotes": 203,
                    "Downvotes": 0
                },
                {
                    "Content": "I soiled myself just watching this.",
                    "Upvotes": 58,
                    "Downvotes": 0
                },
                {
                    "Content": "It must be so freeing to know how you are going to die.",
                    "Upvotes": 132,
                    "Downvotes": 0
                },
                {
                    "Content": "Buddy think he playin Skyrim",
                    "Upvotes": 44,
                    "Downvotes": 0
                },
                {
                    "Content": "That made my booty hole pucker a little",
                    "Upvotes": 38,
                    "Downvotes": 0
                },
                {
                    "Content": "r/sweatypalms",
                    "Upvotes": 19,
                    "Downvotes": 0
                },
                {
                    "Content": "Whole lot of nope going on in this video.",
                    "Upvotes": 19,
                    "Downvotes": 0
                },
                {
                    "Content": "NOPE",
                    "Upvotes": 27,
                    "Downvotes": 0
                },
                {
                    "Content": "Damn my feet are tingling just watching this.",
                    "Upvotes": 18,
                    "Downvotes": 0
                },
                {
                    "Content": "I did this when I was 19. I’m 38 now, definitely don’t think I could do this anymore lol.",
                    "Upvotes": 9,
                    "Downvotes": 0
                },
                {
                    "Content": "I’ve hiked this peak, and your video was scarier than the actual summit.",
                    "Upvotes": 8,
                    "Downvotes": 0
                },
                {
                    "Content": "This guy should be roped and have some sort of protection. That’s a hell of lot of exposure.",
                    "Upvotes": 46,
                    "Downvotes": 0
                },
                {
                    "Content": "Nope: The Movie - r/hiking Edition",
                    "Upvotes": 8,
                    "Downvotes": 0
                },
                {
                    "Content": "Lone is probably my favorite summit in the Wasatch.",
                    "Upvotes": 8,
                    "Downvotes": 0
                },
                {
                    "Content": "All those rocks at the bottom came from somewhere, right?",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": "You know I have done some dangerous things in my life that probably pushed the boundaries of what I could handle safely. I'm starting to get old enough where I don't instantly jump to doing something dumb to impress the hotties.\n\nI feel like a lot of these videos come from people who shouldn't be doing this shit.",
                    "Upvotes": 12,
                    "Downvotes": 0
                },
                {
                    "Content": "[Man Who Said 'Yes' To Life Found With Mountain Bike At Bottom Of Gorge](https://www.theonion.com/man-who-said-yes-to-life-found-with-mountain-bike-at-bo-1819573183)\n\n\"MOAB, UT—\n\nAuthorities announced Tuesday that the body of 27-year-old screen printer Tom Finnery, a person friends confirmed always said yes to life and no to the idea of limits, had been found lying 20 feet from his mountain bike at the bottom of a gorge, his spinal column completely shattered and his broken femurs pinned behind his own back. \n\nAccording to police reports, Finnery, who always seized the day and drank deeply from the cup of life, was discovered with both kneecaps completely detached and nearly all his teeth smashed out of his fractured jawbone. \n\nPolice said the man who lived life with no regrets failed to take his cell phone with him, a fact that Finnery—who reportedly always lived life in the present—had at least nine hours to reflect upon after his fall, following which he succumbed to hypothermia and was partially eaten by coyotes.\"",
                    "Upvotes": 28,
                    "Downvotes": 0
                },
                {
                    "Content": "This gives me anxiety.😬",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": "Oh fuck that man",
                    "Upvotes": 4,
                    "Downvotes": 0
                },
                {
                    "Content": "Soooo much trust in those rocks",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "I just peed my pants",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Makes me scared just watching",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Nope",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Sir you are about to die",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Just got Elvis legs... I haven't been this exposed in a long time.",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Id just sit up there forever and watch the world",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Pretty sure my anus touched my esophagus in one of those casual steps\n\nNope",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "This is amazing! I still have yet to scramble up this bad boy. What time of year did you do this?",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "The lens effect makes it look pretty scary, which it probably actually is, but I'd bet in real life it's not as bad as this looks.",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": "Post this to r/sweatypalms",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "My stomach drops just watching that. In an airplane, just fine. See someone, or myself, standing next to a cliff, and my stomach just fills with dread lol",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "No thanks I’m good",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Nope",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Fuck that noise.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Been right where you are a couple times great view huh .",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Some r/sweatypalms stuff right there",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "this gave me the agita severely",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "My intrusive thoughts would win.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "No. Nope. No, thank you.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Is this the regular trail to the summit? Or did ya go somewhere most folks who summit don’t normally go?\n\nI’ve done the summit before, and just trying to understand if I should be reading some of the comments you’re getting as if they were aimed at me too, or not.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Thanks for taking a video of this so I can see it, because I personally would never do that.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "That view is gorgeous. Wow",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Damn! Are you my bro? 😂I can totally see him doing this.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "This jumping from rocks to rocks on such an altitude is what Shiey would do. Crazy af.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I just had a panic attack, thanks.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "There are many things I regret in life.  Watching this video is one of them.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "r/sweatypalms",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Gonna try an summit this one next year! Been on my list for a couple years now. Feel pretty confident and comfortable now in my abilities.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "This belongs on r/sweatypalms",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "See all those rocks at the bottom? Those were all up top once.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Nope",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Jesus H.  That little jump at 0:20 is making the hair on my arms stand up!  I predict he'll be a Darwin award winner at some point.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I feel nauseous.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "fuck. no.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Nope nope nope",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "This seems a bit Darwinian.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "r/nope",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I love Lone Peak, I’ve hiked to the top five times. It’s pretty extreme and exposed, but this video makes it look worse than it really is. It’s still pretty exhilarating though! Cool video, it brings back memories!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "That's not hiking, that's free climbing haha",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I want to know what that plant growing in the rocks up there is!!!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Bro what the hell if this is hiking I’m fucking out",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Nope.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Great hike! Rocks are very sturdy and this is nothing compared to Angels Lansing at Zion, 4 hours south.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "BeaUTAHFul !!! ( and terrifying )",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Thank you all for your input.\n\nYes this is quite dangerous and I would not recommend this to an inexperienced hiker, or really anyone. Safety gear is strongly recommended when hiking mountains with increased exposure.\n\nI was confident in my ability to safely hike this mountain at that time, otherwise I would not have done it. I was careful with every step I took, and every gust of wind I felt.\n\nAlso, I was using a GoPro with wide view enabled (or super wide, can't remember), so it looks more exposed in this video than it does to the naked eye.\n\nI encourage everyone to get out and enjoy the outdoors because it is a beautiful, wild, and wonderful place. But, I do not encourage going for a hike or climb that will put your life in serious danger, unless you have some safety equipment that you know how to use.  Thank you all again and stay safe!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "It’s a no for me. Thanks for sharing.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "r/sweatypalms",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "You are crazy!! I looove it!!!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Guy is nucking futs...",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Fell asleep on the summit of this mountain once. Got very sunburned",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Yessssssssssssss this looks so fun🤩🤩🤩. What's the class rating?",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Wow, apparently no one here climbs, scrambles, canyoneers, etc... \n\nOP looks very experienced, sure footed and is on good quality granite. Those \"rocks\" immense granite slabs that are still very much a part of the cliff face he is scrambling along and aren't just going to fall out from bodybweight.\n\nHe is at far greater risk walking down a sidewalk with traffic going past than scrambling on top of this mountain.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I'd suggest posting this kind of stuff in r/scrambling",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "The first think that came to mind when viewing the video was \"splat.\"  I've done a lot of long distance hiking, but I would never ever do that.  Balance issues.  Hats off to the guy who did it.  He is far better than I.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "i would 100% do exactly what this guy did in this video but DAMN it looks sketchy on video lmao",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "After the first 5 miles the landscapes starts to feel like lord of the rings, super cool views 10/10 MIGHT hike again.. lol super long day",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I am from Herriman and never have hiked this. This gave me the heebeegeebee’s.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Here's one of those idiots that cause annoying rules....",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "One of the next hikes on my list. I’m pumped",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I’m in Layton for Thanksgiving and this is one of the most beautiful places I’ve ever been.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I'm not trying to tell you not to go thrill seeking but please consider what the rescuers will have to go through to locate you if you fall. It's not that hard to use a rope for backup in case you slip bud. Don't make volunteers trek for hours in the night to find you.",
                    "Upvotes": 6,
                    "Downvotes": 0
                },
                {
                    "Content": "No.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "The Wasatch mountains are so sweet. I miss them. Not enough to scurry out on a ledge like that though. That's gutsy!",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "A few years ago I had a goal to hike all 7 peaks of the wasatch front. I accomplished the goal and gotta say Lone Peak was the scariest of all of them. Some definite pucker factor climbing up that bad boy! Thanks for the video",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "That is fucking nuts… I guess your giant balls of steel protect you against any sudden wind gusts.",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "This just makes me jealous lol.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I got slight vertigo watching this video. Nice!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Do a flip!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Thank You OP, you just invented a Laxative.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Love it",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Awesome!",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "That looks fun!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "The most discomforting thing about the video is the fact that the guy climbing down did not look very athletic or like he knew what he was doing. Doing it for the likes. This is 100% how people die.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "This is a pretty dumb thing to do. I get personal risk assessment and that it’s your life and all that and I’m not shaming you for thrill seeking. Most things worth doing carry risk. \n\nBut you have to think about other people affected and how they’re put at risk if you get hurt or killed and they have to go get you. Especially if nobody knew where you were to begin with so they start organizing search parties instead of already identifying that you were somewhere on “x” trail headed to a specific place.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "This is a great way of putting your life at risk.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Are you insane?",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "So tired of seeing these wide-angle videos that distort the hell out of the actual view. It's not nearly as bad as it looks.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "This is how people accidentally die.  It’s actually incredibly selfish to do this.",
                    "Upvotes": 0,
                    "Downvotes": 0
                },
                {
                    "Content": "If you keep doing stuff like that it’s not going to end well. Absolute stupidity.",
                    "Upvotes": -1,
                    "Downvotes": 0
                },
                {
                    "Content": "if you're so bored you'd like to jump off rocks til you die, you can take my job and I'll do whatever is boring you so much",
                    "Upvotes": 0,
                    "Downvotes": 0
                },
                {
                    "Content": "Dumbass",
                    "Upvotes": -1,
                    "Downvotes": 0
                },
                {
                    "Content": "What a stupid person",
                    "Upvotes": -1,
                    "Downvotes": 0
                },
                {
                    "Content": "But your wearing sandals with socks!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "What kinda shoes are those",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Nah",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "why are people like this :(((",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I hate this",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Damn, now I've got the itch again, but my masters program isn't going to let me escape michigan anytime soon. Looks amazing though, super jealous",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Holy shut, you can see the curvature of the earth!  This is metal af.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "No.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "It’s like a scene from Half Life.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Stop!!! Why!!! I won't be able to poop for two days after watching that!!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Imagine one of those rocks collapses, nope.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I was leaning back watching this.  Yeah no.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Abso-fucking-lutely not",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Not for me! Yikes!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Looks as good as any other place to just end it.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "No no I choose life...",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I day hiked it a few months ago and it was icy and snowy on top the entire time. I was mad at myself for buying my spikes off of Amazon hahahaha. All of my other gear is really professional, but I just wasn’t sure about my spikes and it was literally the thing that was saving my life.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "All I could think was, please stop moving, not another step!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Camera distortion makes this seem worse, but I bet a non-distorted video of this would still give me anxiety.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Nope. Go post this on sweatypalms",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I want to do this one so bad, but every time I see a video and think of just how miserable the approach is I change my mind.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "At what point does it become climbing instead of hiking?",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "r/sweatypalms",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "r/nope",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Hey man, fuck that.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "One of my favorite hikes ever, good job getting up there!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Hells no. Nope. Nope. Nope. Great for thee but for me.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I’m going to be sick.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Is this a commercial for Merrill hiking shoes?",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Oh hell no",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Sick views! Looks like a mountain goat POV up in here!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "That weather was gorgeous today, wasn't it?!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Wasatch you say?",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Wow this video had me doing a balancing act while sitting on the toilet (flailing my arms like whoaahdhfjd!).",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "My dad’s ashes are right where this is filmed. Nice to see where he ended up.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Nope",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I'm curious what shoes you have.  You have a lot of trust in them.\n\nI get the appeal of the edge.  My wife and kids get really mad at me though.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Christ.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I would slip and fall on the shit running down my leg to the bottom of my boot",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Why'd you stop?",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "No",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I need to get life insurance after watching this",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I want to live in SLC Utah",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Not worth the risk",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Made me want to throw up",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Peak Wildflowers near Alta, UT (Cecret Lake Trail)",
            "content": "",
            "upvotes": 2286,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "Makes you forget how fucked up the world is.",
                    "Upvotes": 23,
                    "Downvotes": 0
                },
                {
                    "Content": "I know what I’m hiking tonight!",
                    "Upvotes": 10,
                    "Downvotes": 0
                },
                {
                    "Content": "How crowded was the trail? I have been wanting to do this Home but I keep hearing that it’s always packed",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Beautiful!",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Wow! This is absolutely beautiful.",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Stunning!",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": "Sucks they got rid of the weekend shuttle buses from the resort parking. I wondered about how the drought would affect the flowers. This is definitely early.",
                    "Upvotes": 4,
                    "Downvotes": 0
                },
                {
                    "Content": "Take me here and we’re getting married!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Such vibrant colors!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "It is heaven on earth, what a beautiful nature with its trees, valleys, flowers and the smell of herbs.\r  \nEnjoy happiness in the arms of nature.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "r/RateThisMeadow",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Beautiful",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Wow, that's gorgeous!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Ricola!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Did you see the salamanders in the lake?  I thought they were so cool!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Worked at Alta for seven ski seasons... still haven’t had a chance to see it in bloom though",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you include the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 0,
                    "Downvotes": 0
                },
                {
                    "Content": "[deleted]",
                    "Upvotes": -3,
                    "Downvotes": 0
                },
                {
                    "Content": "It’s so beautiful… when did U get this pic? I mean when is the best time to hike this trail?",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Suddenly everything is okay.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I would forget all the shitty things that going on my life, if were here",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "BeaUtahful!!!!!",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Blanca Lake, Washington State",
            "content": "",
            "upvotes": 983,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "Cascades?",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": "Amazing!",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "This is stunning, going!!! \nThanks for the post.  ",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "How was access to the trailhead? I thought the road was closed off due to a slide or something?",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Ive always wanted to go here!",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Add that place to my bucket list please. So beautiful",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Oh man this is my most memorably good and worst hike at same time. I was so out of shape when I did it. Once you reach the top you realize there is another 0.5 miles down to the lake. The thought of walking another 0.5 miles down and UP had me shaken. I remember eating a soggy subway sandwich while my hands were freezing. The only thing that helped me through was wildberries every few steps on the way. \n\nI did it about 10 years ago but there are bullet holes in signs when you pull in to the trail head. ",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Stunning. ",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "That water is super blue!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "This is a beautiful pic! Do you mind providing me the name of the trail? Is it dog friendly as well? Im visiting my sister in Seattle ans we're planning a day trip to North Cascades NP. ",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I love how many photos of Washington I’m seeing across multiple subs.  It’s why I settled here for beauty such as this!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "What is the easiest ways to get here from Seattle? I would really appreciate. Can i take the link so far? Or bus before having to take an uber?",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        }
    ],
    "Borden Peak": [],
    "Bowen Lookout & Yew Lake": [
        {
            "title": "Paget Lookout and Sherbrook Lake, Yoho, Canada",
            "content": "",
            "upvotes": 301,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "Beautiful",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "What is the animal in the second picture?",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "That first picture…. Magnificent",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "So wonderful",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Summer Sunrise Inversion at Hidden Lake Lookout, North Cascades, Washington, USA",
            "content": "",
            "upvotes": 226,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "Wow, amazing shot",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Looks amazing",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "So pretty wow",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "In all my years up there caring for the lookout, I never saw quite this shot!  It's exquisite :D.",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you include the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Wow! Amazing!",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Johnson Lake & Stoney Lookout Trails, Banff, Alberta, Canada",
            "content": "Spent a morning hiking these two trails on a recent day trip to Banff. First time visiting, loved it and would love to spend more time there in the future.",
            "upvotes": 78,
            "downvotes": 0,
            "comments": []
        },
        {
            "title": "Hidden Lake Lookout (WA)",
            "content": " \n\nHey All, \n\nLooking to do Hidden Lake Lookout this weekend in the North Cascades. Recent trail reports look good, but I'm unsure about the infamous tree down on the access road. As far as I can tell it's still there, but unsure if my stock 4runner will fit \\*under\\* it?? and we were planning on sleeping in the car at the trailhead lot (with the appropriate backcountry pass), is that doable or would we have better luck in Marblemount? have heard some break in stories from that town..\n\nThanks for any and all advice!",
            "upvotes": 3,
            "downvotes": 0,
            "comments": []
        },
        {
            "title": "Overnighter at Hidden Lake Fire Lookout, North Cascades, Washington, USA",
            "content": "",
            "upvotes": 3,
            "downvotes": 0,
            "comments": []
        }
    ],
    "Brandywine Falls": [
        {
            "title": "Brandywine Falls, Whistler B.C. November 2019.",
            "content": "",
            "upvotes": 1591,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "I’ve been there in red dead redemption 2",
                    "Upvotes": 22,
                    "Downvotes": 0
                },
                {
                    "Content": "Currently reading LOTR and I’m happy to see Brandywine is a real place lol",
                    "Upvotes": 16,
                    "Downvotes": 0
                },
                {
                    "Content": "There is also a Brandywine Falls in Cuyahoga Valley National Park in Ohio",
                    "Upvotes": 7,
                    "Downvotes": 0
                },
                {
                    "Content": "#ViewsForDays",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Beautiful, thanks for sharing.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Great picture! I went there last February, it looked different...",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Great view! If you're up for it there is a trail that leads directly down to the waterfall and you can get a closer look at it and even feel the mist.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Once I was there in September and it was beautiful, but turning around and looking into the forest was much more interesting as it was full of mushrooms, including large numbers of weird ones I'd never seen before, like the kind that look like they are bleeding. It was mind boggling how many mushrooms there were.\n\nA day later we were in Pemberton where the local paper had a giant headline saying BEST MUSHROOM SEASON IN YEARS!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "[deleted]",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I wish there was a waterfall in game that is completely wooded on both sides. This place looks awesome though!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Where is this in the world?",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": -1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Brandywine Falls (Off-trail), B.C., Canada",
            "content": "",
            "upvotes": 999,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "You probably don't want to advertise that you ignored the posted signage and went down to the creek...",
                    "Upvotes": 27,
                    "Downvotes": 0
                },
                {
                    "Content": "Cross post to red dead sub",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": "Brandywine - is it named after the Brandywine river that flows through the Shire (from LOTR)?",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Knowing this place, this vantage point seems REALLY dangerous",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": "Stay on the trail jackass",
                    "Upvotes": 4,
                    "Downvotes": 0
                },
                {
                    "Content": "I feel like I can hear this photo",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "How far is the bridge?",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I came expecting hobbits running from wraiths... not really that disappointing I guess",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Perfect!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Beautiful, my wife and I were there a couple of days ago!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I’ve been here! So pretty!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": -1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Brandywine Falls, Cuyahoga Valley National Park, Ohio",
            "content": "",
            "upvotes": 615,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "I think that's Blue Hen Falls.",
                    "Upvotes": 49,
                    "Downvotes": 0
                },
                {
                    "Content": "Great pic, but this is Blue Hen Falls not Brandywine.",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": "Love this place",
                    "Upvotes": 4,
                    "Downvotes": 0
                },
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you include the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Very beautiful small falls.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "So Far East in the Shire and almost to Buckland. Very adventurous.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I live so close to brandywine",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Great to see all the north ohio residents here",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Brandywine Falls. Whistler, BC",
            "content": "",
            "upvotes": 546,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "My wife, the native Canadian: “I’ve been in that closer pond on a dare.”\n\nYou’d be shocked at how many stories she has that start like that.",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Nice pic!!!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "[removed]",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Rdr2?",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you include the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 0,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "NYE morning hike to Brandywine Falls, Cuyahoga Valley NP, Ohio, US",
            "content": "",
            "upvotes": 31,
            "downvotes": 0,
            "comments": []
        }
    ],
    "Brandywine Meadows": [
        {
            "title": "Brandywine meadows, whistler BC. A real life Bob Ross painting",
            "content": "",
            "upvotes": 30,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "[deleted]",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "I stumbled across a tiny excavator Building a trail. Brandywine Meadows, Near Whistler BC.",
            "content": "",
            "upvotes": 28,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "Did you just go recently? Was planning to go sometime soon but I have finals and exams coming up, and I was also afraid of the weather getting too bad.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "i wonder if he stops every ten minutes just to look?",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "We started the hike with no snow and by the top it was knee-deep! Taken in October at Brandywine Meadows in BC, Canada",
            "content": "",
            "upvotes": 18,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Late afternoon in Brandywine Meadows, BC, Canada",
            "content": "",
            "upvotes": 11,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "July 5, 2020. Brandywine meadows, Squamish, British Columbia, Canada.",
            "content": "",
            "upvotes": 7,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        }
    ],
    "Brandywine Mountain": [
        {
            "title": "Brandywine Peak, Whistler, BC!",
            "content": "",
            "upvotes": 34,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "Summer hiking with my cousin, his dog Chimo and my sister.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Thats a great hike I did it a in 2012. Have you done others in the area?",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Beautiful!",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "BRANDYWINE MOUNTAIN -Whistler, BC Canada - 4K - [OC]",
            "content": "",
            "upvotes": 11,
            "downvotes": 0,
            "comments": []
        },
        {
            "title": "Stunning Hiking at Brandywine Mountain, BC - July 26th 2019",
            "content": "",
            "upvotes": 3,
            "downvotes": 0,
            "comments": []
        }
    ],
    "Brothers Creek": [
        {
            "title": "Well, the Grand Canyon R2R went horribly - follow-up to earlier post.",
            "content": "A follow-up to https://reddit.com/r/hiking/s/z5ZZGP2gbc\n\nThe day started great. At 5:30 we started down the Bright Angel and by 9:15 were at Phantom. \n\nStarted up the North Kaibab and everything was fine ... Until it wasn't. Despite 9L of water with electrolytes and plenty of calories, about 1 mile short of cottonwood I couldn't get my temp or heart rate under control. \n\nIt went down hill fast. I laid in creeks, I sat every half mile to get my HR back to 120 (from 180s) but it didn't help. \n\nI ended up with heat stroke.  There is about 2 miles of hiking I don't remember at all before my brother made me stop, used my InReach to call for help, and I was given a free helicopter tour of the canyon courtesy of the Park EMTs. \n\nAfter some excellent care by really fantastic people, I'm back at the El Tovar having dinner and getting ready to stretch and get some rest. \n\nMy pride is hurt more than my body. I'll get it next time.",
            "upvotes": 853,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "I used to live and work at the Canyon. They have the best rescue service in the park system because so many people get heat stroke/injured/dehydrated. \n\nA R2R hike...it doesn't even need to be that...even for experienced canyon hikers can quickly become a disaster.  \n\nPeople think it's a playground, but I think there are more deaths at the canyon than any other nation park in the U.S. It is a brutal place if you're not careful. And even if you are expereinced it can get you.",
                    "Upvotes": 384,
                    "Downvotes": 0
                },
                {
                    "Content": "TBH, half the people here are stating OP didn't have enough prep, which may be true, but if you look at their previous post asking for advice, responses from this very sub were unilaterally positive and supportive with \"you can do it\".\n\nMaybe we need to be a bit more realistic and harsh on people, despite how bad we may feel. There wasn't a single response to that thread that was like \"Hey OP this may not be the best idea\".",
                    "Upvotes": 160,
                    "Downvotes": 0
                },
                {
                    "Content": "Glad you got the help you needed and lived to hike another day!",
                    "Upvotes": 274,
                    "Downvotes": 0
                },
                {
                    "Content": "Damn, even with all that prep! I was rooting for you but I understand it's a brutal trip. I'm proud of you for what you accomplished and even more proud that you and your group new when to get help.",
                    "Upvotes": 120,
                    "Downvotes": 0
                },
                {
                    "Content": "Glad you made it out. I've lived in Phoenix for a while. I carry a liter of water per mile I plan to hike when it's hot. You may not need as much up north, but more than 9 liters for a 23 mile hike. I loose more sweating than I can replace. At the end of my hikes, as my shirt dries, the salt rings make my shirt look like a contour map.",
                    "Upvotes": 22,
                    "Downvotes": 0
                },
                {
                    "Content": "Glad you are okay and pushed the button vs “roughing it out”.  Someone I know died last summer and didn’t have an inReach or similar.  \n\nLast year I also had a separate friend who had just hiked glacier NP so in decent shape get into trouble on a easy Phoenix hike w me and a group and temps were 78-88F.  They got into severe dehydration from: having just flown in (plane’s dehydrate), some but not excessive wine the night before, coffee before the hike (both diuretics) and the big kicker they were used to humid environment and didn’t drink enough. Ended the hike w a full extra water bottle but went from talking to uncontrolled cramps, no sight, couldn’t talk within 10 mins.  Lucky we were at the ER in 15. 2 liters of IV and on their feet. \n\nThe following might have gotten you as you were drinking:  one month after the above I did south rim to river to south rim in May (note I have done a dozen R2R or S2River2S) but started at 4:30am to stay below 90F at the bottom.  Having experienced the two life/hike changing incidents above I was sure to have enough water and drink it.  What happened to me was I pushed beyond my current fitness level to get past the devils corkscrew before it got to hot.  While I was drinking a lot my stomach shut down and at 3 mile house all that water I was “drinking” came back up.  So it wasn’t getting into my system. Luckily I had the shade of the shelter and spent an hour sipping water and then took it real slow.  So even drinking enough your gut can shut down on you.  \n\nMaybe you and I can go on a redemption trip!",
                    "Upvotes": 21,
                    "Downvotes": 0
                },
                {
                    "Content": "Wow, I’m surprised things went sideways on you give your extensive prep.  Have you had time to think through what specifically went wrong?  I recall that you were concerned about being a little heavier than you would have liked, but it seems like other factors must have been involved.",
                    "Upvotes": 56,
                    "Downvotes": 0
                },
                {
                    "Content": "FWIW, I’ve had heat stroke before, and the hike it happened on was one that was well below my max ability. I’m glad you were able to get out safely, and hope this doesn’t discourage you from future hikes or make you feel it had to do with your fitness and ability. From the sound of it you did everything right - including being prepared for an emergency!",
                    "Upvotes": 20,
                    "Downvotes": 0
                },
                {
                    "Content": "You did the right thing getting help! I'm so glad you took an InReach. That could happen to anyone in any shape with any amount of prep. Mother Nature just does. not. care. And sometimes our bodies just refuse to do the thing. I hope you get the chance to try again!",
                    "Upvotes": 71,
                    "Downvotes": 0
                },
                {
                    "Content": "Next time try your hardest to get a camping permit, slow down and enjoy the ride and it'll be much easier.",
                    "Upvotes": 13,
                    "Downvotes": 0
                },
                {
                    "Content": "Hey man pride aside you attempted something most people won’t. You were prepared to call for help and that gave you another opportunity to take in what happened and grow from it. What would you have done differently if you don’t mind me asking? What were the temps like?",
                    "Upvotes": 52,
                    "Downvotes": 0
                },
                {
                    "Content": "Are you sure that helicopter ride was free? I've heard of people being charged thousands of dollars after the fact.",
                    "Upvotes": 9,
                    "Downvotes": 0
                },
                {
                    "Content": "Hydration doesn’t begin at the hike. It begins before. Also nutrition the day before too. You can do everything right day of but if you’re not already at a good level, you’re going to pay. Speaking from person experience on my first 14’er.",
                    "Upvotes": 9,
                    "Downvotes": 0
                },
                {
                    "Content": "I’ve hiked the Kaibab, both ways, during a weekend trip during October. We camped at Cremation Wash (aptly named). On the way back, my wife and I hiked from shady spot to shady spot, rested, drank water and started again.  We were in shape and acclimatized, in the Army stationed at Ft Huachuca,AZ. We ran out of water about 1/2 mile from the trailhead. It was hot in the mid 90s. We finally made it to our car. We went to showers that cost $1.50 for three minutes (in 1989) and had dinner at the Tovar Hotel. We then drove back to Sierra Vista. That was a hard day. We both lost 7 pounds and could not get enough water to drink for the next two days. The Kaibab is the mule trail down to Phantom Ranch. It is for experienced hikers only. It is steep. You can die on it, if unprepared.",
                    "Upvotes": 8,
                    "Downvotes": 0
                },
                {
                    "Content": "Did you carry 9L or just drink 9L? That’s a lot of extra weight when there’s water sources.",
                    "Upvotes": 15,
                    "Downvotes": 0
                },
                {
                    "Content": "I would argue that your brothers have some responsibility in this, as well. Sure, you should have maybe done more to prepare, but they’ve done this trail before and both thought you would still be fine in 95F weather. That’s insane, honestly.",
                    "Upvotes": 26,
                    "Downvotes": 0
                },
                {
                    "Content": "Hey glad you didn’t die",
                    "Upvotes": 6,
                    "Downvotes": 0
                },
                {
                    "Content": "Glad you were okay! Were y’all trying to knock it all out in 1 day? My buddies and I did R2R in August a few years ago. We took it slow, only hiked in the early AM and evening and did it in 4 days and I think it was probably a great call if you have the time. We were pretty vigilant with each other the whole time with constant check-ins of, “hey, you drinking water?” None of us have ever lived remotely close to a desert environment so we were all hyper aware of the horror stories of that unfamiliar kind of heat.",
                    "Upvotes": 6,
                    "Downvotes": 0
                },
                {
                    "Content": "Good that you got through and kudos to SAR teams which had to rescue you.\n\nChecked previous post and honestly, you highly overstimated what only 6 weeks of training can really to for quite overweight person. At some point before that one of your brothers should put it: \"sorry  fearedfurnacefighter , but you are to heavy and not prepared\" .\n\nSingle day hike for 38km  in lenght and about 2000m for climb in summer heat  is not what you should do. \n\n\nAnd before you do it \"next time\" , consider this. Get weight down to 90kg and train on at least hikes that are 40-50% . And when you do this R2R, do it in spring or in autumn. For R2R you have to be fit. \n\n\nThis will probably be downvoted , but man, you got extremely lucky for bad decision you made.\n\n\nSincerely, old greybeard trekker.",
                    "Upvotes": 28,
                    "Downvotes": 0
                },
                {
                    "Content": "dude you are 260 lbs, trained for 6 weeks and tried to do the RTR hike in 80 degree heat. 9 liters of water should have been your clue you need to turn around or set up your tarp and just stop moving\n\nthis right here is why agencies are trying to charge for SAR.",
                    "Upvotes": 18,
                    "Downvotes": 0
                },
                {
                    "Content": "Glad you are here and alive to tell the tale! Frankly that sounds like very dangerous heat…. I personally don’t like to hike when it’s above 80 because I tend to get heat stroke very easily. \n\nIf you haven’t already, it’s worth doing some research into heat stroke. Once you get it, you are prone to it for the rest of your life, and no one really knows why. I got a bad, hospitalized-level case of heat stroke in middle school one time, and I’ve always been more susceptible to it compared to my peers and relatives. It is a pain :( \n\nBut personally I have found winter hiking to be really rewarding and not sure why more people don’t do it! No ticks - trails are less crowded - beautiful snowscapes - A+++!",
                    "Upvotes": 8,
                    "Downvotes": 0
                },
                {
                    "Content": "What was it like? I’ve been dehydrated before to the point of debilitating headaches and vomiting, horrible horrible feeling. You went well beyond that it seems. Could you describe it?",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": "With all due respect, most people, to properly train for a marathon, take at least 16 weeks, and that just you and your body with no heavy gear running on a road. You did just a fraction of that training for something arguable much harder and wonder why it didn’t go well? I hope you learned and you spend more than a month and a half preparing the next time you do this.",
                    "Upvotes": 9,
                    "Downvotes": 0
                },
                {
                    "Content": "Sorry that happened, glad you made it out ok! I backpacked in and stayed at the Phantom Ranch campground in the winter and the weather was quite pleasant, once I made it through the two feet of fresh snow on the rim!",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Be careful you are now more susceptible to heat strokes in the future.",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Sorry, friend. Hope you don't feel too bad. Like you said, you'll get it next time. Not worth dying over.",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": "I’m glad you’re okay, but this was really not enough preparation and training for this serious of a hike. I have been on three canyon trips. While they were multi-day trips with heavy packs, they also were far less mileage and definitely less elevation change per day. I am 5lbs overweight and while not sedentary, most of my exercise is flat walking and bike commuting. When I have a canyon trip, I train intensively for at least three months, with at least five training hikes. \n\nAnd I go in March/April, when the hottest I’ve gotten is 85. \n\nI hope that this was a good wake up call about the seriousness of the canyon.",
                    "Upvotes": 4,
                    "Downvotes": 0
                },
                {
                    "Content": "Hard to overcome BMI 37",
                    "Upvotes": 14,
                    "Downvotes": 0
                },
                {
                    "Content": "That is scary, I am glad you made it out alive. How hot was it? I've been close to heat stroke before, dizzy, super tired, I really thought it would be a good idea to lay down in the bushes next to the trail for a nap. Luckily some part of me knew that I was in serious trouble and after a lot of water and a long rest I slowly made my way back to the car.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I was going to do this with my sons a few years ago - with three nights in the canyon.  It was 100 at the south rim.  We went about 3 miles down and noped out of it.  We decided the chances of one of us getting heat stroke was too high. So we turned around and hiked around the rim for a few days.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I ran R2R2R in early November a few years ago and it was freezing on the rims! Unexpected several inches of snow on North Rim.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "YES YOU WILL GET IT NEXT TIME!!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I did this hike in September of 2021 and we started at 4:00 in the morning to get through the hot part of the canyon ahead of the sun hitting overhead. We constantly were filling up our packs with water. Having read the prep I would have said you were ready, but being ready is really personal in how well you handle the heat how fast you go and what the weather/heat is the day you hike.  We did meet a number of hikers that were doing a R2R2R which we thought was crazy. We did have to help a couple of hikers at the end of our hike to make it back out of the canyon. I am sure you can do this based on your determination in your prep but you have to be honest with yourself on how you feel this hike was probably the hardest one I have ever done.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Your pride might be hurt, but on the other hand you should be proud that you did the smart thing instead of toughing it out and dying.\n\nAny tips related to what you did/didn't do to stay cool? Did you underestimate conditions, or you were well prepared and it wasn't enough?",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "So proud of you for recognizing the danger and calling for help!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "My wife got heat stroke around that exact same spot. It’s rough. I actually tried to talk her out of it before we went, because I was worried she didn’t handle heat well. She’d done a lot of hiking in the sierras and was overconfident. \n\nFortunately, there’re a lot of helpful volunteers out there. The humbling did her some good TBH.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Just had this happen, last week, on Cactus to Clouds (Mt San Jacinto, 400 ft to 10,800). Cramping in left leg started about 6 miles in. Knew it was dehydration, spent a few mins sucking down as much water/electrolytes as I could. Went away after 10-15 mins.  About an hour later, cramp in right leg. Knew that was a bad sign. About 6000 ft, first signs of altitude sickness, too. Stopped, hydrated, it went away. Then, both legs at same time. At which point, too far to go back down, can only keep going up.\n\nFirst 7 miles took 6 hours. The next 2.4 miles took almost 5 hours. Severe altitude sickness. The trail had been completely wiped out by shock pack rockslides. All that was left, was a near straight scramble up fallen rock, for 1500-200o vertical feet. Except, I could only do 100 ft at time, before nausea and dizziness became too much. I'd have to sit, for two to five minutes, until my head cleared. Then, scramble another 100 feet, and sit.   \n\n\nNever made the summit. All three of us decided to quit at 8400 ft, at the Tram station. Glad we did. A poor soul died a little farther up, towards the summit, that day. His body was covered by a thin blanket and some rocks. If I had seen that, in the depths of my worst altitude sickness, I might have panicked. \n\nI remember thinking \"Arrogant fuck, you(myself) forgot that Mother Nature wants to kill you, at any time\"",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Sounds like you did all the right things and are fantastically fit. Even for the fittest this is difficult. Be PROUD of yourself for going as far as you did. That impressive on its own. Just get back on the horse and knock that trail out in cooler temps :).",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Free? No. Someone paid for your hubris.",
                    "Upvotes": 4,
                    "Downvotes": 0
                },
                {
                    "Content": "So sad. Taxpayers pay for so many rescues for people who overestimate their abilities.",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Glad you got help, maybe go in for a work up? If you’re normally in good condition, and in this case you did everything right, I would consider underlying causes",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "OP, pride can be redeemed but health can’t. Good to hear that you’re in good health again thanks to everyone around you.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Good for you. I remember reading your previous post and thought you were preparing as well as you could. Curious question - what kind of care or treatment did you receive after pickup to help you?",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "The group I hike with recommends the bright angel trail for first timers. It's flatter, has shade, and lots of water points. \n\nI'd recommend trying havasupai gardens in a day trip to dip your toes in next time.\n\nEdit realized you did south to North. I would try North to South starting at the North kaibab next time. It's 1000ft less coming back out the other side",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Hey there, based on your prep and the work you put into it it seems you're fit enough for the hike. But, by chance do you live in the desert? The body needs time to acclimatize to the heat, even the most fit and experienced people can get heat stroke if they don't give their body time. It's probably difficult, and finding time is always hard but if you can get to a desert city like a week or two before your hike and get a few workouts in there before you rim to rim it'll really help",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Do you have some medical condition, or? Sounds like some kind of adrenal or diabetic crisis or something. Are you metabolically fit?",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "(Hugs)\n\nI remembered your first post.\n\nYou tried. You prepped. You didn't show up with flip flops and 8 oz of water.\n\nIt just sucks. You're my hero for even trying.\n\nYou got this next year 🫶",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Glad you made it out",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Guessing it won't be free",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "OP, what was your pace?  How long did it take you to hit various milestones?\n\nI'm wondering if you were too aggressive in your pace trying to keep up with your brothers.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "So you have heart issue before?",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "There is a good book by Michael Ghiglieri called “Death in the Grand Canyon”.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Crazy trail, I did that with my mom back in 96ish i was younger then IDk if i could do it now.. Goodluck",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Just read the original post. Ah, yes. I'm 5'10\" and used to be 210lbs and when I was down to 175lbs I thought I was an unstoppable force of nature on my hikes. Luckily I never had an experience like yours.. but now that I'm sitting at 140lbs I realize how much I still was not in shape for some of the serious climbs I had planned. Carrying additional weight, even if it is your own body weight, takes a lot more work that it seems.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Haha “free.” That bill is otw, friend.",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Mt Whitney Day Hike",
            "content": "On July 13th I found that there were 2 Mt Whitney Trail day permits remaining for July 26th - in the middle of my two weeks of vacation, none the less. What are the chances? Unfortunately, it was less than two weeks away, and I hadn't exactly been training for that kind of hike. I'd been planning on doing the Cactus to Clouds hike up San Jacinto from Palm Springs this fall, so I thought Mt Whitney would be a good training hike. (Only half joking.) Even if I didn't summit, the altitude would be great experience for the top of San Jacinto - which was originally one of my biggest concerns. \n\nI've done a bunch of day hikes around San Diego, but none higher than 6,000 ft, and none longer than 12 miles, so I knew there was a really good chance I wouldn't get to the top of Whitney. My brother is planning on doing the cactus to clouds hike with me this fall, so I managed to convince him to try Whitney with me, too. Unfortunately, with our schedules right before the 26th, neither of us got in any good last-minute training, and basically drove up to Lone Pine completely unprepared. \n\nOn Monday we managed to get a great camp site for three nights right by the creek in Whitney Portal - perfect. After setting up and getting lunch, we decided to try a short hike up to Lone Pine Lake - as high as you can go on the trail without a permit. Starting from our site at about 8,000ft, we were immediately sucking wind from the altitude change. (We both live effectively at sea level.) But after finding a good pace we managed to get to the lake without too much difficulty. And I have to say, the place is gorgeous. I hadn't been up to the Sierras before, and I'm certainly going to make a point to get back as much as I can now. \n\nTuesday was a decided rest day, so we drove south to Horseshoe meadows (at 10,000 ft.) to have lunch and lay around, but got bored and ended up walking through the ridiculously awesome meadows up there for a few hours. We had dinner in Lone Pine before going back up to Whitney Portal. And usually the white noise of the creek would have been enough to ensure a good night's sleep, but anticipation and other day-hikers leaving incredibly early meant we basically got no sleep that night.\n\nGetting up at 2:45 Wednesday morning to start at the trailhead at 3:15 seemed a good idea - early enough to give us a cushion if weather started to close in that afternoon. Hiking in the dark with a headlamp was something I hadn't done before, and it was pretty great. I'm glad we'd done the first few miles up to Lone Pine Lake on Monday, though. The new territory past the lake was still in complete dark when we got to it, however, and I could barely make out the looming rock faces or even Mirror Lake when we basically walked right by. \n\nWe felt pretty good when we stopped to rest past Bighorn Park for the first time around 6. A Clif bar and 15 minutes later and we carried on up to Trailside meadow and then trail camp. This last stretch before trail camp was starting to get really tough. With the sun fully up we could finally see the great views from above the tree line, which was one of the few positive points to counter our tired legs. \n\nAfter another fifteen minute break at trail camp to filter water and chew on some shot blocks, we started up the 97 switchbacks. At trail camp I couldn't tell where the trail went, but eventually picked out some really tiny hikers about halfway up to trail crest. I wanted to cry. I was tired, but not enough to warrant turning around at this point. It was only around 8, so we had plenty of time. The switchbacks were hellish to a point that I didn't think they would end. For the first time I started thinking that I physically might not be able to make it to Trail Crest - always my secret minimum allowable goal. Even with the knowledge that we really weren't physically prepared, the thought was sobering. Still, we managed to push on with more and more frequent breaks to reach trail crest around 9:30. For the first time you could see to the West, and into Sequoia national park. Breathtaking, to say the least, at 13,600ft. \n\nWe decided to push on, with the summit only about 2.5 miles away. How hard could it be? There were less than 1,000 vertical feet left (if you don't count the few hundred feet you have to descent from trail crest) and it would be easy, right? Holy crap wrong. At around 14,000ft and after nine or ten miles uphill, every rock over a foot tall was a challenge. From the crest to the John Muir trail and around the windows was arguably the coolest part of the hike if you like alpine views and awesomeness, but from the windows up was almost torture. You can see the top, but we were getting there so slowly!\n\nAfter winding around the back side you feel like you're basically there, but the last half to quarter mile was maybe even tougher, if only because we wanted to be there so badly but kept slowing down. Once the summit shack came into view, though, we knew we'd done it, rejoiced, and laid down to take a nap. I honestly could have slept for the entire hour we were up there, if it weren't for the excited chatter from all the other peppy, seemingly energetic hikers up there with us. I tried choking down another cliff bar, but just couldn't even smell it without feeling a bit ill. Surprisingly, I didn't feel any other ill effects from the altitude aside from fatigue, but that was probably partly due to a lack of sleep, and consuming only about four hundred calories in the previous 8.5 hours. (Endomondo estimated - probably badly - that it was a nearly 8,000 calorie hike, and it only counted 18 of the 22 total miles.)\n\nWe made it up in 8.5 hours, and down in 5.5. Not screwing around coming down. We wanted to be done. The slight up hill to trail crest from the John Muir trail wasn't as bad as I'd expected, but the unending 97 switchbacks were worse. With the rest of the descent on autopilot under a grin and bear it mentality, we nursed chafed butt-cheeks and exhausted leg muscles back to camp. The last two miles down from Lone Pine Lake to Whitney Portal was brutal. It felt familiar since we'd been over that part of trail three times prior, but was again so tantalizingly close to our goal that it seemed never ending. But when we finally reached our car and got back to the camp site, relief nearly overcame the pain. The thought of camping another night wasn't so enticing, so we packed up and drove into Lone Pine to get a hotel for the night. We probably could have saved some money if we'd planned it that way from the beginning, but the hot shower and soft bed were well worth it.\n\nThe next day, we drove through death valley to Badwater on our way to Vegas to celebrate, going from the highest peak in the lower 48 states to the lowest point in the western hemisphere in less than 24 hours. All in all, it was a pretty epic trip, especially considering we'd planned it in about a week. \n\nBelow's a link to a few pics from the trip. I wish I'd taken more.\n[http://imgur.com/a/MQ16p](http://imgur.com/a/MQ16p)\nMy apologies for any reddiquite or formatting errors - it's my first post.",
            "upvotes": 7,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "Crazy! I hiked up Whitney from Guitar Lake on the 19th. We thought all of the 1 day hikers were nuts (though admittedly we'd just hiked across the Sierra's the 4 days prior, so that was kind of nuts too).\n\nCongrats on the successful climb though! We totally had the same mentality coming down, just get the hell off the mountain. Having never been on the Whitney Portal side of things before, the last little bit where you can see the road/store... but hike endlessly past it and then finally back down via switchbacks was brutal, we were 75 miles into the trip and just wanted a burger and a beer (not to mention a shower).",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I've done the exact same thing, right down to the badly planned (we decided just to kamikaze it after two failed starts at multi-day hikes), barely summiting and ending utterly spent. Wouldn't trade it for the world!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I did Whitney in April, or most of it until my trail runners began slipping halfway up the chute.  Switchbacks were completely iced in.  Not a bad dayhike.  I'm doing Jacinto's C2C2C trail on the 11th if you've 'warmed up' on Whitney :)",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "First timer",
            "content": "So I'm planning a trip with my fiancee's family to go on a hiking trip around december or January, her mom and brothers are super active, they actively participate in marathons. Me and my fiancee arent so much. I was planning to go to Barton Creek and the Twin Falls hiking trail because it was listed as an easy hike.\nAny tips or pointers you'd be willing to give?",
            "upvotes": 1,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "Where are these trails? That might help us.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Going on some smaller hikes beforehand is a good way to get a feel for it. Start walking everyday to ease your legs into it. Bring some energy on the hikes and not just trail mix. I typically bring a candy bar. Drink a lot of water. \n\nHonestly you should be good to go on an easy hike, just don’t let yourself get discouraged if you’re tired and out of breath and they’re still running around.",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        }
    ],
    "Brunswick Mountain": [
        {
            "title": "Top of the world. Brunswick mountain, Lions Bay, BC, Canada",
            "content": "",
            "upvotes": 63,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "Awesome",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "How was the hike up? Hoping I'll be able to do it this summer!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Wow amazing views. Amazing photo!",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Looking up at Brunswick Mountain (5856 ft / 1785 m), British Columbia, Canada",
            "content": "",
            "upvotes": 35,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you include the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I reached 4790ft (1460m) and turned back here due to the snow.",
                    "Upvotes": 2,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Sugarloaf Mountain, New Brunswick, Canada.",
            "content": "",
            "upvotes": 12,
            "downvotes": 0,
            "comments": []
        },
        {
            "title": "Brunswick Mountain Highest point in the Lower Mainland",
            "content": "",
            "upvotes": 10,
            "downvotes": 0,
            "comments": []
        },
        {
            "title": "new brunswick mountain | 2022 road trip part 7 (New-Brunswick, Canada)",
            "content": "",
            "upvotes": 0,
            "downvotes": 0,
            "comments": []
        }
    ],
    "Buntzen Lake": [
        {
            "title": "[OC] Buntzen Lake, British Columbia, Canada",
            "content": "",
            "upvotes": 19,
            "downvotes": 0,
            "comments": []
        },
        {
            "title": "Diez Vistas, Buntzen Lake, Anmore, BC, Canada",
            "content": "",
            "upvotes": 14,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Buntzen lake trail, BC, Canada",
            "content": "",
            "upvotes": 7,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "A short hike in beautiful Buntzen Lake, BC, Canada",
            "content": "",
            "upvotes": 4,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "Would love to explore this area some day",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Buntzen lake look out. BC",
            "content": "",
            "upvotes": 4,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        }
    ],
    "Capilano Canyon": [
        {
            "title": "[capilano suspension bridge ] this place ins [Vancouver Canada ] is so lovely 😍",
            "content": "",
            "upvotes": 510,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "The dude is taking a big eyeful. =\\",
                    "Upvotes": 52,
                    "Downvotes": 0
                },
                {
                    "Content": "Thank you for posting. Think I’ll check your post history for similar content.\n🙂",
                    "Upvotes": 36,
                    "Downvotes": 0
                },
                {
                    "Content": "It’s really cool visiting during the holidays. They have Christmas lights up on the trails and in the trees.",
                    "Upvotes": 4,
                    "Downvotes": 0
                },
                {
                    "Content": "[deleted]",
                    "Upvotes": 6,
                    "Downvotes": 0
                },
                {
                    "Content": "Worth trying the one at lynn canyon as well. Free, great views, and typically way less people.",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Is this an old picture, or are people that close together maskless?",
                    "Upvotes": 13,
                    "Downvotes": 0
                },
                {
                    "Content": "How high up is that?",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "If you ever get the chance go back during Christmas. The lights are a lot of fun. Tallest living Christmas tree in north america if I recall.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Lynn Canyon? There’s also a fun natural water slide you can go down right by the bridge.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "My 3 year old decided to have a meltdown right in the middle with lots of people around.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Old lad enjoys the wiews too.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I was not prepared for how much that bridge moved when walking on it. For future visitors, stay closer to the middle for the least amount of vertical shift (physics). The canopy walk was also fun.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "[deleted]",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "great view",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "....and not a mask in sight. 😩",
                    "Upvotes": 0,
                    "Downvotes": 0
                },
                {
                    "Content": "More like that face is so lovely.",
                    "Upvotes": -7,
                    "Downvotes": 0
                },
                {
                    "Content": "That guy behind you is definitely looking at yo ass although I bet it probably pretty nice ;)",
                    "Upvotes": -15,
                    "Downvotes": 0
                },
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Careful when you go after the pandemic. It can be packed with people all taking their own selfies. They post monitors on each end letting the same number on that get off.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Did they use this in an episode of Altered Carbon?",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Does it still cost a lot to go on?",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I Love Love swinging bridges \n;)",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "This is as much hiking as fart is shit.",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        }
    ],
    "Cartmell Peak": [],
    "Cayoosh Mountain": [],
    "Chadsey Lake": [],
    "Church Mountain": [
        {
            "title": "Found this church built into a mountain wall while on a hike in Croatia!",
            "content": "",
            "upvotes": 108,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "Incredible! Was it open?",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Park suma marjan! Beautiful place the veiw from the cliff above is stunning!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": -1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Hiking in the mountains of Georgia (Caucasus / Gergeti Trinity Church)",
            "content": "",
            "upvotes": 88,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Church Mountain near Mount Baker, WA. A misty day without the usual vistas but it made it a little magical and surreal.",
            "content": "",
            "upvotes": 87,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "I think that cute ass dog makes it magical and surreal, but that's just me. (Jk this is an absolutely beautiful photo, and now I want to go to Washington)",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "r/foggypics  \nr/paths",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Did you make it to the top? The view from Church is pretty great.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Good dog",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Church Mountain by Mount Baker, Washington State. First time I’ve hiked this on a clear day in years.",
            "content": "",
            "upvotes": 67,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you include the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Top of church mountain, Deming WA, USA",
            "content": "",
            "upvotes": 11,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Gave me another hike to try. How's the snow now?",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        }
    ],
    "Cloudburst Mountain": [],
    "Coliseum Mountain": [
        {
            "title": "Peak of Coliseum Mountain, BC! 11 hours and 35°C for this private pool with a mountaintop view",
            "content": "",
            "upvotes": 142,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "35 degrees C in BC? Sounds like florida! Beautiful shot!\n",
                    "Upvotes": 4,
                    "Downvotes": 0
                },
                {
                    "Content": "Looks so chill there! Love the mountaintop view. ",
                    "Upvotes": 2,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Coliseum Mountain - Challenging ~25km day hike near Vancouver, BC",
            "content": "",
            "upvotes": 1,
            "downvotes": 0,
            "comments": []
        }
    ],
    "Coquihalla Mountain": [
        {
            "title": "Alpine splendour near Coquihalla Mountain",
            "content": "",
            "upvotes": 57,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "We hiked that last summer when the blueberry fields were in. It was great. I love the cascades.",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "All alone in the coquihalla mountain range last night (BC) w/ my little yellow tent",
            "content": "",
            "upvotes": 22,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you include the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "What's all the red?",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Looking at Jim Elly Peak & Coquihalla Mountain, Summit of Illal Peak, Illal Meadows, Coquihalla, British Columbia, Canada",
            "content": "",
            "upvotes": 15,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        }
    ],
    "Coquitlam Lake Viewpoint": [
        {
            "title": "Rockbound Lake Viewpoint, Banff National Park.",
            "content": "",
            "upvotes": 36,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Cypress Lake, at the top of Cypress Lake Trail in Coquitlam, British Columbia, Canada.",
            "content": "",
            "upvotes": 26,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you include the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Hiking Towards Viewpoint to watch the Sey Phoksundo Lake, Nepal",
            "content": "",
            "upvotes": 13,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Garibaldi Lake and Panorama Ridge from the Black Tusk viewpoint (2000m elevation) - Garibaldi Provincial Park, BC, Canada",
            "content": "",
            "upvotes": 12,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "I did both last Sunday, when were you up there? The lake is huge compared to the Last time I did it. The flooding made it a much better sight.\n\nDid you summit after this or stay below?",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you include the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Viewpoint at cascade falls in South Lake Tahoe. You are able to see Lake Tahoe, Cascade lake, and cascade falls. Lake Tahoe, California, USA",
            "content": "",
            "upvotes": 12,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        }
    ],
    "Cougar Mountain": [
        {
            "title": "PSA: Listen to your gut, turn around if you're running out of daylight.",
            "content": "This is a self post but I wanted to share my experience.\n\nLeft later than I should've for a 32km hike yesterday. Got turned around a few times on the trail and realize that by the time I got to the peak of a 1700m mountain it would be 5:30pm. I really wanted to finish the hike so I pushed through, got to the peak, then immediately took my descent (didn't even enjoy the view, complete waste of time.)\n\nNeedless to say messed up my wayfinding on the way down twice and was well past 32km of walking with the end still being 8km out, walking on to 40km at that point, and it was 10pm and I was still in the woods by myself with over an hour to go. Thankfully had all-trails downloaded for the map but my gps signal was weak so it was hard to find my way back to a trail.\n\nThankfully I had a headlamp but the whole time I kept saying \"why didn't I turn around earlier!?\" Kept tripping on roots on the ground and could barely see where trails forked.\n\nMy ego got the best of me but thankfully I made it to the parking lot at about 11:30pm. Never been so happy to see a vehicle.\n\nPSA: Listen to your gut! If it's time to turn around, turn around.\n\nI'm not sure if I'm being a baby and maybe this whole subreddit loves hiking in the dark, but for me it was a terrifying experience to be alone in the woods at night hearing rustling in the brushes knowing there are cougars and bears rife in that area.",
            "upvotes": 835,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "As a former SAR volunteer, I’ve seen this to many times. We call it “summit fever”. \nAlways have a plan, that includes a turnaround time no later then. Remember the [Ten Essentials](https://www.rei.com/learn/expert-advice/ten-essentials.html).",
                    "Upvotes": 354,
                    "Downvotes": 0
                },
                {
                    "Content": "[deleted]",
                    "Upvotes": 135,
                    "Downvotes": 0
                },
                {
                    "Content": "Yup, I've been there. I night hike a lot, so have experience. But it's always a planned thing.\n\nThis past winter was hiking the Adirondacks and it was just soooo slow going. Around 230/3pm it became obvious that if we pressed on to our destination, we'd be hiking back in the dark. The trail wasn't super well marked, and there were a crazy number of water crossings, many hidden by snow or very thin ice, and our water lines were starting to freeze. Noped right the heck outta there. As badly as I wanted to get to the waterfall at the end, it wasn't worth a possible lost in the woods in freezing temps scenario.",
                    "Upvotes": 48,
                    "Downvotes": 0
                },
                {
                    "Content": "Hiking in the dark by choice is awesome.  Hiking in the dark by circumstance is not.\n\nGlad you are okay!",
                    "Upvotes": 37,
                    "Downvotes": 0
                },
                {
                    "Content": "I have a predetermined 'turn around time.'  No matter where am at in the hike, I start heading home at the prescribed time.  \n\nGlad everything turned out okay.   We all make mistakes, and most of the time, they won't kill us, but sometimes they do.  \n\nMy last big mistake was preparing an all day hike for me and a two buddy's.  I knew what I needed to complete the hike, but wasn't prepared for someone to slow the group down because of a twisted ankle.  To add insult to injury the other two didn't bring extra food and water.  I had an extra food and water, and  I started to feel a bit smug when I realized that  I was going to have to  share my water and food with the other two.  Needless to say, we ran out.    Lesson learned:  Prepare for a hike for the slowest/least prepared person in the group.  Now in group hikes, I do an 'inventory' check with each person (including myself) to make sure everyone is  adequately prepared for an emergency.  It could have gotten ugly if it was colder/and or raining.  Lucky for us, it was just a mild innocence.",
                    "Upvotes": 32,
                    "Downvotes": 0
                },
                {
                    "Content": "I'm going to add this to always know when sunset is wherever you're hiking and how long you've been hiking, it will take you the same amount of time if not a little longer to go back.",
                    "Upvotes": 64,
                    "Downvotes": 0
                },
                {
                    "Content": "Did this once too. Wrenched my knee badly somewhere on the descent (turned out to be an ACL sprain) then ran out of water. I’m not sure what happened with the water there. I’ve done longer hikes without drinking everything in the same size camelbak. Despite having a headlamp, water filtration, and plenty of food… I straight up panicked and called the emergency. They put me through to SAR. Guy calmed me down. Was supposed to call me back, but I guess couldn’t get through. I taped up the knee with medical tape (what happened to the ace bandage I usually keep in my pack? Who knows…) and made my way down. Got back super late. They’d sent some people out to meet me because I couldn’t get in touch to tell them I was fine. I don’t really think the ranger believed me about my knee when he interviewed me, but I was so pumped full of adrenaline from just making it back safely I probably couldn’t done flips no matter the condition of my knee. The next few days were… not fun.\n\nMost embarrassing thing I’ve ever done, honestly.",
                    "Upvotes": 18,
                    "Downvotes": 0
                },
                {
                    "Content": "Husband and I decided to do part of Devils Backbone in the Catskills for a sunset hike. We'd never been to the Catskills and had already done a hike that day. The trail was 2.3mi total, so we figured we'd be fine. Nope. 2.3mi total... out and back... and 1,600ft up. We ended up basically sliding down in the dark by phone flashlight. Was it worth the view? Absolutely. Would I do it again? Not a chance. Be safe.",
                    "Upvotes": 14,
                    "Downvotes": 0
                },
                {
                    "Content": "I think big mountain (Everest, K2, etc.) climber Ed Viestures said it best:\n\n\"Getting to the top is optional. Getting down is mandatory. The summit is just a halfway point. The mountain decides whether you climb or not.\"",
                    "Upvotes": 14,
                    "Downvotes": 0
                },
                {
                    "Content": "Good job recognizing the mistake. That could have gone bad for you.\n\nAnyone that is adventurous has made mistakes, and more than one. It’s more important we learn from them.",
                    "Upvotes": 12,
                    "Downvotes": 0
                },
                {
                    "Content": "I did a couple of solo hikes down in the dark after late summits, but I always consider how hard the hike down would be in the dark, what kind of animals are around, and it's always on trails where I have already hiked down in the daylight previously. Any other descent in the dark would be an unintended accident. Of course if for whatever reason I'm just not feeling it, turning around and getting ice cream at the nearest store.\n\nI wouldn't say it's always not fun. There are stars and sometimes city lights going on below, but I am extra vigilant and usually do not sit down for a break in the dark.",
                    "Upvotes": 10,
                    "Downvotes": 0
                },
                {
                    "Content": "[deleted]",
                    "Upvotes": 15,
                    "Downvotes": 0
                },
                {
                    "Content": "I once went on a hike in an unfamiliar area associated with a spa I was staying at. They gave us a horrible trail map and really bad verbal directions. I didn't take it that seriously because I thought it was just a little stroll on the grounds of the spa. But it was a gnarly hike with steep slippery drop-offs and when it started to get dark my idiot friend didn't care and wanted to keep going. I had to turn around without her and yelled that I'd tell her hubby and kid that it was her own fault if she didn't make it back. She kept going for a few minutes then gave in and turned around. This is the same friend who had to stay overnight with no supplies in a random shack she found on a mountain because she didn't turn around when she should have.",
                    "Upvotes": 8,
                    "Downvotes": 0
                },
                {
                    "Content": "Good reminder. I’d be more concerned about weather at the summit as opposed to hiking in the dark, but your point stands.",
                    "Upvotes": 7,
                    "Downvotes": 0
                },
                {
                    "Content": "Sort of different but in the same vane, if your hiking/walking in coastal areas be aware of tides! I frequent the bay of fundy area since i have family that lives there and the number of news articles of people getting standed or worse when they didnt realize the tide was coming in, or just how far/fast it moves is a sad eye opener. Know the tide charts ahead of time, theyre easy to google.",
                    "Upvotes": 6,
                    "Downvotes": 0
                },
                {
                    "Content": "You also need to know when to turn around when hiking in exteme heat.  I am an experienced hiker and used to the heat, but more than once, I've gotten a mile or two from the trail head starting out and decided that I have nothing to prove and it would not be wise to keep going.\n\nWhen hiking in extreme heat, I plan my route to known water sources and turn around if my water is half empty.  I also carry a backup 20oz bottle that I don't count when assessing the half-empty Camlebak.",
                    "Upvotes": 6,
                    "Downvotes": 0
                },
                {
                    "Content": "I mean being in the dark on a trail is probably not fun. Does your headlamp have a red light lens? That would have helped easy my nerves a bit because its going to allow you to keep your night vision. \n\nYour fear is justified, you were alone in the mountains at night, thats worth some fear. But planning for it, whether thats turning around, having better flashlights, better navigation, etc is worth thinking and planning for next time.",
                    "Upvotes": 15,
                    "Downvotes": 0
                },
                {
                    "Content": "I tried to get a group to turn back on Mt. Marcy when I was on my way down too late for comfort, and they were on their way up still. I think about them a lot. Probably died. (they almost certainly didn't.)",
                    "Upvotes": 11,
                    "Downvotes": 0
                },
                {
                    "Content": "You're not a baby. Thanks for the reminder. I am primarily a early morning hiker so I'm likely not to get tired before the sun comes up, but we've just had bear sightings in my most immediate yet humble little range. Plus I've seen lots of snakes and the coyotes are getting ***way*** too brave.",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": ">turn around if you're running out of daylight\n\nTurn around if you're running out of anything critical:\n\n* Daylight\n* Water\n* Energy\n* Exposure resistance (sun/cold etc)\n* Situational awareness",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": "Try being afraid of heights and hiking an emergency resupply to the bottom of the Grand Canyon … I knew the edge was there but I couldn’t keep an “eye” on it … it was the fastest I’d ever descended. And I chanted the whole way “ don’t trip, don’t trip”\n\nEdit - spelling",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": "My self-preservation instinct has been on high since I got stuck on a giant exposed slab in pouring rain a couple years ago. \n\nLive to die another day!",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": "&#x200B;\n\nTurn-around time is the goal, in some sense.   I was bushwhacking in New Hampshire in February.   The nominal goal was a pond some distance away.   But...we got turned around, and after some time we figured out where we were, it was time to turn back.   At least we knew where we were.   \n\n&#x200B;\n\nI later found out that there was an error in the topo that caused us to get confused.   One guy in our party developed bad cramps in his thigh.  We'd been snow-shoeing with zero conditioning.   At first I thought we might have to stick it out overnight, but I had a bivvy sack and a thermos of hot water.   Eventually the cramps subsided enough that we could continue back to our car.",
                    "Upvotes": 4,
                    "Downvotes": 0
                },
                {
                    "Content": "There is a trail in the Santa Cruz mountains that at the crest has a sign. You’re about to go into a 12 hour round trip. It’s a very dark rainforest type of valley. It may still be daylight out but it will be very dark in the valley.",
                    "Upvotes": 4,
                    "Downvotes": 0
                },
                {
                    "Content": "Yeah planning on hiking in the dark and accidentally fucking up and doing it are two different things.\n\nI agree with your advice.",
                    "Upvotes": 4,
                    "Downvotes": 0
                },
                {
                    "Content": "Glad you’re ok.  I live near a popular hiking trail and every year people call for rescue because they didn’t make it back to their car before it got dark.  It’s not even a difficult trail and the temperatures are mild here.  No reason they couldn’t just sit down and wait for sunrise.  Whenever I want to push on when I should turn around,I think about how embarrassed I would be to have a firefighter walk me down off the mountain because I didn’t remember that it gets dark at night.",
                    "Upvotes": 13,
                    "Downvotes": 0
                },
                {
                    "Content": "I think it should be a rule of to bring an emergency blanket on day hikes",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "I guess I'm a baby too. No night hiking for me.",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Thanks for sharing this. I actually returned 200m before the peak because of considerations like this. It's been bugging me some time, but I retook the path this year.   \n\n\nYou can always come back to the challenge, no need to risk anything. Glad you're okay.",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Just a curiosity question: What headlamp do you use? I intentionally night hike occasionally but on good trails. I typically have no more problem catching roots than I do during daylight (I'm in the southeast, we love roots).\n\nIt may be something that it's time to replace it with one that offers more light otr wider beam. Some (many? I am not sure) offer a tight beam and a wide area setting, mine does this and I love it.",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": "With any hike I do I always have it in the back of my head how long it will take for me to get back and a set time I need to be back by (which is always a little bit earlier than I really need). So the actual decision to turn around has basically been made for me without really thinking about it.\n\nBut also I've deliberately summitted mountains at sunset and walked back in the dark and it's probably been close to the best experience of my life. Worth doing if you're confident with the track you're on.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I ended up hiking out in the dark last year when I’d gone out for a first hike after a while, on a trail I forgot was so flipping rocky that even on a good day I only am at about 80% normal speed. I don’t mind hiking in the dark but I prefer to do it when it’s intentional!\n\nOne idea that might help with avoiding stumbling over roots and things is to hold your headlamp in your hand instead of on your head. If the light is coming from a place close to where your eyes are, you’re less easily able to see the shadows (because they’re on thee opposite side of the object) so things might look flat when they’re not. If you have the light elsewhere it’s more easy to tell the dimension of things on the ground.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I was climbing Mt. Baker in Washington state for the first time. Struggled hiking in though I was in great shape. The morning of the climb, had a cough starting, as I climbed it got worse. Climbing partners gave me the choice of going on, going down or hanging out on top of the cleaver as the summited. I chose to hand out on the cleaver and give up the summit try.\n\nHard decision but I know it was the right one. Found out after I got home I was at the beginning of getting bronchitis.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Not a whimp. Hiking in any condition you aren't prepared for or didn't expect can be really scary.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Generally I only hike in the dark on trails I'm already super familiar with.\n\nOn an unfamiliar trail you can miss a lot, including the scenery.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "That happened to me before. But fortunately I was with a friend. We assumed the last trail we were doing would be a fairly quick loop like the other trails at that park. Didn't get back to the car until almost 11 pm (we started the hike around 6)",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I got benighted in prime mountain lion territory. It was an area I knew well but my puny headlamp beam was not reassuring. I kept thinking I’d have deserved it if I’d have been eaten.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I have worse thing. My gut gives me the feeling that shit is getting fun when i blow trough my plans. Originally i tried to contain it but now i just take some extra gear for the situations when my gut gives this \"exited\" feeling that something is not going as planned, so it is going to be an adventure. \n\nWhat is this extra gear? if im going for 1 day hike i plan for 2 days. If i go on a week i plan for week +2 days. So for single day hike this means i will never ever leave without medpack, tarp, space blanket and aditional 24h of food and water. This sadly means that my dayhike bag is rarely under 10kg as i blow trough 3-4L of water per day including eating. And the worst thing is that i do not dare to go to hike on sunday.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I can't abide hiking thick forest at night though I do enjoy being up in wide open mountainous areas like Mount Rainier needing headlamps - glad you're okay!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Did the same thing on a solo hike, but without a light source. Walked til it got too dark, then sat under a tree and waited for dawn. Dozed a little on and off. Warm summer night. No big deal.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Where were you that GPS signal was weak? This only happens at high latitudes, in between tall buildings, or in/near China where they have signal jammers. I always download an area of google maps and save points along the trail that are shown on AllTrails. If you put your phone on airplane mode, it won’t hunt for cell towers and just use GPS (which is very accurate for most areas).",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Good job on recognising limitations, even if it was after the fact, but great that you were prepared.\n\nI've never done that big a hike due to my weight, but In anticipation and the hikes that I do do (hehehe) I have a Garmin Fenix as a backup.  Moment I start walking I turn on the hiking function so I can follow trails and if need but use the track back features",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Not being a baby, that is serious stuff. I've been there.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Next time you'll be experienced and you won't rattle nearly as hard.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "It's easy to get too optimistic with your timings. I've done it once and ended up stuck on a high pass as the terrain was too technical for me to walk down in the dark. It all ended well but I was so scared (and felt so stupid) that since then I ALWAYS pay attention to sunset timings and haven't done it again. It will probably be the same for you!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "My gut tells me to keep going. Night time is the best time! That’s when all the wildlife comes out. I personally love post-sunset hiking as it really turns the mountains into some untamed wildness! \n\nAlso if you’re tracking your hike on Alltrails, you should’ve been able to see where you’ve been and need to go via the red trace. I routinely hike with 0 cell service and have never had a problem so long as I’m actively tracking the hike. You live and learn.  Hike your own hike and have fun but don’t give up on night hiking just yet.",
                    "Upvotes": 0,
                    "Downvotes": 0
                },
                {
                    "Content": "I like hiking and trail running at night,  so being alone in the dark isn't a scary thing for me,  it's an adventure because it's a different world...  millions of people did it for millenia before electric street lights and buildings lit up 24/7... 🤷‍♂️",
                    "Upvotes": -2,
                    "Downvotes": 0
                },
                {
                    "Content": "Always have a backup headlamp.\n\nHiking in the dark is part of hiking.",
                    "Upvotes": -1,
                    "Downvotes": 0
                },
                {
                    "Content": "I'm not a pussy, >!I'm not afraid to call it quits.!<",
                    "Upvotes": -1,
                    "Downvotes": 0
                },
                {
                    "Content": "Schwwwwaaaag advice",
                    "Upvotes": -1,
                    "Downvotes": 0
                },
                {
                    "Content": "Not me: i START hiking at 10 pm, true alpine style! \n\nin all seriousness though, this is very true. got summit fever when I was halfway up Mailbox last winter, and I ended up in a dangerous situation having to climb down the slippery rocks near the top after only reaching the summit at 8:30 PM. Wasn’t something I’d want to do unprepared again.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Also if you have any kind of medical issues don't think twice about turning back. Not being able to finish a hoke sucks, but it sucks a lot less than an emergancy airlift or worse.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Excellent advice. I’d say just listen to your gut not matter what. When I started hiking, I’m in an area where I have a lot of spots to explore and nobody to bother me. I find myself hiking, seeing a cool spot far away and spending too long there or the next one and barely have enough water when I get back. Hiking practically pulls you as far as it can.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Dude I had to walk back up a mountain to get back to my campsite.  Had gone to the car to get some fungi but forgot my headlight. At least my eyes were dilated  🥹",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Definitely something to be emotionally prepared for haha",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I know people who night hike Black Star Canyon here in Orange County, CA on a regular basis.\n\nApparently the local urban legends about it have gone pretty viral and it's like a hugely popular thing now. \n\nI personally wouldn't do anything that stupid lol With or without the legends the area is full of coyotes, mountain lions, and maybe even bears. I honestly don't even like going there during the day, there's just something unsettling about it in general.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Got into the same situation while I was doing the TMB 2 weeks ago. Hiking in complete darkness in a wooded area was not a pleasant experience for me at all. Very stressful actually. I didn’t plan for how much darker it would be in the woods… The sun wasn’t completely set, but it was basically night time and completely dark once I got into the woods. Big lesson for me",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Wise advice.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "This and always like 2.5-3xs the water and some snack/electrolytes I think or expect I need.  Lol I always like ok 2 one liters and a 20oz bottle is great then like 7 miles in to summer heat I’m like sheez I’m going to be coming back no water on return 😬",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Only time I’ve disregarded pending dark is in big parks, so that if got too late, a few miles in most any chosen direction and you run into a house, road, gas station, etc.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Organic maps for offline gps",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Had a similar happen in Scotland. The OS map showed a trail that I could take to get back to the road. When I got to it it was fenced and barbwired. Was a dicey hike getting off trail and ended up messing up my ankle on the descent.",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Nike Horse Trail, Sky Country Trailhead, Cougar Mountain, Bellevue WA USA",
            "content": "Just a short, quick hike I took a few days ago. I love this park.",
            "upvotes": 131,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you include the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "A rainy day on Cougar Mountain, WA, USA",
            "content": "",
            "upvotes": 24,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "This, to me, is so sexy",
                    "Upvotes": 2,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Cougar Mountain, Washington.",
            "content": "",
            "upvotes": 21,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "This is 100% r/paths! The colors along the edge are amazing! ",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "can you scare off cougars or mountain cats by yelling, stomping around or acting aggressively?",
            "content": "purely out of curiosity... I'm not sure where to ask this, and as a solo hiker, the likelihood of me encountering a prowling predator is likely, though it never happened yet and I want to be ready.\n\n\nsorry for the english.",
            "upvotes": 4,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "Yes.  Here's the advice from Washington Dept of Fish and Wildlife:\n\n>Relatively few people will ever catch a glimpse of a cougar much less confront one. If you come face to face with a cougar, your actions can either help or hinder a quick retreat by the animal.  \n>  \n>Here are some things to remember:  \n>  \n>Stop, pick up small children immediately, and don’t run. Running and rapid movements may trigger an attack. Remember, at close range, a cougar’s instinct is to chase.  \n>  \n>Face the cougar. Talk to it firmly while slowly backing away. Always leave the animal an escape route.  \n>  \n>Try to appear larger than the cougar. Get above it (e.g., step up onto a rock or stump). If wearing a jacket, hold it open to further increase your apparent size. If you are in a group, stand shoulder-to-shoulder to appear intimidating.  \n>  \n>Do not take your eyes off the cougar or turn your back. Do not crouch down or try to hide.  \n>  \n>Never approach the cougar, especially if it is near a kill or with kittens, and never offer it food.  \n>  \n>If the cougar does not flee, be more assertive. If it shows signs of aggression (crouches with ears back, teeth bared, hissing, tail twitching, and hind feet pumping in preparation to jump), shout, wave your arms and throw anything you have available (water bottle, book, backpack). The idea is to convince the cougar that you are not prey, but a potential danger.  \n>  \n>If the cougar attacks, fight back. Be aggressive and try to stay on your feet. Cougars have been driven away by people who have fought back using anything within reach, including sticks, rocks, shovels, backpacks, and clothing—even bare hands. If you are aggressive enough, a cougar will flee, realizing it has made a mistake. Pepper spray in the cougar’s face is also effective in the extreme unlikelihood of a close encounter with a cougar.\n\nBut in any event, you'll be very lucky to ever see a cougar.  I've hiked thousands of miles in cougar country, and have yet to see one.",
                    "Upvotes": 6,
                    "Downvotes": 0
                },
                {
                    "Content": "Honestly, if you see a cat, it probably isn't interested.  If it were interested, you'd be hunted and wouldn't even know it",
                    "Upvotes": 8,
                    "Downvotes": 0
                },
                {
                    "Content": "For cougars I found you can scare them off by talking about marriage too soon. \n\nFor mountain cats I always keep an emergency big ball of yarn handy.",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "If, for some reason, you found yourself in a confrontation with one that could not be solved by moving away, you will want to make yourself seem like more of a threat than it wants to deal with. Make yourself big, loud, and dangerous.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Yes. Solitary ambush predators don't want a fight, they want an easy meal. So they're already unlikely to prey on humans, especially humans that are big, loud, and standing their ground. Anything that looks like a potential for injury is way less appealing since their healthcare is even worse than ours.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Not necessarily . . .\n\nhttps://wildlife.ca.gov/News/cdfw-investigates-possible-mountain-lion-attack-in-trinity-county#",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Cougars you usualy have to lie about your age or tell them you are poor. But it should work on wild animals🤣",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        }
    ],
    "Crown Mountain": [
        {
            "title": "Crown Mountain [Vancouver, BC, Canada]",
            "content": "",
            "upvotes": 1145,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "I tried to get there last year late july I think. Started at lower Seymour and went via hanes valley. Just below the crown into a 5 minute break to put on gaiters. While I was doing that I heard a deep crackling sound and turned around to look at the mountain and saw a mini avalanche. Noped outta there. Still need to get to Crown one da.",
                    "Upvotes": 7,
                    "Downvotes": 0
                },
                {
                    "Content": "Look at the cute little baby trees growing next to the trail, or road!",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Falkreath?",
                    "Upvotes": 6,
                    "Downvotes": 0
                },
                {
                    "Content": "Beautiful.  What trail is this?",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I have one word for you, WOW 😮",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "That's not human turf.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "This picture is like a sedative for me",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Wow, that view is to die for.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Great hike. Done it a couple times starting with the grouse grind, hiking around grouse mountain and essentially doing a steeper grouse grind down hill, then uphill again. Not a hike for beginners. Lots of route finding on the last portion towards the final peak. Hanes valley take you to the final saddle before you hike up. Much, much longer route.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I wonder when this beauty will burn down",
                    "Upvotes": 0,
                    "Downvotes": 0
                },
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 0,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Crown Mountain near Vancouver,BC",
            "content": "",
            "upvotes": 71,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "I'll have to check it out. Have you done Elfin Lakes or Black Tusk?",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Out of curiosity – what elevation would you say you hit snow? I'm only about 60 miles south of there.. it's been several weeks since I last headed inland/uphill, but am itching to get out and back on some mountain trails. ",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "[deleted]",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "So did you summit? or turn back before the gulley",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "What in the bear grylls is a beavertails hut?",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "i like that you can instantly tell, that you 2 are great guys. keep it up!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Haha dat guy's face while looking at the map... He's all like \"Dude, stop taking pictures and grab the damn compass!\" xD",
                    "Upvotes": 0,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Backcountry trail on the way to Crown mountain, BC, Canada",
            "content": "",
            "upvotes": 35,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you include the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Crown Valley...my nemesis.\n\nDid you take the gondola up, or do the grind?",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Stone Carving found at the top of Crown Mountain, Vancouver",
            "content": "",
            "upvotes": 15,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "As far as graffiti goes it beats an unsightly tag but I still for the life of me can’t fathom why people feel the need to deface a mountain. What possible reason do you have for leaving your name there for posterity? As if all the people after you could give a rats ass that a Campbell was there in 2001.",
                    "Upvotes": 6,
                    "Downvotes": 0
                },
                {
                    "Content": "Looks like graphiti, about 20 years old.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Cool",
                    "Upvotes": 0,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Crown from Goat Mountain, North Van, BC",
            "content": "",
            "upvotes": 10,
            "downvotes": 0,
            "comments": []
        }
    ],
    "Cypress Peak": [
        {
            "title": "Tricouni over my shoulder, from Cypress Peak 6800 ft. Whistler/Squamish area...",
            "content": "",
            "upvotes": 3,
            "downvotes": 0,
            "comments": []
        }
    ],
    "Dam Mountain & Thunderbird Ridge": [
        {
            "title": "2 years ago today we eloped on a mountain where we did our first hike, Franconia Ridge, Mount Lafayette, NH, USA",
            "content": "",
            "upvotes": 4416,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "You both look better than you did 8 years ago. Keep doing what you’re doing!",
                    "Upvotes": 125,
                    "Downvotes": 0
                },
                {
                    "Content": "So . . . did you pack in your clothes, or did you hike in a dress/tux?",
                    "Upvotes": 163,
                    "Downvotes": 0
                },
                {
                    "Content": "[removed]",
                    "Upvotes": 62,
                    "Downvotes": 0
                },
                {
                    "Content": "This is so neat! Congrats",
                    "Upvotes": 12,
                    "Downvotes": 0
                },
                {
                    "Content": "I remember you posting this back then! Great hike for a wedding.",
                    "Upvotes": 6,
                    "Downvotes": 0
                },
                {
                    "Content": "Happy anniversary! 🌹Stunning wedding dress OP!! You guys look great.",
                    "Upvotes": 6,
                    "Downvotes": 0
                },
                {
                    "Content": "You both look so happy. Congrats to you!",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Congrats! My wife and I got engaged on Little Haystack on our first time doing the Pemi Loop! Special place.",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Beautiful!",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Omg these pics and bride’s dress are gorgeous! ❤️",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "r/wmnf",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "That's so awesome! Congratulations!!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Happy Anniversary! It's mine, too! We originally wanted to elope to Zion NP, but our families wouldn't have that.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Beautiful! Congratulations.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Hey I’ve been there! Good choice!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Congrats! Beautiful place, I always loved hiking that ridge when I lived back East. 😊",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "How far of a hike was it? Beautiful pictures, I love this idea!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Nice!!  … but I want to see her shoes. 😬",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "[deleted]",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "8 yıl ne beklediniz abicim.",
                    "Upvotes": -1,
                    "Downvotes": 0
                },
                {
                    "Content": "I loved your performance in The Pianist! Bravo!",
                    "Upvotes": 0,
                    "Downvotes": 0
                },
                {
                    "Content": "Mazeltov! She's too pretty for you",
                    "Upvotes": 0,
                    "Downvotes": 0
                },
                {
                    "Content": "Awesome! Im sorry you’ve since lost you head",
                    "Upvotes": 0,
                    "Downvotes": 0
                },
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you include the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": -2,
                    "Downvotes": 0
                },
                {
                    "Content": "What happened to your head",
                    "Upvotes": -2,
                    "Downvotes": 0
                },
                {
                    "Content": "Lol I think I would've picked a more practical dress for this, even if I am just changing clothes at the top.",
                    "Upvotes": -4,
                    "Downvotes": 0
                },
                {
                    "Content": "Dope",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Lovely photos. Enjoy",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I loved this hike. It is breathtaking and beautiful!! I suppose a perfect place then for such a special day ☺️ congratulations!!!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Very cool",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Soooo cute congrats!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "That dress is absolutely stunning",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "You hung in for eight years?  Just kidding.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "You both didn’t age one bit in 8 years. I’m impressed.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I love everything about this. Best wishes to the two of you!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "BEAUTIFUL 🥰🥰♥️♥️",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Congrats for standing there so long ;)",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "You look stunning. What a wonderful idea",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "This is awesome. 👍🏻",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Congrats!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "elite hair all the way around.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I hope I see an anniversary pic added some day",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Wow you both look incredible after a hike! I just saw on the 4000 footer Facebook page that someone else did a wedding hike today, I can't find it it was on Lafayette though. They should have a patch for getting married on a mountain! Either way, very impressive to hike carrying a beautiful gown and tuxedo up a mountain along with everything else. Happy anniversary! Cheers to many more years of hiking with one another",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Congrats! I love this.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "My perfectionism kicking in but your cameraman only had to move about 10 steps to the left to get the same angle. But you guys look better than you did 8 years early so good on you!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I love this so much. Congrats!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "r/mademesmile",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Enjoy! Y’all look happy. Congratulations!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "That’s awesome! Lafayette is my favorite. I’m still working on getting my husband up there though.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Aw congratulations 🥳",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Okay this time I'm crying !!!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Always nice to see the White Mountains get some love, literally!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Mazel tov, congratulations, beautiful!!! And what a gorgeous bride. I hope you have many many more years of happiness and a million more hikes ahead of you. Remember that marriage is hard work. After 15 years I can tell you sometimes I want to kill my husband. But as long as we keep working at it we succeed. And I I hope that you too succeed as well",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "One of my favorite hikes! Congratulations 🎉",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "This is awesome!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I love this mountain and these photos.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Amazing 😍",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Congratulations! You both look happy.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Your dress is amazing",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "wow this is beautiful",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "How lovely! ❤️",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I'm not crying, you're crying 😭😍",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "About 200’ from where I got engaged <3\n\nIf you haven’t been there when the snow is still on the ground, I highly recommend it, it’s amazing",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Love it!! Do you guys hike the same trail for your anniversary every year?",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Your dress is absolutely gorgeous!! And congratulations to you both!! 🎊",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Congrats 👏",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I love this :) My first real hike was a semi Pemi loop, and this ridge line section was the best part. Congrats!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Congratulations 🤗🥰 this is so cute",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "So lovely! Congrats",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Goals!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Congratulations!",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Amazing and happy anniversary!!! \n\nMy fiancé proposed on top of mount Lafayette last month, it’s a magical place. ❤️",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "That is awesome! Congratulations to both of you.",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Hiked to the Lost Valley hidden between the Three Sisters mountain ridges in Glencoe, West Highlands, Scotland.",
            "content": "",
            "upvotes": 2559,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "That's a lovely area to go hiking in.",
                    "Upvotes": 18,
                    "Downvotes": 0
                },
                {
                    "Content": "Beautiful snap, on the to do list!",
                    "Upvotes": 12,
                    "Downvotes": 0
                },
                {
                    "Content": "I camped there the other month, such a good spot. Minus the constant rain and waking up to overnight made rivers either side of my tent 😂",
                    "Upvotes": 10,
                    "Downvotes": 0
                },
                {
                    "Content": "Phenomenal shots are so cool. It's officially on my bucket list!",
                    "Upvotes": 7,
                    "Downvotes": 0
                },
                {
                    "Content": "Please post this on r/EarthPorn",
                    "Upvotes": 6,
                    "Downvotes": 0
                },
                {
                    "Content": "Amazing photo👍👍 Glencoe is definitely an amazing Park!!",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": "Wonderful!",
                    "Upvotes": 4,
                    "Downvotes": 0
                },
                {
                    "Content": "Beautiful",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": "Wow!!! I am literally in jfk getting ready to hike the west highland way next week! What a gorgeous hike!",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": "Such a wonderful place. It is hard to convey the scale. Those boulders in the bottom right are each the size of a house.",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "When did you hike there? Lost valley shouldn’t look like that at the moment, the trees have budded and the grass and vegetation has come up. This looks more like winter. Stunning place though.",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you include the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Stunning.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I’m loving the drama those dark clouds add to the photo. What a beautiful place.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Absolutely amazing! Colors are phenomenal and make me wish I was there!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "That looks fantastic.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Gorgeous. Wish I was there.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Beautiful!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Splendid, splendid area. And superb shot. You captured the mood perfectly!!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "fucking incredible picture. Looks like a great time!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Gorgeous Pic.  Dad and I did the West Highland Way for his 75th two summers before Covid - absolutely amazing place.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I think I have been there, beautiful spot!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Badass terrain you got there.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I've been here! And ended being inspired to write a song about. One of my most memorable trips ever!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Wow! That color scheme just looks stunning 🤩",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Bd",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Blue Ridge Mountains, Tennessee",
            "content": "",
            "upvotes": 1729,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "Damn. Those ridges are BLUE!",
                    "Upvotes": 32,
                    "Downvotes": 0
                },
                {
                    "Content": "My brother, where do you intend to go tonight? I heard that you missed your connecting flight...",
                    "Upvotes": 52,
                    "Downvotes": 0
                },
                {
                    "Content": "Shenandoah riveeer",
                    "Upvotes": 48,
                    "Downvotes": 0
                },
                {
                    "Content": "COUNTRY ROADS",
                    "Upvotes": 11,
                    "Downvotes": 0
                },
                {
                    "Content": "Beauty Spot, Erwin TN",
                    "Upvotes": 18,
                    "Downvotes": 0
                },
                {
                    "Content": "I can see why it's called the Blue Ridge. I've always wonder why they call it blue, I thought it was because the rivers in it",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": "I hear Fleet Foxes…❤️",
                    "Upvotes": 6,
                    "Downvotes": 0
                },
                {
                    "Content": "Damn this makes me nostalgic. Beautiful mountains",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": "Did the whole blue ridge Parkway last summer, quite a beautiful and fun drive if you have the time!",
                    "Upvotes": 5,
                    "Downvotes": 0
                },
                {
                    "Content": "Don't look up in the trees",
                    "Upvotes": 4,
                    "Downvotes": 0
                },
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you include the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Beautiful. But still not Andalsnes  😊",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Trail name?",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "This is a great picture!",
                    "Upvotes": 4,
                    "Downvotes": 0
                },
                {
                    "Content": "Lovely",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Home",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Ten Eyes See",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Thought I would have made it down there by now, being I really need to give one Highway Patrol a major Happy Hour for saving me from heading straight into tornado already on the ground had I headed down the mountain in pouring rain on cruiser that night. \n\nGeared up after 2 hr break from riding all night from Tampa, headed back to Mpls when he slams on the brakes coming at me, saying,, your not going anywhere,, \nand shows me a concrete stairway to get scoot under it, and hotel room above it. Then it hits, that was a bit too close a call. \n\nOne of these days,, really need to do This tour again. This was in Western portion of Tennessee. \nCheers",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Blue Ridge Mountains, North Carolina, USA.",
            "content": "",
            "upvotes": 1307,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "Well now I have that song stuck in my head. So thanks. ",
                    "Upvotes": 63,
                    "Downvotes": 0
                },
                {
                    "Content": "So where’s Shenandoah river?",
                    "Upvotes": 16,
                    "Downvotes": 0
                },
                {
                    "Content": "[deleted]",
                    "Upvotes": 13,
                    "Downvotes": 0
                },
                {
                    "Content": "Where is this specifically? ",
                    "Upvotes": 13,
                    "Downvotes": 0
                },
                {
                    "Content": "'In my mind I'm gone to Carolina.'\n\nBeautiful picture! I can't wait to get back down to Boone/Blowing Rock after seeing this.",
                    "Upvotes": 13,
                    "Downvotes": 0
                },
                {
                    "Content": "Just got back from a two week trip west of Asheville near Bryson City. First time visiting the area after having hiked through parts of AK, UT, NV, and CO. It really blew my mind how beautiful the entire area was. I saw the elevation charts and didn’t really think I was going to see much of anything except some rolling hills but the mountains of NC are breathtaking and filled with great trails",
                    "Upvotes": 6,
                    "Downvotes": 0
                },
                {
                    "Content": "I was in Shenandoah last year and this beauty just seems to stretch on forever. We scattered my Nana’s ashes there because she said it was the most beautiful place she’d ever been. ",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Born and raised(and still live here) in the BRM(Brevard).  Took it for granted as a kid/teenager, but as an adult, being able to live here and hit the trails  multiple times a week is something I put a high value on.  Nice pic!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I’ve lived in Asheville my entire life and I honestly never get tired of the views! It’s gorgeous!!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I’m pretty sure I’ve been to this exact spot! ",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Nice Place",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Such a magical place 🤩",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Is this looking down from Pisgah? They all look so similar. It almost looks like that's Pink Beds at the bottom.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I’d love to go...! ",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Looks like the view from Craggy Gardens parking area.",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I’m going to Asheville next week for a little road trip. I cannot wait. ",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Sasquatch ",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "My favorite spot. Loved growing up in the NC foothills and hiking around there on the weekends. ",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "My homeland ",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I love living here! I’m never leaving. ",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Life looks old there ",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Beautiful ",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "I hate being bi-polar it’s awesome ",
                    "Upvotes": -1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Looking forward to the rhododendron bloom this spring in the North Carolina Blue Ridge Mountains. Rough Ridge overlook of the Blue Ridge Parkway in the Southeastern United States.",
            "content": "",
            "upvotes": 1260,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "That's a terrific photo. <3",
                    "Upvotes": 15,
                    "Downvotes": 0
                },
                {
                    "Content": "Beautiful view",
                    "Upvotes": 10,
                    "Downvotes": 0
                },
                {
                    "Content": "Is that the Linn Cove Viaduct in the distance? \n\nMy GF and I are going to NC at the end of the month and we’re looking for good hikes. I’ve cycled that area a ton over the past decade. Pretty much everything within a 50 mile diameter of Boone in all directions including summiting Mt Mitchell a bunch of times. But I’ve never hiked the area. I know we’re going to do Grandfather Mtn but not sure where else to go.",
                    "Upvotes": 6,
                    "Downvotes": 0
                },
                {
                    "Content": "Craggy Pinnacle?",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "What are some of the best hikes y'all would recommend during this bloom? I've been doing weekly hikes and I'd love to do a magical hike during this time.",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Check out Roan mountain. Largest natural rhododendron garden in the world.",
                    "Upvotes": 3,
                    "Downvotes": 0
                },
                {
                    "Content": "Amazing view!",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "One of my favorite spots in the whole world",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "I’m always blown away by the sheer amount of rhododendrons growing under the trees in the Blue Ridge Mountains. It’s beautiful there.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "[deleted]",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": " NC has my heart for sure! The blue ridge is special place",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "Lovely photo , the hike most of felt rewarding",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you include the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "How far is this from Grandfather or Boone? I travel through there a few times a year and would love to stop for a hike",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "When did you take this? Is it already that green there?",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "When do the flowers end up blooming?",
                    "Upvotes": 1,
                    "Downvotes": 0
                },
                {
                    "Content": "Maybe one of the most crowded places to hike in NC, especially on a fall day!",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        }
    ],
    "De Pencier Bluffs": [],
    "DeBeck’s Hill": [],
    "Decker Mountain": [],
    "Deeks Lake": [
        {
            "title": "4 more months until I take on the Glorious Howe Sound Crest Trail [Deeks Lake, BC, Canada]",
            "content": "",
            "upvotes": 193,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "Adding this to my hikes to be completed list.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "The hike to the lake is about 6km from the Porteau Cove parking lot on the Sea-to-Sky Highway.  I highly recommend bringing a tent and staying overnight in the summer.  The moon was so bright that it lit up the entire lake!  \n\n[Here](https://vancouverhiatus.com/hiking/deeks-peak.html) is more information about this hike.  \n\nFor those interested,  here is [another shot](https://www.instagram.com/p/BvKctvhgQsx/?utm_source=ig_web_copy_link) of the lake that I took.",
                    "Upvotes": 2,
                    "Downvotes": 0
                },
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "First hike of the season. Deeks Lake, British Columbia.",
            "content": "",
            "upvotes": 87,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "I'm happy you posted this - I was looking at it as an option for this Thursday and all the comments are saying it sucks go pick a better one but it looks awesome!",
                    "Upvotes": 4,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Deeks, Hanover and Brunswick Lake in Lions Bay, BC, Canada",
            "content": "",
            "upvotes": 59,
            "downvotes": 0,
            "comments": []
        },
        {
            "title": "Wish I'd brought the tripod. Deeks Lake trail, BC.",
            "content": "",
            "upvotes": 28,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you included the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        }
    ],
    "Del Campo Peak": [
        {
            "title": "Hiking the \"Gallerie del Monte Paterno\" (Paterno Gallery), Tre Cime di Lavaredo (Three Peaks of Lavaredo), Dolomiti di Sesto ( Sexten Dolomites), Italy",
            "content": "",
            "upvotes": 323,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "For real. The views in Italian Dolomites are something else.",
                    "Upvotes": 7,
                    "Downvotes": 0
                },
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you include the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 0,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Remembering a special june delight (Campo Pericoli and Pizzo Cefalone peak, Gran Sasso e Monti della Laga National Park, Abruzzo, Italy). My perfect peaceful place.",
            "content": "",
            "upvotes": 30,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you include the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Pico del Teide (3718), highest peak ever done for me. Route from Pico Viejo, it is 1500m ascent/descent. Route is displayed as dots, but there were not traverses or any dangerous places. Only shock was, over 3200m headache and breath like a dog.",
            "content": "",
            "upvotes": 30,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "Well done! Looks like a great peak! Had to look up where it is, but super cool mountain.",
                    "Upvotes": 2,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Cerro Torre and Fitz Roy, two famous peaks in Los Glaciares National Park seen from Loma del Pliegue Tumbdado mountain, Patagonia, Argentina",
            "content": "",
            "upvotes": 30,
            "downvotes": 0,
            "comments": [
                {
                    "Content": "This is the view from the Loma del Pliegue Tumbdado, which is a one day hike from El Chalten, the centre for a visit in this area. It's 1100m (3600ft) ascent and descent back on the same path, or the start (end) of a multi day hike in the backcountry of the Los Glaciares National Park.\n\nYou can find more of my photos @ https://www.instagram.com/christoph.zeug/",
                    "Upvotes": 1,
                    "Downvotes": 0
                }
            ]
        },
        {
            "title": "Del Campo Peak & Foggy Lake - Cascades - WA - USA",
            "content": "",
            "upvotes": 29,
            "downvotes": 0,
            "comments": []
        }
    ],
    "Dewdney Grind": []
}