[
    {
        "Title": "Yosemite Half Dome Foot Dangle, NBD",
        "Upvotes": 5474,
        "Comments": [
            {
                "Content": "Hi! This is our community moderation bot.\n\n---\n\nIf you think this post fits /r/SweatyPalms and you'd like it to stay,  **UPVOTE** this comment!\n\nIf you want to remove it, **DOWNVOTE** this comment!\n\n*Enough downvotes will remove this thread from /r/SweatyPalms.*",
                "Upvotes": 1
            },
            {
                "Content": "WHY THE FUCK IS HE THERE WITH A KID WTF",
                "Upvotes": 1009
            },
            {
                "Content": "He left two kids unattended while doing that?!",
                "Upvotes": 1010
            },
            {
                "Content": "The worst part about this video is the two kids left alone on the edge of a cliff. Unreal parenting.",
                "Upvotes": 156
            },
            {
                "Content": "Falling is one of the worst feelings imo, dont want to imagine that fall",
                "Upvotes": 78
            },
            {
                "Content": "parenting at its finest!! \n\nthen you see kids doing stupid dangerous stunts, falling to their dead.. then parents crying and saying that they dont know where they learn such behavior blah blah..",
                "Upvotes": 235
            },
            {
                "Content": "Where does he think all those rocks at the bottom of the valley came from?",
                "Upvotes": 90
            },
            {
                "Content": "Dude gets his life and that of his kids in danger for some stupid clout. Like grow the fuck up you 40+. You still need attention ?",
                "Upvotes": 140
            },
            {
                "Content": "Who knows when that rock is going to snap. What an idiot.",
                "Upvotes": 324
            },
            {
                "Content": "Sorry I don’t see this as being cool or next level shit but fucking idiotic and brainless",
                "Upvotes": 67
            },
            {
                "Content": "Idk how to explain the feeling I have. Just imagining being up their with my kids. If one of them ran out there to be with me, I know my daughter would. Or being there and they start fighting. Just a terrible sinking feeling. Inevitable. Permanent.\n\n100% entirely preventable with just a very, very small amount of common sense.",
                "Upvotes": 31
            },
            {
                "Content": "Shitty parenting",
                "Upvotes": 20
            },
            {
                "Content": "Idiots of Yosemite.",
                "Upvotes": 34
            },
            {
                "Content": "Shitty Parenting 101.",
                "Upvotes": 17
            },
            {
                "Content": "Hey you guys wanna see daddy die in a really violent and tragic way. What a fucking deuche",
                "Upvotes": 33
            },
            {
                "Content": "Nope.",
                "Upvotes": 14
            },
            {
                "Content": "Fuck that shit",
                "Upvotes": 6
            },
            {
                "Content": "That gave me anxiety",
                "Upvotes": 11
            },
            {
                "Content": "Find a new Dad kids. This one’s an idiot.",
                "Upvotes": 10
            },
            {
                "Content": "Having been there done that (though not sitting as far out and not with kids) it's not as insane as this fisheye 360 cam makes it look, but it is still the most vertigo I've ever experienced. \n\nObviously with kids and camera in tow it seems a bit irresponsible but if you take some common sense precautions (stay sitting down with both hands anchoring yourself, don't go to the absolute edge like this guy) you've got a reasonable person's probability of being just fine and walking away with a memorable experience. Just treat the situation with the obvious respect it requires.",
                "Upvotes": 4
            },
            {
                "Content": "I literally feel my testies ascend when I see things like this. Today was no exception",
                "Upvotes": 6
            },
            {
                "Content": "This clip should be enough for a judge to say this man isnt fit to be a father. Some people just shouldnt have kids.",
                "Upvotes": 4
            },
            {
                "Content": "When you hear\n\n“What if you fall off?”\n\nAnd “yeah you don’t want to fall off”\n\nYou wouldn’t think the first was from a 5 year old and the 2nd was from their father filming himself while edging closer to the cliff",
                "Upvotes": 4
            },
            {
                "Content": "Neglecting the safety of your very small children for clout? Fucking heathen.",
                "Upvotes": 3
            },
            {
                "Content": "What a piece of shit. What if his poor kids had to watch him fall and die.",
                "Upvotes": 10
            },
            {
                "Content": "\nGet fucked, I can’t even watch that shit",
                "Upvotes": 11
            },
            {
                "Content": "Everything for those likes",
                "Upvotes": 9
            },
            {
                "Content": "sweaty soles",
                "Upvotes": 6
            },
            {
                "Content": "White People are a trip. They lock their doors when driving through the hood, but will go do stuff like this literally courting death.\n\nHelp me understand, y’all. 😅",
                "Upvotes": 3
            },
            {
                "Content": "What an asshole",
                "Upvotes": 3
            },
            {
                "Content": "This makes me want to vomit 🤮",
                "Upvotes": 3
            },
            {
                "Content": "How is a video more precious than life?!",
                "Upvotes": 3
            },
            {
                "Content": "Some people are just fukin brain dead.!!",
                "Upvotes": 3
            },
            {
                "Content": "Why the fuck are people like this? That rock could break. Does that not even occur to them? And let's say that happens. Then what about the kid? He might just rush to the edge looking for dad who just fell and might go over the edge too. I mean as an 'adult' , how does this not even occur to you? Smh.",
                "Upvotes": 3
            },
            {
                "Content": "DONT DO THAT SHIT WITH YOUR KIDS? Are you stupid??",
                "Upvotes": 3
            },
            {
                "Content": "Is it fucked up i kinda am hoping the rock snaps just as he makes it out onto the ledge?",
                "Upvotes": 3
            },
            {
                "Content": "My balls feel weird when I watch this.",
                "Upvotes": 5
            },
            {
                "Content": "Real dumb",
                "Upvotes": 6
            },
            {
                "Content": "The level of selfishness and irresponsible madness of the “dad” is mind blowing",
                "Upvotes": 5
            },
            {
                "Content": "This is how you end up in “Deaths Of Yosemite”",
                "Upvotes": 5
            },
            {
                "Content": "Daddy's a moron",
                "Upvotes": 4
            },
            {
                "Content": "What irresponsible parenting.",
                "Upvotes": 3
            },
            {
                "Content": "So upsetting. How could he take his young children to the edge like that? And then leave them unattended while setting such a terrifying example? It seems really wrong and is completely successful in pushing my buttons. Thanks!",
                "Upvotes": 4
            },
            {
                "Content": "Sketchy?",
                "Upvotes": 2
            },
            {
                "Content": "Man's became Michael Jackson for a millisecond 😭🤣",
                "Upvotes": 2
            },
            {
                "Content": "NO! NO! No no no no no!",
                "Upvotes": 2
            },
            {
                "Content": "As I always say about heights, my legs trembling as soon I see a picture, not able to imagine me being in such rock with kids waiting for my support.",
                "Upvotes": 2
            },
            {
                "Content": "Nope!",
                "Upvotes": 2
            },
            {
                "Content": "Ok, that gave me peepee shivers.",
                "Upvotes": 2
            },
            {
                "Content": "Moron.",
                "Upvotes": 2
            },
            {
                "Content": "Is it high enough to bass jump tho?",
                "Upvotes": 2
            },
            {
                "Content": "Fuck this guy",
                "Upvotes": 2
            },
            {
                "Content": "the rock: ok its done for me",
                "Upvotes": 2
            },
            {
                "Content": "There are just SO MANY videos of people doing this and oops they fell to their death. Probably not worth the pic.",
                "Upvotes": 2
            },
            {
                "Content": "Some things you dont do with your kids.......",
                "Upvotes": 2
            },
            {
                "Content": "oh man god forbid you son loses his balance next to that ledge.",
                "Upvotes": 2
            },
            {
                "Content": "Sometimes I'm glad I'm scared of heights, so I won't be doing stuff like this",
                "Upvotes": 2
            },
            {
                "Content": "OMFG! I can’t unsee this!",
                "Upvotes": 2
            },
            {
                "Content": "Love me some responsible parenting",
                "Upvotes": 2
            },
            {
                "Content": "Man pressed B to synchronize",
                "Upvotes": 2
            },
            {
                "Content": "Nope, not ever!",
                "Upvotes": 2
            },
            {
                "Content": "What a fucking moron",
                "Upvotes": 2
            },
            {
                "Content": "Well he already made it into the genepool so go for it 😂",
                "Upvotes": 2
            },
            {
                "Content": "Rock just breaks in half and he falls to his death 💀",
                "Upvotes": 2
            },
            {
                "Content": "gotta do it for the likes /s",
                "Upvotes": 2
            },
            {
                "Content": "I hope you enjoyed doing this because absolutely no one enjoyed watching it. Including your kids.",
                "Upvotes": 2
            },
            {
                "Content": "Parent of the decade.",
                "Upvotes": 2
            },
            {
                "Content": "Worst dad ever, what if his kid slips while his back is turned ?",
                "Upvotes": 2
            },
            {
                "Content": "My feet are tingling watching this…",
                "Upvotes": 2
            },
            {
                "Content": "This is exactly what us Mothers think Dads will do when we leave them to have fun 😂",
                "Upvotes": 2
            },
            {
                "Content": "Lol no brain",
                "Upvotes": 2
            },
            {
                "Content": "Where Children Services? Kid has more brains than Dad …and all I can think is “Catapult”",
                "Upvotes": 2
            },
            {
                "Content": "If I’m not mistaken, this is a common thing at Yosemite. I don’t remember but when I was a kid I was there with my parents and they said some dumb 20 something tourists were hanging off of it for fun",
                "Upvotes": 2
            },
            {
                "Content": "Why the fuck would you let your children within 5 feet of the edge? This guy needs some parental guidance",
                "Upvotes": 2
            },
            {
                "Content": "Some people are just retarded and some are retarded and have an ego",
                "Upvotes": 2
            },
            {
                "Content": "Can you:\nNot do this\nNot film it\nNot post to Reddit\n\nThank you.",
                "Upvotes": 2
            },
            {
                "Content": "Any GenXers here gettin that Wiley Coyote vibe?",
                "Upvotes": 2
            },
            {
                "Content": "Mmmmoooorrrooonnnnnnnn",
                "Upvotes": 2
            },
            {
                "Content": "But Why!?!",
                "Upvotes": 2
            },
            {
                "Content": "I know I'm just parroting the majority of the comments here but man this is so fucking rage inducing. I couldn't care less for the guy filming but his fucking kids man. First of all they know it's stupid but kids in general are stupid, say one of those kids think man let's throw a stone and stumbles. Or let's see how high this actually is and slips. Dad ain't saving them or even in shear panic dad will fall trying to save kids and then the kids have to live their lives with this in their brains. Look maybe I'm being dramatic here and over the top but surely this can be seen as a form of child abuse?",
                "Upvotes": 2
            },
            {
                "Content": "Should be reported.  What a psychopath",
                "Upvotes": 2
            },
            {
                "Content": "There like 4 kids all looking over to wtf",
                "Upvotes": 2
            },
            {
                "Content": "Man got the iPhone 14",
                "Upvotes": 2
            },
            {
                "Content": "Man it's far enough from my couch to my floor. My couch is pretty comfy too. Think I'll stay here.",
                "Upvotes": 2
            },
            {
                "Content": "In case you thought being a monumental dumbass in nature with your kids is something new [Wife throws baby to her husband](https://www.npr.org/2019/04/10/711031584/the-flying-baby-from-a-famous-1995-patagonia-catalog-photo-is-all-grown-up)",
                "Upvotes": 2
            },
            {
                "Content": "Seeing those kids standing on the edge like that mixed with this dude made my hands legit start tingling.",
                "Upvotes": 2
            },
            {
                "Content": "One day, it’ll break with someone on it. Inevitable.",
                "Upvotes": 2
            },
            {
                "Content": "Maybe thats not a fucking good idea.",
                "Upvotes": 2
            },
            {
                "Content": "People sure don’t think things through do they.",
                "Upvotes": 2
            },
            {
                "Content": "Stupid guy. #1 he is teach his kids to risk there life’s , #2 if he dies, his kids will be traumatized for life and may not make it back home.",
                "Upvotes": 2
            },
            {
                "Content": "It looks like it has broken off by the time this video was posted.",
                "Upvotes": 2
            },
            {
                "Content": "Great role model, dad.",
                "Upvotes": 2
            },
            {
                "Content": "Half dome is cool. Love the sights there. It's hella cold tho",
                "Upvotes": 2
            },
            {
                "Content": "Yep I definitely have a fear of heights!",
                "Upvotes": 2
            },
            {
                "Content": "This is how you get those videos of a guy Fallon hundreds of feet.",
                "Upvotes": 2
            },
            {
                "Content": "Eventually someone is going to play that game and have a sudden terrifying realization that it was a bad idea.",
                "Upvotes": 2
            },
            {
                "Content": "Wooow",
                "Upvotes": 2
            },
            {
                "Content": "“Possible cons are I die long before my time over a video and my kids watch me plummet to my death and grow up without a father while burdened with the memory of my death even though they warned me to be careful.\n\nPros are some likes from my 6 followers.\n\nWorth it.”",
                "Upvotes": 2
            },
            {
                "Content": "Fxckin asshole",
                "Upvotes": 2
            },
            {
                "Content": "If that fucking rock would had snapped, his kids would be there alone dealing with that shit. Glad nothing bad happened 🙄",
                "Upvotes": 2
            },
            {
                "Content": "Great influence",
                "Upvotes": 2
            },
            {
                "Content": "This is called \"all about me parenting\" and is quite popular amongst those who never had enough excitement in their single lives so most transfer forward into their married with children lives.",
                "Upvotes": 2
            },
            {
                "Content": "Horrid parent. His kids could be hurt while he’s pulling that stunt. He’s teaching them awful lessons. He could have literally died and traumatized his kids.",
                "Upvotes": 2
            },
            {
                "Content": "And when he falls I’m start laughing",
                "Upvotes": 2
            },
            {
                "Content": "My vagina is hurting and I’m a man 😅",
                "Upvotes": 2
            },
            {
                "Content": "Damn. The internet has desensitized me completely.  I was anticipating the fatal fall. Oh well next he tries something stupid on video he won't be so lucky.",
                "Upvotes": 2
            },
            {
                "Content": "Fuck this retard. \n\nWhat if he fell and his kids watched him die? They would be left there alone and probably die too. \n\nThey could fall or hurt themselves while this cunt plays with his little camera stick. \n\nLiterally should have his kids taken away. If he does this shit, what else are they doing? \n\nFast forward to a news interview. “What a terrible accident, no one could’ve seen it coming.”",
                "Upvotes": 2
            },
            {
                "Content": "I was a rock climber for most of my teens and twenties. I've been on top of Half Dome six times. I've sat on the very rock in this video more than once. \n\nI'm *also* a parent. This guy was a fucking moron to do that with his two kids there. I couldn't tell you the number of times that I've been doing *trivial* things and looked up to unexpectedly find my kid standing there because \"dad is doing something and I want to see\". Kids are naturally curious and don't always understand the dangers involved. JFC this was a dumb move.",
                "Upvotes": 2
            },
            {
                "Content": "What a dumbass, he’s gonna kill himself doing something stupid.\n\nOn an unrelated note, why does the Dynamic Island show up on screenshots on the iPhone 14 Pro?",
                "Upvotes": 4
            },
            {
                "Content": "A little irresponsible with those young kids",
                "Upvotes": 6
            },
            {
                "Content": "If that breaks and he falls to his almost guaranteed death what do you tell yourself? Sorry kids your dad was a moron?",
                "Upvotes": 2
            },
            {
                "Content": "I felt sick watching this",
                "Upvotes": 3
            },
            {
                "Content": "“What if you fall off daddy?” kid has infinitely more sense than the man child. Well he’d die and you’d be fatherless, traumatised and without adequate therapy would likely develop unhealthy coping mechanisms which would negatively affect copious relationships throughout your life..good job dad!",
                "Upvotes": 3
            },
            {
                "Content": "Just dumb",
                "Upvotes": 2
            },
            {
                "Content": "Dum ass",
                "Upvotes": 2
            },
            {
                "Content": "Fukkin idiot.🤦🏽‍♂️",
                "Upvotes": 4
            },
            {
                "Content": "Daddy is dumb. Sorry kids.",
                "Upvotes": 4
            },
            {
                "Content": "This should be evidence in a CPS case.\n\nI sat here for a few minutes trying to come up with words to describe how absolutely infuriatingly irresponsible and stupid this is, but there aren't any.\n\nJust wow.\n\nSomeone please take these kids away from this incredibly stupid person.",
                "Upvotes": 2
            },
            {
                "Content": "Irresponsible scumbag",
                "Upvotes": 3
            },
            {
                "Content": "Whose fuckin kids are that? Jesus Christ. Moron.",
                "Upvotes": 2
            },
            {
                "Content": "The butt clenching is strong with this one",
                "Upvotes": 2
            },
            {
                "Content": "With the kids around too.",
                "Upvotes": 2
            },
            {
                "Content": "Rocks can break.",
                "Upvotes": 2
            },
            {
                "Content": "No no no no no no no no no no no I feel this one in the palms of my feet what the no",
                "Upvotes": 2
            },
            {
                "Content": "More like half dome death wish",
                "Upvotes": 2
            },
            {
                "Content": "I got sweaty palms and I just shat on myself!",
                "Upvotes": 2
            },
            {
                "Content": "When your child has more sense than you do",
                "Upvotes": 2
            },
            {
                "Content": "Yeah that’s gonna be a no from me dawg",
                "Upvotes": 2
            },
            {
                "Content": "Sat up there on my 35th.",
                "Upvotes": 2
            },
            {
                "Content": "My 6'3 250lb ass would *NEVER*",
                "Upvotes": 2
            },
            {
                "Content": "Yah that got me a lil sick.",
                "Upvotes": 2
            },
            {
                "Content": "I could never do that and I would never EVER have my kid there",
                "Upvotes": 2
            },
            {
                "Content": "Fuck all of that",
                "Upvotes": 2
            },
            {
                "Content": "I'll never understand why people do this sorta stuff. I get extreme sports, skydiving and such but imagine you stand up too quick and get light headed next thing you're flat headed.",
                "Upvotes": 2
            },
            {
                "Content": "Hey kids wanna go out for some ice cream and lifelong trauma???",
                "Upvotes": 2
            },
            {
                "Content": "People okay with death if for a snapshot 🤦",
                "Upvotes": 2
            },
            {
                "Content": "I was expecting him to dangle from his feet😂",
                "Upvotes": 2
            },
            {
                "Content": "Anyone have info on this hike? I didn’t think young children were capable of taking a difficult trail like that. How long does this hike take to complete?",
                "Upvotes": 2
            },
            {
                "Content": "Yeah cause big flat sheets of unsupported stone sitting out over a 100+ foot drop are always the best place to have a seat... Stones never break",
                "Upvotes": 2
            },
            {
                "Content": "Way to potentially risk traumatizing your child for the rest of their life for a selfie.  Dick",
                "Upvotes": 2
            },
            {
                "Content": "Holy shit, do I up vote or down vote this shit? The kids...",
                "Upvotes": 2
            },
            {
                "Content": "Stupidity at it's best. He doesn't know if the stone has fractures in it.",
                "Upvotes": 2
            },
            {
                "Content": "Has a lot of faith of no cracks in that rock",
                "Upvotes": 2
            },
            {
                "Content": "Hopefully his wife never leaves him. Because she would have a case for full custody. Seems like an unfit parent.",
                "Upvotes": 2
            },
            {
                "Content": "[removed]",
                "Upvotes": 2
            },
            {
                "Content": "I know this is a bit harsh but I actually hate this guy. Like HATE him. Fuck is wrong with people.",
                "Upvotes": 2
            },
            {
                "Content": "0 chance I would do that period, but absolutely 100000000% not doing that with my fucking kids right there on the edge to potentially fall off or watch me fall. Guys a fucking idiot",
                "Upvotes": 2
            },
            {
                "Content": "I feel like it's really fucked up to do that in front of your kids. The risk *FAR* outweighs any kind of potential gain. Insane.",
                "Upvotes": 2
            },
            {
                "Content": "Just me maybe, but once you have a kid your time of being an idiot with your life should be done for a couple decades.",
                "Upvotes": 2
            },
            {
                "Content": "Fuck that, I wouldn't even want to be within 10 feet from that ledge.",
                "Upvotes": 2
            },
            {
                "Content": "WTF, it’s completely irresponsible. What did he get out of it, risking his and kid’s life? For what?",
                "Upvotes": 2
            },
            {
                "Content": "What a complete moron. \nWith his two kids right there as well. Dickhead",
                "Upvotes": 2
            },
            {
                "Content": "I am good with heights but fuck that",
                "Upvotes": 1
            },
            {
                "Content": "If I make it up there, I am definitely walking out on that.",
                "Upvotes": 0
            },
            {
                "Content": "Man that is not wise lol",
                "Upvotes": 1
            },
            {
                "Content": "Just plain stupid people don't realize that they are as soft as a watermelon.",
                "Upvotes": 0
            },
            {
                "Content": "What a f****** idiot",
                "Upvotes": 1
            },
            {
                "Content": "Fucking idiot",
                "Upvotes": 1
            },
            {
                "Content": "What an asshole",
                "Upvotes": 2
            },
            {
                "Content": "This guy is moron dad of the century",
                "Upvotes": 1
            },
            {
                "Content": "What an asshole. Down voted.",
                "Upvotes": 0
            },
            {
                "Content": "Alex Honnold did it better",
                "Upvotes": 1
            },
            {
                "Content": "Those are kids! What fucking example is this guy setting for these kids?",
                "Upvotes": 1
            },
            {
                "Content": "I did this with a full moon on LSD. It jump started my life.",
                "Upvotes": 1
            },
            {
                "Content": "Someone CPS. \nthis dude is on edge.",
                "Upvotes": 1
            },
            {
                "Content": "belongs in tourons",
                "Upvotes": 1
            },
            {
                "Content": "I felt that shit",
                "Upvotes": 1
            },
            {
                "Content": "This made my feet and hands tingle",
                "Upvotes": 1
            },
            {
                "Content": "More like half dome death wish",
                "Upvotes": 1
            },
            {
                "Content": "that's a hole lot of NOPE !",
                "Upvotes": 1
            },
            {
                "Content": "Popularity contests and infalted ego are a cancer that keeps spreading.",
                "Upvotes": 1
            },
            {
                "Content": "when people inevitably fall doing these things, i wonder how many hallucinate and see safety ropes or landing airbags or something of the sort and think they're saved right before the last bounce",
                "Upvotes": 1
            },
            {
                "Content": "You can’t stop Stupid People… it’s in their nature",
                "Upvotes": 1
            },
            {
                "Content": "Shitty dad of the year. What a fucktard, man that makes me mad.",
                "Upvotes": 1
            },
            {
                "Content": "Just fall before u have any more kids.",
                "Upvotes": 1
            },
            {
                "Content": "One day, someone will do this and SNAP, the old Wylie Coyote trick.",
                "Upvotes": 1
            },
            {
                "Content": "Every year a few idiots die in Yosemite.  Now I understand.",
                "Upvotes": 1
            },
            {
                "Content": "people like this are lame. great example you are setting.",
                "Upvotes": 1
            },
            {
                "Content": "Trusting that edge.....",
                "Upvotes": 1
            },
            {
                "Content": "TS/DW",
                "Upvotes": 1
            },
            {
                "Content": "I've been to the top of Half Dome.  I absolutely would not get near the edge and planted my back to a rock on the top.  This dude is nuts.",
                "Upvotes": 1
            },
            {
                "Content": "Play stupid games, earn stupid prizes.",
                "Upvotes": 1
            },
            {
                "Content": "what an idiot",
                "Upvotes": 1
            },
            {
                "Content": "\"yeah, you don't want to fall off\"\n\nGreat advice dad!",
                "Upvotes": 1
            },
            {
                "Content": "What a dumbass",
                "Upvotes": 1
            },
            {
                "Content": "Ohh yea call if the void would win out there, it’s just too east to lean forward",
                "Upvotes": 1
            },
            {
                "Content": "I have been up there and this is a no bueno, I wouldn't even stand on that particular spot. With my luck the wind would kick up and blow me off. Gives me the heebie-jeebies just watching it.",
                "Upvotes": 1
            },
            {
                "Content": "Dangerous people like this should not be allowed in our National parks and should be wrapped in bubbles if they want to stay in this country. Imagine the trauma and risk this kid is exposed to beyond this video.",
                "Upvotes": 1
            },
            {
                "Content": "Nope. I guess this guy has never seen a Wiley E. Coyote cartoon.",
                "Upvotes": 1
            },
            {
                "Content": "I feel a Darwin award coming",
                "Upvotes": 1
            },
            {
                "Content": "Yup, that's a nope for me Bob.",
                "Upvotes": 1
            },
            {
                "Content": "Stupid",
                "Upvotes": 1
            },
            {
                "Content": "Fucking moron",
                "Upvotes": 1
            },
            {
                "Content": "One day... The end will break off...",
                "Upvotes": 1
            },
            {
                "Content": "That rock totally could have snapped.",
                "Upvotes": 1
            },
            {
                "Content": "“What if you fell off, daddy??” ☠️",
                "Upvotes": 1
            },
            {
                "Content": "In how many languages can you say IRRESPONSIBLE??",
                "Upvotes": 1
            },
            {
                "Content": "is this person trained or experienced? because if so then that's easily a death wish",
                "Upvotes": 1
            },
            {
                "Content": "FUCK NO",
                "Upvotes": 1
            },
            {
                "Content": "Kid would be traumatized for life to watch him fall",
                "Upvotes": 1
            },
            {
                "Content": "My heart monitor is going off",
                "Upvotes": 1
            },
            {
                "Content": "Gotta get those likes.",
                "Upvotes": 1
            },
            {
                "Content": "Kids man....come on.",
                "Upvotes": 1
            },
            {
                "Content": "Whyyyyyyyy!!!!!!!!",
                "Upvotes": 1
            },
            {
                "Content": "CPS require evidence to act. This is what that is",
                "Upvotes": 1
            },
            {
                "Content": "I hope they took his kids away.",
                "Upvotes": 0
            },
            {
                "Content": "I seen and had my kids trip and fall over their shoes and absolutely nothing on so many occasions I can’t even count. He should be ashamed of himself and the mother of these kids should be livid with him",
                "Upvotes": 0
            },
            {
                "Content": "I hope he loses his job and gets dickhead stamped on his forehead",
                "Upvotes": 0
            },
            {
                "Content": "Well, that was the stupidest thing I’ve seen in a long time.  If he’s going for the coveted Darwin Award…he must be in the lead.",
                "Upvotes": 0
            },
            {
                "Content": "This is like putting your kids in the front seat of the car, only more dangerous!",
                "Upvotes": 0
            },
            {
                "Content": "Bad man!",
                "Upvotes": 0
            },
            {
                "Content": "Call DSS",
                "Upvotes": 0
            },
            {
                "Content": "Dude is nuts, but his nuts are made of steel… idiot.",
                "Upvotes": -1
            },
            {
                "Content": "Call cps, call the police, go crazy! But don't tell people how to raise their kids! They makes dirt bikes for kids, there's kids mma, all kinds of kids sports, but \"oh no you can't take your kid hiking there, bad parenting!\" Save your breath and do something about it if you really think this is that bad",
                "Upvotes": 0
            },
            {
                "Content": "Poor decision making skills.",
                "Upvotes": 1
            },
            {
                "Content": "It’s always the people who walk barefoot outside",
                "Upvotes": 0
            },
            {
                "Content": "That was the day I watched my father die.",
                "Upvotes": 0
            },
            {
                "Content": "He played a stupid game, I’m honestly shocked he didn’t win a stupid prize.",
                "Upvotes": -1
            },
            {
                "Content": "[removed]",
                "Upvotes": -28
            },
            {
                "Content": "My god man. The comments here. That guy is taking his kids on a wonderfully fulfilling adventure, and god forbid he does something himself, he should only think of his children, his life is now over, no longer do anything that he might want. \n\nOh no, the rock might break. Oh no he might slip. Oh no, his kids might slip. Yer, you are all right, he should not go on the rock, maybe not clime up there, maybe not go? Probably best to stay at home, could die in the car ride there.\n\nThe best memories I have are of my dad doing things with me that made us feel alive. Rock climbing, sailing, playing rugby. All of them could have hurt me, and him. But yet male suicide continues to be the leading cause of male death for 20 to 49 year olds in the UK what protects us from that?\n\nI’m prepared for this to be downvoted to oblivion, but I think Reddit looks at the world in the wrong way. It’s like a fucking echo chamber in here.",
                "Upvotes": 1
            },
            {
                "Content": "Made my taint tingle",
                "Upvotes": 1
            },
            {
                "Content": "What an arrogant prick",
                "Upvotes": 1
            },
            {
                "Content": "the question for this type of video is always the same : why?",
                "Upvotes": 1
            },
            {
                "Content": "Proof some people should not be allowed to reproduce",
                "Upvotes": 1
            },
            {
                "Content": "Jesus, I hiked to the bottom of the cable path, that was enough for me.",
                "Upvotes": 1
            },
            {
                "Content": "So dumb",
                "Upvotes": 1
            },
            {
                "Content": "Tension. No Release.",
                "Upvotes": 1
            },
            {
                "Content": "That is so fucking reckless and goes beyond adrenaline junkie activities. I'm not saying he shouldn't risk his life, just don't do it with, and in front of your kids. Imagine the trauma those poor boys would have to bear the rest of their lives watching their father fall to his death. What a selfish asshole. What, is the adrenaline of being that high up on a cliff with young children not enough for you? 100% I promise you that guy has a micropenis and doing shit like this is the only way he knows how to cope with it.",
                "Upvotes": 1
            },
            {
                "Content": "What a dumb shit",
                "Upvotes": 1
            },
            {
                "Content": "made my stomach feel funny just watching this",
                "Upvotes": 1
            },
            {
                "Content": "That stone outcropping will eventually fail. Maybe in a few hundred years. Maybe in a thousand. Maybe tomorrow.",
                "Upvotes": 1
            },
            {
                "Content": "My stomach was literally feeling sick looking at that! Thank goodness your shoes are still on. Lol",
                "Upvotes": 1
            },
            {
                "Content": "That's not cool, that's stupid",
                "Upvotes": 1
            },
            {
                "Content": "What a stupid thing to do",
                "Upvotes": 1
            },
            {
                "Content": "ID of this man so I can call CPS?",
                "Upvotes": 1
            },
            {
                "Content": "Don't do stupid shit like that",
                "Upvotes": 1
            },
            {
                "Content": "eeewwww it gave me that weird feeling in my stomach! ugggg",
                "Upvotes": 1
            },
            {
                "Content": "Made my nuts tingle watching this.",
                "Upvotes": 1
            },
            {
                "Content": "What a piece of shit parent",
                "Upvotes": 1
            },
            {
                "Content": "One day that ledge will give out to erosion hopefully while no one is on it or below it. But that could of happened in front of his kids smh so dumb.",
                "Upvotes": 1
            },
            {
                "Content": "When the kids have more sense than the parent 😵‍💫🤦‍♀️\nDid you get the shot you wanted, Dad? That piece could’ve cracked and broken and what would his kids do then?",
                "Upvotes": 1
            },
            {
                "Content": "RESPECT.",
                "Upvotes": 1
            },
            {
                "Content": "yea no shit you don't wanna fall",
                "Upvotes": 1
            },
            {
                "Content": "I hate this man.",
                "Upvotes": 1
            },
            {
                "Content": "Then he slides 🛝 off",
                "Upvotes": 1
            },
            {
                "Content": "So stupid he has the little boy so close to the edge and he climbs out on a small ledge WTF WTH SMH",
                "Upvotes": 1
            },
            {
                "Content": "r/maybemaybemaybe",
                "Upvotes": 1
            },
            {
                "Content": "My legs got numb watching this. So scary especially with little ones around.",
                "Upvotes": 1
            },
            {
                "Content": "F that!",
                "Upvotes": 1
            },
            {
                "Content": "Cps",
                "Upvotes": 1
            },
            {
                "Content": "Moron",
                "Upvotes": 1
            },
            {
                "Content": "“AND HIS NAME IS JOHN CENA!”",
                "Upvotes": 1
            },
            {
                "Content": "A measured fear of heights is natural and healthy. Dude’s got some hubris.",
                "Upvotes": 1
            },
            {
                "Content": "r/nope",
                "Upvotes": 1
            },
            {
                "Content": "Half Dome has been climbed free solo. That means WITHOUT A ROPE. Gtfo with your \"NBD Foot Dangle\" op. And I wouldn't let my kid that close to the edge either.",
                "Upvotes": 1
            },
            {
                "Content": "I am dizzy just by looking at this video...",
                "Upvotes": 1
            },
            {
                "Content": "My palms are leaking",
                "Upvotes": 1
            },
            {
                "Content": "Cares more about making a video than possibly plunging to his death in front of his son and leaving him without a father.",
                "Upvotes": 1
            },
            {
                "Content": "This guy should just play Russian roulette.",
                "Upvotes": 1
            },
            {
                "Content": "Mufasa nooooo!",
                "Upvotes": 1
            },
            {
                "Content": "Normally I don't care but with kids involved can we find out who this fuck stick is and get em reported?",
                "Upvotes": 1
            },
            {
                "Content": "Can I get a fuck no?",
                "Upvotes": 1
            },
            {
                "Content": "Hey I can see my house from there!",
                "Upvotes": 1
            },
            {
                "Content": "In the famous words of JonTron\n\nBut why? Why would you do that, why would you do any of that?",
                "Upvotes": 1
            },
            {
                "Content": "That makes me feel nervous and queasy just watching",
                "Upvotes": 1
            },
            {
                "Content": "This is the has to be one of the dumbest things I've ever seen a father do. He's with 2 kids. Not only could he fall to his death so could they. And if he were to fall his kids would be scarred for life or die as well. Wtf",
                "Upvotes": 1
            },
            {
                "Content": "This is the first post that actually made my palms sweat",
                "Upvotes": 1
            },
            {
                "Content": "This should be on r/parentsarefuckingdumb",
                "Upvotes": 1
            },
            {
                "Content": "He got a parachute?",
                "Upvotes": 1
            },
            {
                "Content": "Yo • se • mite…\nAlso, bad parenting",
                "Upvotes": 1
            },
            {
                "Content": "How do you get back from that? Backwards scoot? Fuck thisss",
                "Upvotes": 1
            },
            {
                "Content": "It’s crazy that idiots like this are teaching the next generation",
                "Upvotes": 1
            },
            {
                "Content": "My feet are screaming at me watching this. No. Absolutely fucking not. Only if my life depended on it, and even then... no. (I'm not afraid of heights in general, btw, just dying for no reason)",
                "Upvotes": 1
            },
            {
                "Content": "YALL GOT WAY TO MUCH TRUST IN THE UNIVERSE! Fuck that.",
                "Upvotes": 1
            },
            {
                "Content": "\\*crack\\* \\*snap\\*",
                "Upvotes": 1
            },
            {
                "Content": "That’s the kind of shit I’d do when I was 20 years younger. My sense of mortality suddenly kicked in a few years ago.",
                "Upvotes": 1
            },
            {
                "Content": "Oh boy I love white people",
                "Upvotes": 1
            },
            {
                "Content": "Fuck no",
                "Upvotes": 1
            },
            {
                "Content": "You know, I think people willingly managed to kill off a portion of their brain.  The one that says \"What good will come for this?\"    Or have managed to add a secondary line of \"The chance to risk my life to become internet famous.\"",
                "Upvotes": 1
            },
            {
                "Content": "Well.. my palms are actually sweaty now.",
                "Upvotes": 1
            },
            {
                "Content": "Dumbass.",
                "Upvotes": 1
            },
            {
                "Content": "Nooooope nope nope nope nope",
                "Upvotes": 1
            },
            {
                "Content": "Not worth it when you have kids you should do less dumb shit",
                "Upvotes": 1
            },
            {
                "Content": "And that’s exhibit A for when their mom wants custody.",
                "Upvotes": 1
            },
            {
                "Content": "Teaching your kids to take stupid and unnecessary risks for a selfie. Brilliant! Great example Dad.",
                "Upvotes": 1
            },
            {
                "Content": "Imagine that rock snapping",
                "Upvotes": 1
            },
            {
                "Content": "It’s not everyday a kid gets to watch ol dad plummet to his death",
                "Upvotes": 1
            },
            {
                "Content": "How many influencers a year die “ infuenging”?",
                "Upvotes": 1
            },
            {
                "Content": "Might be time to bring back the Ättestupa…",
                "Upvotes": 1
            },
            {
                "Content": "Leave it up to a kid to even say that out loud 😂 man 🤦🏾‍♂️",
                "Upvotes": 1
            },
            {
                "Content": "Anyone who ever watched Wile E. Coyote and the Road Runner would never sit on rocks like that.",
                "Upvotes": 1
            },
            {
                "Content": "Whatta fucking loser…..we’re all soooo glad he got that shot on video 🤗",
                "Upvotes": 1
            },
            {
                "Content": "What a moron!",
                "Upvotes": 1
            },
            {
                "Content": "100% Moron",
                "Upvotes": 1
            },
            {
                "Content": "“What if you fall off daddy?” POS",
                "Upvotes": 1
            },
            {
                "Content": "[shameless original post on insta](https://www.instagram.com/p/CP0r-F4jD_k/?igshid=YmMyMTA2M2Y=)",
                "Upvotes": 1
            },
            {
                "Content": "The kid had it right “sketchy?”",
                "Upvotes": 1
            },
            {
                "Content": "DOES HE HAVE CHILDREN WITH HIM?!?! Because, wtf!!",
                "Upvotes": 1
            },
            {
                "Content": "Por razones como esta, los hombres viven menos que las mujeres",
                "Upvotes": 1
            },
            {
                "Content": "sketchy haha",
                "Upvotes": 1
            },
            {
                "Content": "Hey, stop doing that.",
                "Upvotes": 1
            },
            {
                "Content": "should be banned from national parks",
                "Upvotes": 1
            },
            {
                "Content": "real nice in front of your kids let them watch you fall to your death some people are so dumb",
                "Upvotes": 1
            },
            {
                "Content": "Natural selection much?",
                "Upvotes": 1
            },
            {
                "Content": "Dumb ass in front of the kids better prey they dont mock you dumb ass",
                "Upvotes": 1
            },
            {
                "Content": "Why?",
                "Upvotes": 1
            },
            {
                "Content": "Yeah do that in front of your children so that if you fall they will just be permanently scared",
                "Upvotes": 1
            },
            {
                "Content": "NO! HELL NO!",
                "Upvotes": 1
            },
            {
                "Content": "Yeah…f*** no especially with your kid???",
                "Upvotes": 1
            },
            {
                "Content": "One of the biggest idiots this world has seen. What would have happened if it had snapped leaving those two kids up there? One kid looked no more than 5 years old. I’m dumbfounded",
                "Upvotes": 1
            },
            {
                "Content": "Nice to see no one on Reddit takes their kids outdoors anymore.",
                "Upvotes": 1
            },
            {
                "Content": "orphan maker",
                "Upvotes": 1
            },
            {
                "Content": "Wow this is irresponsible and stupid",
                "Upvotes": 1
            },
            {
                "Content": "Social services someone please",
                "Upvotes": 1
            },
            {
                "Content": "This is a very stupid man",
                "Upvotes": 1
            },
            {
                "Content": "& if the rock breaks you scar your kids for life as they watch there dad die. Good move",
                "Upvotes": 1
            },
            {
                "Content": "i love this",
                "Upvotes": 1
            },
            {
                "Content": "I checked whether it was the “WhatCouldGoWrong” subreddit before I finished the video..",
                "Upvotes": 1
            },
            {
                "Content": "I was hoping that rock split in half when he got out there. Daddy noooo!",
                "Upvotes": 1
            },
            {
                "Content": "I hate this camera angle so much",
                "Upvotes": 1
            },
            {
                "Content": "Imagine that rock cracks. Years of therapy.",
                "Upvotes": 1
            },
            {
                "Content": "I'm not even afraid of heights but fuck that got my adrenaline going from my couch. The slightest wind w we would knock him off",
                "Upvotes": 1
            },
            {
                "Content": "No wonder why so many people die in Yosemite",
                "Upvotes": 1
            },
            {
                "Content": "Did the kid say please fall of daddy lol?",
                "Upvotes": 1
            },
            {
                "Content": "What a moron",
                "Upvotes": 1
            },
            {
                "Content": "Irresponsable dad",
                "Upvotes": 1
            },
            {
                "Content": "ALEX HONNOLD CLIMBED THAT WITH NO ROPES",
                "Upvotes": 1
            },
            {
                "Content": "I can’t upvote stupid shit like this!!",
                "Upvotes": 1
            },
            {
                "Content": "That’s The Diving-board! I’ve been there!",
                "Upvotes": 1
            },
            {
                "Content": "Even the kids are to close to the edge 😳",
                "Upvotes": 1
            },
            {
                "Content": "Crack*",
                "Upvotes": 1
            },
            {
                "Content": "Seriously great example to set for your kid. Darwin award recipient for sure",
                "Upvotes": 1
            },
            {
                "Content": "DANGEROUS!",
                "Upvotes": 1
            },
            {
                "Content": "That's pretty dope",
                "Upvotes": 1
            },
            {
                "Content": "His kid even tries reminding him how irresponsible it is, TWICE",
                "Upvotes": 464
            },
            {
                "Content": "I’m amazing that kid walked up the cable path. Unless there is another way which I don’t think so",
                "Upvotes": 47
            },
            {
                "Content": "Someone needs to report this dude to the NP like they did with that chick golfing in the Grand Canyon. Get this dude banned from NP’s.",
                "Upvotes": 26
            },
            {
                "Content": "Gotta send the kid first to make sure it can hold some weight.",
                "Upvotes": 5
            },
            {
                "Content": "Father of the year",
                "Upvotes": 3
            },
            {
                "Content": "I mean if you’ve raised your kid to listen to simple directions they should understand “stay right there, do not come past that” \n\nKids can experience stuff like this, you just need to make sure they understand that the place you’re going to isn’t for play or anything even adjacent to it.",
                "Upvotes": -2
            },
            {
                "Content": "Shitting my pants for the kids, not for him. That kid looks about 7 yrs old. Not a hope of having my child anywhere near a cliff at that age. Absolute mental stuff.",
                "Upvotes": 528
            },
            {
                "Content": "And if the rock breaks, he's leaving two kids to watch him fall to his death, then have to make it back to the bottom of Half Dome and get on with their lives somehow.\n\nDoing it for likes.",
                "Upvotes": 96
            },
            {
                "Content": "Right!? Just so irresponsible on so many levels.",
                "Upvotes": 192
            },
            {
                "Content": "My first thought. Second was, if he did fall, then two kids are now alone up there. Such an idiot father.",
                "Upvotes": 105
            },
            {
                "Content": "When I saw that it made my heart skip a beat…",
                "Upvotes": 8
            },
            {
                "Content": "Yeah, but imagine the likes he's going to get...",
                "Upvotes": 7
            },
            {
                "Content": "Ho-ly fuck that man is brain dead.",
                "Upvotes": 6
            },
            {
                "Content": "Judging by his actions of going out on that dangerous ass ledge I highly doubt this guy is in the running for \"father of the year\". 😂😂",
                "Upvotes": 4
            },
            {
                "Content": "And the award for the responsible adult is…",
                "Upvotes": 3
            },
            {
                "Content": "Better than bringing them on the overhang with him.",
                "Upvotes": 2
            },
            {
                "Content": "Yeah I cannot overstate the number of ways in which that guy can go fucking fuck himself.",
                "Upvotes": 1
            },
            {
                "Content": "And that's aside from the fact he took kids up half dome in the first place! Ive gone up those cables before and its dangerous as fuck. Someone slid off and died 2 weeks before we did it. Its not a place children should ever be",
                "Upvotes": 0
            },
            {
                "Content": "I am so angry at him for putting his kids through that. What if he had fallen in front of them?? He’s not right in the head.",
                "Upvotes": 0
            },
            {
                "Content": "Gotta get those TikTok.views!!! Responsible parenting be damned.",
                "Upvotes": 0
            },
            {
                "Content": "I see 3 unattended kids here",
                "Upvotes": 1
            },
            {
                "Content": "Not even want my kids see me when I'm doing that",
                "Upvotes": 1
            },
            {
                "Content": "Real unparenting",
                "Upvotes": 10
            },
            {
                "Content": "Thats a 10 sec drop, long enough to think hard about the horror trauma you just burdened your children with",
                "Upvotes": 71
            },
            {
                "Content": "Drowning was pretty bad. I think I'd rather take a short fall",
                "Upvotes": 1
            },
            {
                "Content": "For sure I jumped off a 65 ft cliff numerous times and it's terrifying",
                "Upvotes": 1
            },
            {
                "Content": "Couldn't he be charged with child endangerment??  This is outrageous behaviour with kids right there. omfg",
                "Upvotes": 42
            },
            {
                "Content": "Would you rather live your life on the sofa? Climbing Half Dome is awesome, I bet those kids had a blast",
                "Upvotes": -76
            },
            {
                "Content": "Why do you suppose he thinks?",
                "Upvotes": 28
            },
            {
                "Content": "He even turned off the comments because he knew he was going to get ripped to shreds",
                "Upvotes": 19
            },
            {
                "Content": "Right! Since becoming a parent, my level of risk assessment is MUCH diff. This is a huge no for me.",
                "Upvotes": 23
            },
            {
                "Content": "Not so much attention more like an adrenaline junkie l",
                "Upvotes": -4
            },
            {
                "Content": "Are they a rock climbing family?  \n\nI know a few rock climbing families and can see them doing this.\n\n(Not saying it’s a good thing. It’s just that they are used to heights and calculated risk taking and it’s part of their daily lives. Rock climbers still die and the kid said it’s sketchy so he knew this was not a level of safety they are used to perhaps from being without a harness, rope, helmet. ).",
                "Upvotes": 1
            },
            {
                "Content": "At some point it will, but it’s a Yosemite landmark. Hell I’ve been out on the diving board and I didn’t die. Got an awesome photo though!\n\nEdit: hundreds of people go to this spot every year and none of them have died. You are more likely to be struck by lightning, get eaten by a shark, crushed by a vending machine. Way more likely to die in traffic on the way to your dead end job. \n\nGo nuts, live a little",
                "Upvotes": -155
            },
            {
                "Content": "Good comment.  Auto downvote on the post, don't want to encourage it.",
                "Upvotes": 1
            },
            {
                "Content": "I could see a kid react to their father falling off that cliff, by jumping right after him....very easily. Before they even realized what they were doing.",
                "Upvotes": -1
            },
            {
                "Content": "My feet are tingling",
                "Upvotes": 5
            },
            {
                "Content": "People climb out on that rock all the time. It’s whatever, but having kids in tow honestly turns my stomach",
                "Upvotes": 0
            },
            {
                "Content": "That broke my heart.",
                "Upvotes": 2
            },
            {
                "Content": "[This is the only explanation.](https://youtu.be/twdpYiW6B8A)",
                "Upvotes": 1
            },
            {
                "Content": "Just drag them across my face and they’ll feel much better afterwards, I promise. ☺️",
                "Upvotes": 4
            },
            {
                "Content": "I think it’s around 3,000 feet so definitely.",
                "Upvotes": 1
            },
            {
                "Content": "It’s way too high for a bass jump. Bass can only jump a short distance above the surface of the water.",
                "Upvotes": 1
            },
            {
                "Content": "Almost guaranteed death lol? I’d say death is the only outcome if he fell.",
                "Upvotes": 3
            },
            {
                "Content": "It’s about 3,000 feet, so even worse! 😂",
                "Upvotes": 2
            },
            {
                "Content": "My wife would have packed the bags, waited for me to pull up with the kids, grabbed them and driven off without every saying a fucking word. Divorce papers would have been printed out and left for me to find as soon as I walked in the house.  Not necessarily because “I” risked “my” life scooting out on the ledge like that, but because I chose to do this in front of my kids while leaving them all unattended at the fucking edge of a cliff.  \nI seriously have no words.. and neither would my wife in this case. She’d be long gone and take me for every penny. And I wouldn’t blame her either.  It would take a loonng time for me to come back from this. Thankfully I’m not this dumb",
                "Upvotes": 2
            },
            {
                "Content": "\"at least, 1471 people liked me before i died\"",
                "Upvotes": 1
            },
            {
                "Content": "Don’t mind the downvotes, I went out on the diving board and it was awesome. \n\nDefinitely gave me sweaty palms, but the view of the Yosemite valley is unparalleled.",
                "Upvotes": 0
            },
            {
                "Content": "Yup. Those kids made it up the cables. People freaking out that they’re left back there.. what could happen to this guy? He’s not going to randomly fall off. Heights are an instinctual fear. The kids arnt just going to run and jump off",
                "Upvotes": 0
            },
            {
                "Content": "I don't see why? Besides maybe having his kids there. This is something that is completely allowed in Yosemite by the NPS and is quite the attraction",
                "Upvotes": 3
            },
            {
                "Content": "I [failed](https://imgur.com/ajjsw) to earn a Darwin on that rock, didn't go as far out as dad here, but you can see how narrow the diving board gets.",
                "Upvotes": 1
            },
            {
                "Content": "That killed me. You can tell that poor kid’s trying to allay his fears.",
                "Upvotes": 1
            },
            {
                "Content": "Don't bring race into random stuff",
                "Upvotes": 19
            },
            {
                "Content": "Ayy bruh don’t rope us in with this moron, there’s no chance in hell I’m doing this 😂",
                "Upvotes": 14
            },
            {
                "Content": "Do middle eastern people count as white?",
                "Upvotes": 6
            },
            {
                "Content": "He looks Asian...",
                "Upvotes": 3
            },
            {
                "Content": "Why are people so offended by this lol it’s true. White people seem to do more dumb shit than any other race. Source: white male who has done more dumb shit than the average person.",
                "Upvotes": -10
            },
            {
                "Content": "Is it wrong to wish the rock to just let go and fall?\nAsking for a friend.",
                "Upvotes": 1
            },
            {
                "Content": "\"Sketchy\" kid is already smarter than his dad. He's seen him fuck up a few times already.",
                "Upvotes": 184
            },
            {
                "Content": "\"A 2018 study of news reports showed that there were 259 selfie deaths...\"",
                "Upvotes": 2
            },
            {
                "Content": "remind me on Alain Robert, the guy from french who climb rocks and buildings since he is a kid",
                "Upvotes": 1
            },
            {
                "Content": "My buddy did it when we were like 12 or 13, I remember. Is it that gnarly? (I’ve never been)",
                "Upvotes": 15
            },
            {
                "Content": "rich fucks w/ helicopters",
                "Upvotes": 0
            },
            {
                "Content": "bruh they do this all the time i went to grand canyon about 3 years ago dumb asses all over this one chick and her hippie bf all over the edges\n\npeople fall alot it never makes the news they shut the park down never say anything untill the bodys are removed....you would be surprised how many people actually die yearly all over in nat parks",
                "Upvotes": 0
            },
            {
                "Content": "Haha. What a little tattletale you are.",
                "Upvotes": 0
            },
            {
                "Content": "Banned for what? Being a dumbass? Unlike the Grand Canyon golfer, this guy isn't actually doing anything prohibited by park policy, banned by signage, or damaging to the park. \n\nLike it or not, stupidity is not a crime.",
                "Upvotes": 1
            },
            {
                "Content": "better than alcoholics",
                "Upvotes": 0
            },
            {
                "Content": "I get what you’re saying and my own kids are very well behaved but I also think “it only takes one mistake”. Kids are impulsive and even normally well behaved kids can mess up and I really don’t want that time to be in a place like this. \n\nDoes that mean young kids shouldn’t go to these places. Idk. I can see the benefit of them experiencing places like this but they can also visit later so is it worth the risk?  \n\nI don’t have an answer to that.  Only that I wouldn’t be able to enjoy myself up there with my kids because all I would think of is the worst case scenario",
                "Upvotes": 3
            },
            {
                "Content": "This is called stupidity",
                "Upvotes": 113
            },
            {
                "Content": "Literally nightmare fuel",
                "Upvotes": 42
            },
            {
                "Content": "Took my three year old to grand canyon. We had a few scares. Never again.",
                "Upvotes": 1
            },
            {
                "Content": "I was more worried about the rock breaking and his stupid self falling to his death and traumatizing his children while leaving them stranded\n\nDidn’t even think about that part of it. Man is doubly stupid",
                "Upvotes": 1
            },
            {
                "Content": "I'm looking at the counter weight rocks the kids sitting on. Say he levers it so those rocks take him and the kid sitting on it down.",
                "Upvotes": 26
            },
            {
                "Content": "Called Darwinism you would love the FB page i admin. We follow anti vaxxers as they die of covid… it’s beautiful really. I’ve learned so much too from it watching people slowing die on life support as their organs rot from the inside out. Truly fascinating stuff at least this guy will be dead in seconds if he slips not months",
                "Upvotes": -1
            },
            {
                "Content": "I have an early childhood memory of my mom being absolutely livid at my father who decide to free climb a bit of rock wall on a family hike one day. As an adult and especially watching this, I totally understand her.",
                "Upvotes": 58
            },
            {
                "Content": "When we went to the Cliffs of Moher when I was def older than these kids, my dad said to me and my sister \"if either of you two get within ten feet of the edge, I'll kill ya dead.\"",
                "Upvotes": 3
            },
            {
                "Content": "For the gram!",
                "Upvotes": 29
            },
            {
                "Content": "Well. Today is his day with the kids , haha \ndivorce decrees.",
                "Upvotes": 1
            },
            {
                "Content": "Parent unrealing",
                "Upvotes": 3
            },
            {
                "Content": "Parent unrealing",
                "Upvotes": 1
            },
            {
                "Content": "I’d also imagine that 10 seconds feels a lot longer than it actually is. I’ve been in extreme events where time seemed to slow down a bit, I can only imagine that same effect while falling off a cliff. People call it time dilation or bullet time.",
                "Upvotes": 19
            },
            {
                "Content": "It doesn't make it any less irresponsible. Kids do not have the same balance coordination that grown adults do. This is incredibly reckless.",
                "Upvotes": 39
            },
            {
                "Content": "Kids dont do what you say they do what they see you do. Have to lead by example i believe. i dont have kids lol but i was one.",
                "Upvotes": 6
            },
            {
                "Content": "There is a wide gulf of reasonableness between living your life on a sofa and doing something this stupid.",
                "Upvotes": 8
            },
            {
                "Content": "Pretty sure there’s a lot of ways to live between the sofa and doing reckless shit that puts your children at risk?",
                "Upvotes": 5
            },
            {
                "Content": "Climbing half dome isn't what people are taking issue with here, I feel like you must know that lol",
                "Upvotes": 0
            },
            {
                "Content": "It turns out you can climb half dome without needlessly tempting fate to fucking kill you in front of your children. Possibly risking their lives in the process. \n\nThis was incredibly stupid.",
                "Upvotes": 1
            },
            {
                "Content": "Ha, downvote 69.  \n\n\n*noice*",
                "Upvotes": 1
            },
            {
                "Content": "null",
                "Upvotes": 4
            },
            {
                "Content": "Well I know that kids in that age do random shit. Like you can’t trust them!:D",
                "Upvotes": 1
            },
            {
                "Content": "Hey I’ve also been here, just wanted to let you know a few people *have* died on this very spot.  Random and strong gusts of wind at that altitude has killed 2 people that I know about while they were taking a picture on the diving board.\n\nI have a feeling dying on that spot is a bit higher chance than being eaten by a shark and whatever else you compared it to.  It’s extremely dangerous.",
                "Upvotes": 63
            },
            {
                "Content": "Fuck it. Keep going. Clean up the gene pool.",
                "Upvotes": 12
            },
            {
                "Content": "Am I missing something intelligent in your comment? It has 3 upvotes, so I'm just thinking, you and three other people think what you've shared here is smart despite sounding dumb as heck to me.",
                "Upvotes": 68
            },
            {
                "Content": "As someone who would gladly go on the ledge here, I agree with you. But you should probably distinguish between an unforced error and a forced error. \n\nIf Joe Shmoe dies driving to work, that would be considered an unforced error (even though it’s statistically more likely)\n\nNow if Joe Shmoe dies on this rock, that would be what we call a forced error (even though it’s statistically less likely)",
                "Upvotes": 7
            },
            {
                "Content": "There is a very real chance you will live a lot less. Geology and rock formations changing isn’t something that just stopped when you were born",
                "Upvotes": 4
            },
            {
                "Content": "Yeah,  thrill seeking is one thing,  child endangerment is quite another.",
                "Upvotes": 7
            },
            {
                "Content": "Live a little? I'm not sure people on this sub are familiar with the concept...\n\nStill kinda shitty parenting tho",
                "Upvotes": 2
            },
            {
                "Content": "Especially with two kids! But yolo right?",
                "Upvotes": 2
            },
            {
                "Content": "> You are more likely to be struck by lightning, get eaten by a shark, crushed by a vending machine.\n\ncould you show where you got these stats? they're obviously not true, i just want to know who's out there lying to you.",
                "Upvotes": 2
            },
            {
                "Content": "Was up on there on the visor of half dome a couple months ago. At the age that the kids are at I’d hope to trust them not to jump to their deaths. Hundreds of thousands hike yearly and it’s been years since someone died, and it happened on the cable section. Totally agree 👍🏼",
                "Upvotes": 1
            },
            {
                "Content": "Rocks are brittle, they don’t bend before they break\n\nMaterials (including rocks) will eventually fail from something called fatigue, cyclic loading \n\nLet that sink in, if enough people do this it is 100% guaranteed to eventually break.  It’s a reverse lotto",
                "Upvotes": 1
            },
            {
                "Content": "Goodbye",
                "Upvotes": 1
            },
            {
                "Content": "Oh HELL YA! Know where I’m going for a jump. When I finally can anyway.",
                "Upvotes": 1
            },
            {
                "Content": "If he back flips before he lands, he will be too cool to.die",
                "Upvotes": 1
            },
            {
                "Content": "That's still 100+ ft 😂😂",
                "Upvotes": 3
            },
            {
                "Content": "I’ve stood on ledges across pretty much every canyon in the US, I think I can manage one more. My most popular post is from a ledge at angels landing. People always give me shit but skydivers, bungee jumping, rock climbing, slack lining, etc…all that is ok. Walking out on a rock ledge, no how stupid!!!!’",
                "Upvotes": 4
            },
            {
                "Content": "So you keep saying. I hope you didn't have two unsupervised kids up on the edge while you got your thrills too.",
                "Upvotes": 2
            },
            {
                "Content": "It's probably exactly paralleled by the view from ten feet back",
                "Upvotes": 2
            },
            {
                "Content": "You know miserable people always want to tell other people how to live their lives.",
                "Upvotes": 2
            },
            {
                "Content": "Only Jesus",
                "Upvotes": 14
            },
            {
                "Content": "No",
                "Upvotes": 3
            },
            {
                "Content": "Gotta start the challenge somehow",
                "Upvotes": 1
            },
            {
                "Content": "Its like hiking up a wall, almost. \nComing down is fun too. Stay within the two cables. You can do it. If its raining they shut it down\nRemember its 8? Miles up and 3500? Vertical feet up from the park floor, so you’re pretty fatigued.",
                "Upvotes": 20
            },
            {
                "Content": "It’s definitely a challenging hike but it’s 100% worth it. My buddy and I hit the trailhead at 4 am and got to the cables around 9am, if I remember correctly. If you start early you’re more likely to beat any weather and the lines/traffic jam to go up and down the cables. In my opinion, the cables aren’t as hard or scary as they are made out to be. The worst/hardest part for me was the switchbacks leading up to half dome. If I didn’t have poles I think my knees would have exploded.",
                "Upvotes": 4
            },
            {
                "Content": "People like to do stuff like this because it’s exiting. I can understand it though I don’t agree. But this guy has his kid with him.  What if the kid saw his dad fall? Or tried to help him and fell himself?\n\nBeing a parent means your life of perilous adventure is on hold until they can care for their self or at least wait until they aren’t there with you at the very least.",
                "Upvotes": 2
            },
            {
                "Content": "No,  it's called child abuse.",
                "Upvotes": 22
            },
            {
                "Content": "/r/Darwinstagram",
                "Upvotes": 1
            },
            {
                "Content": "I can't stand anti-vaxxers either, but calling their deaths \"beautiful\" is kinda fucked up.",
                "Upvotes": 7
            },
            {
                "Content": "Your a whack job",
                "Upvotes": 5
            },
            {
                "Content": "Yikes.",
                "Upvotes": 2
            },
            {
                "Content": "I don’t know you and don’t want to make any assumptions but if you really get off that hard about people dying - anti-vaxx or not - you need some professional help.",
                "Upvotes": 2
            },
            {
                "Content": "you're gonna love r/hermancainaward",
                "Upvotes": 2
            },
            {
                "Content": "[removed]",
                "Upvotes": 3
            },
            {
                "Content": "I have a childhood memory of playing hide and seek at a popular view point near the top of our local mountain.  I was probably a few years older than the youth here but not much bigger.  I remember tripping and sliding on my belly face first over one lip of cascading rocks and up to the edge of the second lip.  The third lip was a cliff.   It wasn't too close of a call but I was entirely unattended and a distant scream would have been the only clue something had happened.  \n\nI was pretty coordinated and balanced too, above average, but rocky mountain areas aren't made for running around wildly.",
                "Upvotes": 29
            },
            {
                "Content": "I don't know about that, I did bungee and parachute jump once and the freefall felt much quicker than it really was",
                "Upvotes": -3
            },
            {
                "Content": "They didn’t die, so you’re all getting upset about something that didn’t happen 🤷‍♂️",
                "Upvotes": -34
            },
            {
                "Content": "If the kids died we would have seen it in the newspaper. Y’all are upset about something that didn’t happen. \n\nYou’re more likely to die driving to work than climbing Half Dome.",
                "Upvotes": -15
            },
            {
                "Content": "Why is it stupid? Nobody died. \n\nI did it and am very much alive. Y’all are cowards",
                "Upvotes": -2
            },
            {
                "Content": "137 recorded Shark attacks in 2021, 9 of which were fatal. [Source](https://www.floridamuseum.ufl.edu/shark-attacks/yearly-worldwide-summary/)\n\nShark attacks are still quite rare, but if 9 people died on the diving board in a single year the park would shut that down fast. \n\nI’m not saying it’s without risk, but people are acting like he gave that child a death sentence",
                "Upvotes": -20
            },
            {
                "Content": "Finally, some one here in the comments I agree with. Let the strong survive! That’s why I had so many kids, I didn’t expect them all to make it",
                "Upvotes": -3
            },
            {
                "Content": ">3 upvotes\n\nLol now -35",
                "Upvotes": 26
            },
            {
                "Content": "What’s dumb about it? I didn’t die, got an awesome view, had a lot of fun. This is literally a sub called sweaty palms, if everyone lived in a bubble this sub would be empty and life would be a lot more boring. \n\nLots of pearl clutching going on here.",
                "Upvotes": -9
            },
            {
                "Content": "The traffic one is the only one that seems accurate. Still an absolutely terrible take. And completely ignoring the poor supervision of children who would easily just fall without the rock needing to snap.",
                "Upvotes": -1
            },
            {
                "Content": "100% chance we will all die. I’m going to go have some fun in the meantime",
                "Upvotes": -1
            },
            {
                "Content": "Yeah, I wouldn’t recommend bringing kids up the cables. But everyone is acting like the kids are about to invent BASE jumping but without parachutes. They’ll be fine",
                "Upvotes": 2
            },
            {
                "Content": "You can see my other comment to you about statistics. Vending machines kill more people than sharks every year. So you better watch your ass when you’re going for that afternoon sugar hit. \n\nIf people were dying on the diving board the park service would shut that down sooo fast. But they don’t. The danger is in your head.",
                "Upvotes": 1
            },
            {
                "Content": "Thanks. The pearl clutching here is ridiculous. In this sub too, of all places",
                "Upvotes": 1
            },
            {
                "Content": "Sure but like 1 person will die. Maybe 2. \n\nStill worth it",
                "Upvotes": 1
            },
            {
                "Content": "Well, hello. 😛",
                "Upvotes": 2
            },
            {
                "Content": "Illegal af in the park, just fyi. Have fun running through the woods from the rangers",
                "Upvotes": 1
            },
            {
                "Content": "LOL, that’s true!",
                "Upvotes": 1
            },
            {
                "Content": "Hell yeah. Angels landing is one of my all time favorite day hikes. We went super early during the shoulder season to beat the crowds and missed most of the crowds",
                "Upvotes": 5
            },
            {
                "Content": "Hell no, I don’t like kids. Probably a bad call bringing them up the cables. This part is way less dangerous than the actual climb up. But that’s not my call to make.",
                "Upvotes": 5
            },
            {
                "Content": "Climbing Half Dome cables is way more dangerous than going on the diving board. He’s already out there, why not go? Nobody died.",
                "Upvotes": 4
            },
            {
                "Content": "[deleted]",
                "Upvotes": -1
            },
            {
                "Content": "Shukr khoda im not white😂",
                "Upvotes": 1
            },
            {
                "Content": "I just did glacier point 4 mile trail there, how does this compare?  Those switchbacks are rough.",
                "Upvotes": 6
            },
            {
                "Content": "Sounds epic. On my bucket list for sure.",
                "Upvotes": 2
            },
            {
                "Content": "you use clips on the cables? i've seen videos of people not and it seems scary.",
                "Upvotes": 2
            },
            {
                "Content": ">exiting\n\nyup",
                "Upvotes": 3
            },
            {
                "Content": "Exactly, how do they get down after he falls…",
                "Upvotes": 8
            },
            {
                "Content": "only if the kid falls",
                "Upvotes": 6
            },
            {
                "Content": "Child Abuse, is he beating or rape the hildrens?",
                "Upvotes": 0
            },
            {
                "Content": "You are.",
                "Upvotes": 1
            },
            {
                "Content": "Make the assumptions. Assume his mental health. You will very likely be spot on.\n\nLike you were, when you made the assumption.",
                "Upvotes": 2
            },
            {
                "Content": "Yah too bad trump kicked me and 35,000,000 other Americans of our mental health care… oh well now do the people that get off on spreading a preventable illness… do they need mental health care too lmfao 🤣",
                "Upvotes": 0
            },
            {
                "Content": "They are who inspired me. We had to change our name to anti vaxxers going to the forever box… because for some reason conservatives love cancel culture and can’t laugh at themselves…",
                "Upvotes": 2
            },
            {
                "Content": "Reported for what meanwhile you just said the no no word",
                "Upvotes": 1
            },
            {
                "Content": "Different when you are secured, if you're plummeting towards certain death though...",
                "Upvotes": 7
            },
            {
                "Content": "And that's why you don't have a kid",
                "Upvotes": 5
            },
            {
                "Content": "Your response leads me to believe you didn’t read what i said.",
                "Upvotes": 12
            },
            {
                "Content": "> You’re more likely to die driving to work than climbing Half Dome.\n\nwhere did you get this obviously preposterously incorrect fact?",
                "Upvotes": 3
            },
            {
                "Content": "[removed]",
                "Upvotes": 1
            },
            {
                "Content": "do you drive with a seatbelt?",
                "Upvotes": 7
            },
            {
                "Content": "But orders of magnitude more people go into the ocean than climb half dome",
                "Upvotes": 24
            },
            {
                "Content": "You need to compare how many people are killed by sharks when in a place where that can happen vs how many people have died falling from that spot based on how many people have been on that spot.\n\nOf course when comparing direct numbers like that, the number of people who have swam in the ocean is significantly higher than the number of people who have stood on the diving board at half dome.",
                "Upvotes": 8
            },
            {
                "Content": "Your logic is a little flawed here. 0 to 1 people die a year from skydiving with no parachute, but if I do it there is a significant chance of dying. It’s akin to your shark analogy, millions of people in the ocean, 9 die. 100’s of people on this rock, - few die. 9/1000000 is better odds than 2/100",
                "Upvotes": 0
            },
            {
                "Content": "9 fatal shark attacks in the world, and how many falling deaths IN the WORLD. While I agree you take calculated risks this one isn't for me lol. That rock has there forever but that has nothing to do with how long it'll remain there.",
                "Upvotes": -1
            },
            {
                "Content": "Ants be like.",
                "Upvotes": 3
            },
            {
                "Content": "Rock is very strong in compression and weak in tension. Sitting on the end of it there generates, you guessed it, lots of tension. A slight imperfection could cause it to just snap off, something as small as the person before dropping their phone and starting a tiny crack. This is why they put steel rods in concrete. Same premise.",
                "Upvotes": 11
            },
            {
                "Content": "don't introduce him to Alex Honnold.",
                "Upvotes": 10
            },
            {
                "Content": "This sub is about watching people do dumb things",
                "Upvotes": 1
            },
            {
                "Content": "Sweaty palms does not mean putting your kids at risk. If he died, no problem.",
                "Upvotes": 0
            },
            {
                "Content": "If that's what it takes for you to feel something, you've got some issues my dude. Take care of yourself.",
                "Upvotes": 0
            },
            {
                "Content": "per capita?  how many people stand in front of a vending machine compared to how many people are in front of a shark?  i think you have absolutely no understanding of statistics.  see my other comment to you.",
                "Upvotes": 3
            },
            {
                "Content": "Seethers gonna seethe",
                "Upvotes": 0
            },
            {
                "Content": "Bunch of basement dwellers tbh",
                "Upvotes": -5
            },
            {
                "Content": "Hi there",
                "Upvotes": 1
            },
            {
                "Content": "/s",
                "Upvotes": 4
            },
            {
                "Content": "Yes but it’s also a good joke about racism and religion so it’s ok.",
                "Upvotes": 3
            },
            {
                "Content": "It’s a joke not a dick.",
                "Upvotes": 1
            },
            {
                "Content": "I’m not sure if I did Glacier Point while I was there. I looked it up and both GP and HD are rated as “hard trails”. Half Dome is significantly longer though, at 16 miles",
                "Upvotes": 2
            },
            {
                "Content": "I didn’t. The only people I remember seeing clip-in were some kids. My buddy and I did have rubber palmed gloves. Those were quite helpful and, in my opinion, very necessary. \n\n*When he and I got back down, we offered our helpful but very sweaty gloves to a couple about to go up. They took us up on the offer. Seems pretty gross to put on a strangers sweat drenched gloves but if I didn’t have them, I would have taken them too",
                "Upvotes": 2
            },
            {
                "Content": "Quickly?",
                "Upvotes": 3
            },
            {
                "Content": "If you fall, you're putting those kids in a position to fend for themselves.",
                "Upvotes": 0
            },
            {
                "Content": "Got the link? I did a search but couldn't find it.",
                "Upvotes": 1
            },
            {
                "Content": "While the parachute was scary but exciting but I jumped incorrectly while bungeeing and it felt like I'll die because of that for a second",
                "Upvotes": 1
            },
            {
                "Content": "sorry, do you think stupid people don't have kids? in this thread?",
                "Upvotes": 4
            },
            {
                "Content": "Haha you don’t know that. I could have 10 kids that I homeschool and teach them that the earth is flat. Isn’t the internet wonderful!",
                "Upvotes": -11
            },
            {
                "Content": "Those kids are leading an exciting life. They may have even gone out on the diving board. They didn’t die. Looks like that parent is leading an awesome example to me. But sure, you know better",
                "Upvotes": -4
            },
            {
                "Content": "I do hope you’re joking, but just in case statistics are tricky for you:\n\n“There were 35,766 fatal motor vehicle crashes in the United States in 2020 in which 38,824 deaths occurred. This resulted in 11.7 deaths per 100,000 people” [Source](https://www.iihs.org/topics/fatality-statistics/detail/state-by-state)\n\n20 people have died on Half Dome. Ever. Well since they started tracking anyway. Even generously extending it to the 60 that account for the ascent, that’s still significantly less than those who die driving. [Source](https://www.yosemitehikes.com/yosemite-valley/half-dome/half-dome.htm)",
                "Upvotes": 0
            },
            {
                "Content": "Your submission was removed because it is not civil.\n\n*The SweatyPalms-ModTeam account is a bot account. Do not chat or PM them, as the account is not monitored.*",
                "Upvotes": 1
            },
            {
                "Content": "Yup. Driving is dangerous as fuck",
                "Upvotes": -1
            },
            {
                "Content": "20 recorded deaths on Half Dome. Ever. \n\nI understand it’s not without risk. But everyone is making a big deal about what amounts to another low risk activity. One that gets an awesome view of one of the most beautiful places on earth. It’s a subjective call and for me it’s 100% worth it",
                "Upvotes": -9
            },
            {
                "Content": "So one person will die eventually. Maybe even two. But thousands of people have stood on this spot and not died. Y’all are overreacting.",
                "Upvotes": -5
            },
            {
                "Content": "Very much doubt mr \"I went on the diving board, so fun, got pics!\" is anything like Honnold. But sure. By the way, it's her.",
                "Upvotes": 7
            },
            {
                "Content": "No, it’s about people doing intense or scary things. You’re thinking of winstupidprizes, but admittedly there is an overlap.",
                "Upvotes": 2
            },
            {
                "Content": "Bubble wrap your kids and never let them go outside. No cars, no oceans, certainly no vending machines. And keep them away from the grumpsters here on Reddit that take everything too seriously. Couldn’t have them getting their feelings hurt.",
                "Upvotes": 1
            },
            {
                "Content": "Idk but ok",
                "Upvotes": 1
            },
            {
                "Content": "Didn't know",
                "Upvotes": 1
            },
            {
                "Content": "Haha appreciate the laugh homie, needed that to start the day..",
                "Upvotes": 1
            },
            {
                "Content": "i don't justify that guys actions, people do stupid shit. but its not like half dome is vacant wilderness, there are lots of good people up there who would see that they ended up in the right hands\n\nits funny that its legal to risk falling off, but illegal to jump wearing a parachute",
                "Upvotes": 3
            },
            {
                "Content": "I quit using Facebook back in may… wouldn’t be surprised if the republicans got it zucked again",
                "Upvotes": 1
            },
            {
                "Content": "Oh man, that feeling.\n\nI've only felt it once, on a ride in New Jersey. It felt like the restraint had given way and I was plummeting 100ft. But it was just the ride dropping with me 😅",
                "Upvotes": 2
            },
            {
                "Content": "Fair point",
                "Upvotes": 4
            },
            {
                "Content": "If you had kids, they would probably be dead at this point",
                "Upvotes": 6
            },
            {
                "Content": "Awesome example? More like irresponsible and reckless example.",
                "Upvotes": 3
            },
            {
                "Content": "you need deaths adjusted to time doing that activity.  compare driving for 1000 hours and getting in 2 accidents to climbing for 1 hour and falling once.  how many people have climbed half dome with no security harness? how many people stand on the diving board per year? compare that to how many people are in a vehicle every year.  do you understand how insane a claim you're making?",
                "Upvotes": 1
            },
            {
                "Content": "You... don't understand how statistics work. Or possibly even basic comparative frameworks.  \n\nMy car was in zero fatal car crashes in 2020, therefore driving my car is safer than climbing Half Dome. \n\nCheck mate, you starry-eyed genius.",
                "Upvotes": 1
            },
            {
                "Content": "But I drove yesterday and didn't die so it must be completely safe according to the way you've been talking. Maybe next time I'll strap my kid to the roof of my car. If he's still alive by the time I make it to my destination I'm clearly not a bad parent as it's been proven safe and I've provided my child a stimulating experience. Next time I'll try having him just hold on to the roof rack without the strap.",
                "Upvotes": 9
            },
            {
                "Content": "No it’s not, I’ve driven without a seatbelt and I’m still alive why are you claiming it’s dangerous as fuck when I’m clearly still alive.",
                "Upvotes": 1
            },
            {
                "Content": "Your logic is flawed. If you are comparing falling deaths in half dome to shark attacks, it has to be in an equal area. A large beach or series of beaches somewhere. If you compare accidental falling deaths from great heights while exploring/taking risky photos/getting a closer look worldwide to shark attacks worldwide, you'd have a a much more accurate idea of the risk of each.\n\nThe Grand Canyon alone averages two or three falling deaths a year.",
                "Upvotes": 2
            },
            {
                "Content": "You clearly don't maths",
                "Upvotes": 1
            },
            {
                "Content": "Damn bro you must just be harder than most people 🤷‍♂️",
                "Upvotes": 4
            },
            {
                "Content": "I mean people die every year in my hood on maroon bells. I’m just not really one to trust a highly trafficked area, your threat model may vary",
                "Upvotes": 2
            },
            {
                "Content": "I’m not that good of a climber, but I did meet him and he was super nice!\n\nUnlike you. You’re rude and probably boring af",
                "Upvotes": -9
            },
            {
                "Content": "Nobody gives a shit.",
                "Upvotes": -5
            },
            {
                "Content": "I'm not disagreeing with either party here tbh. I've climbed with Alex at the gym (same hometown) and I'm fine with his choices, however I would not stand on that \"diving board\" either, certainly not with little kids behind me. Apologies for the misassumption.",
                "Upvotes": 1
            },
            {
                "Content": "Speaking of feelings hurt, you've posted about this like 40 times in less than 24 hours lololll",
                "Upvotes": 2
            },
            {
                "Content": "Many many more people would die jumping off then just standing on that over time.",
                "Upvotes": 1
            },
            {
                "Content": "Lol. Well if you want to join mastodon tell me and I'll follow you. https://mstdn.social/@jinkee",
                "Upvotes": 1
            },
            {
                "Content": "At least they would die having fun! The strong one will survive and our genes will flourish!\n\nUnlike you, dying in your basement of radon poisoning (a real threat, unlike the diving board at Half Dome)",
                "Upvotes": 0
            },
            {
                "Content": "Again, none of those children died on Half Dome. You are upset about something that didn’t happen",
                "Upvotes": -1
            },
            {
                "Content": "Lmao you destroyed them. Nice job.",
                "Upvotes": 2
            },
            {
                "Content": "I’d rather live an exciting life of calculated risks than sit in a bubble being afraid of everything. \n\nIt has nothing to do with “being hard”. Half Dome is what, a class II climb? Class III maybe? There are people out there sending 5.14+ and most people don’t consider Alex Honnold an idiot",
                "Upvotes": 0
            },
            {
                "Content": "Oh good, you figured out that it’s funny. Phew… I thought you were taking this all seriously. I mean what kind of idiot would take this stuff seriously?",
                "Upvotes": 1
            },
            {
                "Content": "they still jump there every day.",
                "Upvotes": 1
            },
            {
                "Content": "> they would die having fun\n\nNot with you as a parent lmao",
                "Upvotes": 5
            },
            {
                "Content": "Just because the kids didn't die doesn't make it okay. How stupid are you?",
                "Upvotes": 4
            },
            {
                "Content": "There’s a wide gulf between “being afraid of everything” and thinking it’s dumb af to do this",
                "Upvotes": 4
            },
            {
                "Content": "Oh, well there ya go. Problem solved lol",
                "Upvotes": 1
            },
            {
                "Content": "Climbing half dome is super fun. You should try it.",
                "Upvotes": 0
            },
            {
                "Content": "As least I’m not rude and boring like you 🤷‍♂️\n\nHave fun with your meaningless life haha",
                "Upvotes": -1
            },
            {
                "Content": "first time you get caught they just take your gear, every time after that its a felony",
                "Upvotes": 1
            },
            {
                "Content": "Boy, with how many times you've mentioned having done it in a row, it must be one of the only worthwhile things you've done, huh?",
                "Upvotes": 2
            },
            {
                "Content": "I don't doubt that climbing is fun, but you'd be perfectly capable of ruining the experience.",
                "Upvotes": 1
            },
            {
                "Content": "I'll take boring over stupid 🤷🏽‍♂️",
                "Upvotes": 2
            },
            {
                "Content": "Meaningless? Lol. You know nothing about me, child.",
                "Upvotes": 2
            },
            {
                "Content": "Oh fuck, felonies arent chill.",
                "Upvotes": 1
            },
            {
                "Content": "If you group it in with my summers spent exploring the Sierras then yeah, absolutely. I’m out there as often as possible, and Yosemite deserves its reputation for being beautiful. \n\nIf you ever get bored of being condescending to strangers on the internet I would highly suggest you give it a try!",
                "Upvotes": -1
            },
            {
                "Content": "Sure bud, have a great day 👍",
                "Upvotes": 1
            },
            {
                "Content": "I know that you’re having an argument on the internet with a stranger. Doesn’t exactly scream an over abundance of intelligence to me. But sure dude, lump on some more ad hominem attacks if it makes you feel better. Might even get some extra credit in clown school",
                "Upvotes": 1
            },
            {
                "Content": "and they're just trying to practice their sport\n\ngear isn't cheap either, at least $4k for a base setup",
                "Upvotes": 1
            },
            {
                "Content": "> If you ever get bored of being condescending to strangers on the interne\n\nThe fact that this was said without a trace of irony is frankly the funniest thing I've seen today lol",
                "Upvotes": 1
            },
            {
                "Content": "Don't you have anything better to do than troll this sub? Get a life!",
                "Upvotes": 2
            },
            {
                "Content": "Id take 4k any day of the week and twice on sundays to avoid a felony",
                "Upvotes": 1
            },
            {
                "Content": "Yes, please explain irony to me. You see I’m too dull to really grasp it. I need your help. Im just a simpleton 😢",
                "Upvotes": -1
            },
            {
                "Content": "An example irony in this context would be you trying to imply you understand irony but confusing it with sarcasm. \n\nYou could also understand your sarcastic characterization of yourself as \"just a simpleton\" as dramatic irony, i.e., you think you're being sarcastic, but anyone that reads your recent comments knows it's closer to the truth than you do.",
                "Upvotes": 1
            },
            {
                "Content": "Aww did someone piss in your cheerios this morning? You seem grumpy",
                "Upvotes": 0
            },
            {
                "Content": "[deleted]",
                "Upvotes": 2
            },
            {
                "Content": "If I’m an idiot, and you’re arguing with me in a Reddit comment section… you might also be an idiot. You should go see a doctor, get that looked at. Could be serious. I’m really worried about you.",
                "Upvotes": 0
            }
        ]
    },
    {
        "Title": "Hiker falls from Half Dome",
        "Upvotes": 6,
        "Comments": [
            {
                "Content": "Can't wait for some idiot to repost this in r/DarwinAwards",
                "Upvotes": 6
            },
            {
                "Content": "Rumor has it there was a 16 year old impressionable girl on the trail below.",
                "Upvotes": 4
            },
            {
                "Content": "Hilarious video! I am sorry the karens on patrol tonight.",
                "Upvotes": 4
            },
            {
                "Content": "Nice acting 😂",
                "Upvotes": 3
            },
            {
                "Content": "It's quite obvious he has a base rig on...",
                "Upvotes": 2
            },
            {
                "Content": "What a stupid video. He clearly has a BASE rig on and cut the video just before he deployed. \n\nHe did not \"fall\" from Half Dome, he jumped intentionally.",
                "Upvotes": -14
            },
            {
                "Content": "stupid fuck needs to be charged.\n\ntake that $2k right out of his pocket.",
                "Upvotes": -8
            },
            {
                "Content": "Dude Bro, my guy. Righteous backpack, but why does it have leg straps?",
                "Upvotes": 1
            },
            {
                "Content": "Don't just let your dreams be dreams",
                "Upvotes": 1
            },
            {
                "Content": "😂😂 shes all grown up now.",
                "Upvotes": 1
            },
            {
                "Content": "/r/thatsthejoke",
                "Upvotes": 15
            },
            {
                "Content": "Pretty funny though, I liked it",
                "Upvotes": 5
            },
            {
                "Content": "Karens out in force tonight.",
                "Upvotes": 5
            },
            {
                "Content": "Charged for BASE jumping?",
                "Upvotes": 3
            },
            {
                "Content": "What are you, a cop?",
                "Upvotes": 1
            },
            {
                "Content": "Because it is a magic backpack.",
                "Upvotes": 3
            },
            {
                "Content": "A joke usually requires humor or something funny... this was just stupid.\n\nStupid can be hilarious. This wasn't it.",
                "Upvotes": -13
            },
            {
                "Content": "NPS expanding their online presence? Ranger Danger in r/skydiving",
                "Upvotes": 1
            },
            {
                "Content": "Last I heard it was illegal to jump in national parks",
                "Upvotes": -1
            },
            {
                "Content": ">Charged for BASE jumping?\n\nNot for BASE. Maybe, however, for being dumb enough to put it on YouTube.\n\nIt might be a little old school, but I think it's prudent not to have internet click bait with the alternate title of: ***Exibit (A***\n\nIf we're being fair, though, I don't have a dog in the race, nor do I care.",
                "Upvotes": 0
            },
            {
                "Content": "Park Ranger maybe? 😂",
                "Upvotes": 1
            },
            {
                "Content": "Cha-haha... yeah, it is!",
                "Upvotes": 1
            },
            {
                "Content": "I bet you are a riot at parties!",
                "Upvotes": 15
            },
            {
                "Content": "It is but they still do it.  It is ok to free solo.  Put a base rig on and fall while free soloing and it becomes illegal if you pull.",
                "Upvotes": 11
            },
            {
                "Content": "Very good point",
                "Upvotes": 2
            }
        ]
    }
]